{"https://www.recordedfuture.com/best-practices-robust-identity-management/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-17", "source": "www.recordedfuture.com"}, "text": "Best Practices for Robust Identity Management November 17, 2021 •\nHarry O'Brien Strong identity authentication is more important than ever before as organizations face an expanding threat landscape and unprecedented level of attacks. This is further compounded with the rapid growth in remote work and digital interactions across multiple channels, as it introduces new challenges for security and IT teams responsible for securing their employees’ and customers’ identities. In short, verifying user identities and controlling access to sensitive data is critical, but difficult to achieve. A recent Forrester report, Best Practices: Identity Management and Governance , outlines these challenges, along with many others, that security and identity management teams are facing today. The report found that many organizations are overprovisioning their employees’ access to systems, with research finding that breached employees had 86% more access than required. And, according to Forrester, “despite attempts to address identity sprawl, many organizations struggle to maintain a consistent, rules-based approach to centrally orchestrate the vast array of user accounts and digital access points under their stewardship,” leaving these organizations vulnerable to identity fraud and exposed to financial, legal, and reputational consequences. It’s clear that organizations today require an automated, high-confidence method of managing access and ensuring the authenticity of all users on their network, but this is easier said than done as teams struggle to proactively mitigate the risks that dynamic users and access points create. With this in mind, Forrester outlined 10 key functional areas within identity management that organizations must prioritize, providing best practices within those specific areas. With an intelligence-driven approach to these functional areas, organizations can rest assured that they have a real-time, high-fidelity view of their identity security posture. Automate Password Resets Forrester reports that, “A North American healthcare organization spends $160 to $170 per employee per year on password-related issues… Automation can reduce these costs.” By automatically collecting information on compromised credentials from a vast range of open source, dark web, and technical sources, the Recorded Future Identity Intelligence module offers real-time, machine-readable intelligence that can be directly integrated with existing identity management workflows within any tool, including SOAR solutions like Swimlane . This approach enables organizations to scale their identity management processes, saving time and money for the business, while offering an unmatched source of truth for identity authenticity. Tune Identity Analytics To Avoid False Positives Forrester also recommends that security and identity teams “leverage analytics tools to deliver intelligence across a range of identity use cases.” Additionally, Forrester insisted that these intelligence solutions will only benefit teams if they are able to “parse the signal from the noise” and “ingest, normalize, interpret, and present the data for accurate, actionable results.” Recorded Future’s Identity Intelligence module provides unmatched access to stolen credential information, related to both employee and customer identities, providing organizations with high-confidence, relevant alerts. Organizations can then confidently take action and block access to corporate systems before the compromised identities of employees are exploited, and can ensure customer credentials are secure when accessing any portals or information. This ultimately empowers organizations to be more proactive in preventing identity fraud and dramatically reduces the amount of time it takes to prioritize and respond to real risks to the business. Forrester makes it clear that as the attack surface grows daily, organizations need to advance their security and identity practices and deepen their understanding of their threat landscape. With Identity Intelligence from Recorded Future, organizations are able to quickly detect threats and initiate downstream response workflows, disrupting adversaries before damage is done. To learn more practical steps you can implement now to inform better decisions with risk-based context, request a demo of the Identity Intelligence module and read the full Forrester report ."}}
{"https://www.recordedfuture.com/recorded-future-partners-swimlane-identity-fraud-protection/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-04", "source": "www.recordedfuture.com"}, "text": "Recorded Future Partners With Swimlane For Intelligence-Driven Identity Fraud Prevention November 4, 2021 •\nEllen Wilson Recorded Future and Swimlane are pleased to announce the release of a new integration to support security teams in intelligence-driven identity fraud prevention. The integration will allow joint clients to leverage Recorded Future Identity Intelligence in Swimlane to accelerate detection of identity compromises and simplify response workflows, in order to maximize existing security investments. The Recorded Future Identity Intelligence module enables security and IT teams to detect identity compromises, for both employees and customers, and respond confidently — without any manual research. Recorded Future automates the collection, analysis, and production of intelligence from a vast range of open source, dark web, and technical sources, and then combines it with world-class research to help drive an accelerated response by security teams. This approach produces real-time intelligence at massive scale, offering an unmatched source of truth for identity authenticity that teams can utilize to prioritize identity threats and initiate downstream response workflows in Swimlane . With the Recorded Future integration for Swimlane , as identity compromises are detected, Swimlane’s low-code automation capabilities make it possible to enrich the exposed accounts, verify if the user is still an employee, if the current password matches the exposed password, and if the exposure was a recycled or novel leak. Depending on the results of this process, Swimlane initiates a specific workflow to remediate the threat and protect the organization: Revoke application access from former employees Employees are leaving the workforce or changing jobs at a record pace. Securely offboarding employees requires IT and security teams to follow procedures to ensure that the departing employees access to corporate systems is revoked. This process is often manual, and therefore error prone. The Recorded Future integration for Swimlane audits active corporate credentials and automatically revokes access in the event that a former employee still has active logins. This results in the remediation of vulnerabilities and time saved for analysts. Mitigate ransomware with company-wide secure passwords Recycling and reusing passwords is a security taboo, but employees inevitably do it anyway. This leaves corporate systems more vulnerable to external threats. With the Recorded Future integration for Swimlane, Swimlane notifies security teams when Recorded Future detects the use of recycled or commonly used passwords, so security teams can proactively ensure that every access point to internal systems are appropriately secured. Since all of this can be done with full automation on a recurring schedule, monitoring and responding to identity exposures no longer has to be a complex and time-consuming process. By eliminating the need to manually aggregate, correlate, and triage information, the Recorded Future Identity Intelligence module integrated into Swimlane empowers analysts to dramatically reduce the amount of time it takes to detect, investigate, and respond to identity fraud and real risks to their business. To learn more about how Recorded Future and Swimlane are partnering, register for the upcoming joint webinar: Automation and Intelligence: Key Ingredients for Modern Security Strategies on December 2 at 11AM ET."}}
{"https://www.recordedfuture.com/strong-digital-identity-authentication-more-important/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-27", "source": "www.recordedfuture.com"}, "text": "Why Strong Digital Identity Authentication Is More Important Than Ever October 27, 2021 •\nThe Recorded Future Team 79% of organizations experienced an identity-related breach within the past two years alone . And 85% of cybercriminals accessed critical systems and data using stolen credentials . These numbers are a frightening wake-up call that all organizations are targets –regardless of size, market, or industry– and that bad actors are constantly looking for new ways to exploit and breach your company. Particularly over the past couple of years, the rise of new technologies and new ways of working has significantly expanded the playing field for cybercriminals. Here’s why: Security practices are outdated : While most business now takes place outside the four walls of the office via cloud, SaaS, mobile and IoT, many organizations are still focused on securing the perimeter – an approach that can’t scale to support today’s highly distributed workforce and the cloud-based applications they need to access to be productive. Ecosystems are more dynamic and complex: Every person within your ecosystem – employees, partners and customers – is a target for cybercriminals looking to steal credentials and gain access to critical systems or information. Those players within your ecosystem likely don’t always follow password and security best practices. But, it is your responsibility to monitor and verify their identity authenticity at all times. Security, Operations and IT Teams are overwhelmed : The rapid shift to a mostly remote workforce created a spike in required credentials, with more people needing access to critical business systems, platforms and channels via multiple devices. Today’s security and IT teams are overwhelmed and, admittedly, far less optimistic about their abilities to secure employee identities. Take control with proactive, intelligence-led identity fraud detection Identity protection plays a critical role within an overall security strategy, which is why 80% of organizations have increased their focus on identity security over the past year. While you can’t stop cybercriminals from attempting an attack, you can outsmart, outmaneuver and stop them with the right solutions, processes and policies in place. With an intelligence-driven approach to identity fraud prevention, you can proactively defend your organization against identity compromises in real time and take action before damage to the business is done. What do we mean by intelligence-driven? Like most companies you are likely flooded with data 24×7, but what are you able to do with all that information? The key is having quick access to useful and actionable data that you can trust. That’s where intelligence comes in. Intelligence is the key to unlocking the potential of security programs and protecting our organizations. The right intelligence, in the hands of the right people, at the right time, stops attackers in their tracks. Here’s how it works: Account takeover prevention : Quickly detect compromises and initiate downstream response workflows before an account takeover occurs Employee identity monitoring : Automate monitoring in real time across the broadest set of sources, including the dark web for mentions of employee credentials Third-party identity monitoring : Automate monitoring and verification of customer and supply chain partner identities to detect and block identity fraud activities Recorded Future provides real-time intelligence at massive scale Cases of identity theft more than doubled in 2020, according to the Federal Trade Commission. And malware, which is often used for identity theft, increased 358% in 2020 . Now is the time to act by implementing an identity fraud protection strategy designed to scale with the pace and complexity of our digital world. With Identity Intelligence from Recorded Future , your security and IT teams are no longer bogged down by manual research. Recorded Future automates the collection, analysis, and production of intelligence from a vast range of open source, dark web, and technical sources, and then combines it with world-class research to help drive an accelerated response by your security team. To learn more about intelligence-led identity fraud detection and Identity Intelligence from Recorded Future, read our new eBook: It’s Time to Take a New Approach to Identity Fraud Protection ."}}
{"https://www.recordedfuture.com/wethenorth-canadian-dark-web/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-19", "source": "www.recordedfuture.com"}, "text": "WeTheNorth: A New Canadian Dark Web Marketplace October 19, 2021 •\nThe Recorded Future Team This Summer, Insikt Group discovered a new Canada-focused darknet marketplace called WeTheNorth, a salute to the Toronto Raptors basketball team slogan. This localized criminal marketplace features a variety of illegal goods and services for sale, many of which pose a threat to local and global enterprises. Insikt Group judges that with moderate confidence that WeTheNorth market was likely created to replace the now debunked The Canadian Headquarters, which shut down in July 2021.  Insikt Group’s Criminal Underground Team first discovered WeTheNorth in July 2021 in advertisements posted on open source forums such as Reddit. The new market appears similar in appearance to the now-debunked Empire market, Alpha Bay, and Torrez. What makes WeTheNorth unique is the lengths the administrators have gone to create a marketplace that is ostensibly geared toward protecting Canadian buyers and sellers and fostering a relatively safe place to complete transactions. Their mission statement is “to provide a safe environment so that Canadians are able to purchase safely, scam-free and away from the street violence, drugs and other items that are more potent, cleaner and safer to use.” The rules of the marketplace are geared towards reigning in what types of services can be sold, as well as being explicit about what is not allowed: sharing of third-party contact information, sales of weapons, and anything related to terrorism. Additional safeguards include mandatory two-factor authentication (2FA) for all vendors, when signing up users are given a unique token to protect their account, vendor fees are non-refundable to prevent scamming, and there are rules in place to prevent padding accounts with fake reviews. Like many darknet markets that operate in service of customers,  WeTheNorth offers 24/7 customer service in both English and French, and it’s open to anyone who uses the site. Vendors or buyers having trouble with the site can reach out and ask for assistance at any time, report technical issues, vendor problems, and scams. The types of transactions that occur on WeTheNorth are largely illegal and undermine any appearance of legitimacy. The most popular sales are drugs such as marijuana, cocaine, and party drugs, but WeTheNorth marketplace also allows the sale of digital products such as stolen credit cards, login credentials, accesses, software and hardware exploits, fraud tutorials, and more. Insikt Group researchers discovered issues with the policing and categorization of listings on WeTheNorth market. Many items are cross-posted and do not align with the category they are listed under. The administrator of the site, whose contact information is also associated with other darknet markets,  has not cracked down on cross-category posting and multiple listings, which could be an indicator that their attention is still focused elsewhere,  leaving WeTheNorth open to low-level drug sellers that wish to bypass market rules. WeTheNorth is a new Canadian dark web marketplace that appears to be hosting a semi-safe space for locals to sell illegal goods and services. There are strict rules in place and they have banned certain categories to help the site be more legitimate and not attract a certain clientele. Dark web markets like WeTheNorth serve as valuable sources of cyber threat intelligence for both private and public sector alike. Insikt Group has observed an increase in localized dark web markets and predicts with moderate confidence that criminal underground websites such as WeTheNorth will continue to increase as international criminals look to localize operations and avoid international law enforcement. As law enforcement cracks down on dark markets and threat actors move quickly to stand up replacement websites, it is imperative for information security teams to monitor these sources for fraud, theft, and targeting of employees, and be able to stop fraudsters and cybercriminals before they use these tools to move through the attack chain.  Recorded Future clients can access more information about WeTheNorth market and other darknet activity through Intelligence Cards in the Recorded Future platform."}}
